/* automatically generated by rust-bindgen 0.70.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const RTC_FEATURE_ALARM: u32 = 0;
pub const RTC_FEATURE_ALARM_RES_MINUTE: u32 = 1;
pub const RTC_FEATURE_NEED_WEEK_DAY: u32 = 2;
pub const RTC_FEATURE_ALARM_RES_2S: u32 = 3;
pub const RTC_FEATURE_UPDATE_INTERRUPT: u32 = 4;
pub const RTC_FEATURE_CORRECTION: u32 = 5;
pub const RTC_FEATURE_BACKUP_SWITCH_MODE: u32 = 6;
pub const RTC_FEATURE_ALARM_WAKEUP_ONLY: u32 = 7;
pub const RTC_FEATURE_CNT: u32 = 8;
pub const RTC_PARAM_FEATURES: u32 = 0;
pub const RTC_PARAM_CORRECTION: u32 = 1;
pub const RTC_PARAM_BACKUP_SWITCH_MODE: u32 = 2;
pub const RTC_BSM_DISABLED: u32 = 0;
pub const RTC_BSM_DIRECT: u32 = 1;
pub const RTC_BSM_LEVEL: u32 = 2;
pub const RTC_BSM_STANDBY: u32 = 3;
pub const RTC_MAX_FREQ: u32 = 8192;
pub const _U: u32 = 1;
pub const _L: u32 = 2;
pub const _D: u32 = 4;
pub const _C: u32 = 8;
pub const _P: u32 = 16;
pub const _S: u32 = 32;
pub const _X: u32 = 64;
pub const _SP: u32 = 128;
pub const SEQ_SKIP: u32 = 1;
pub const POLLIN: u32 = 1;
pub const POLLPRI: u32 = 2;
pub const POLLOUT: u32 = 4;
pub const POLLERR: u32 = 8;
pub const POLLHUP: u32 = 16;
pub const POLLNVAL: u32 = 32;
pub const POLLRDNORM: u32 = 64;
pub const POLLRDBAND: u32 = 128;
pub const POLLWRNORM: u32 = 256;
pub const POLLWRBAND: u32 = 512;
pub const POLLMSG: u32 = 1024;
pub const POLLREMOVE: u32 = 4096;
pub const POLLRDHUP: u32 = 8192;
pub const EPOLL_CLOEXEC: u32 = 524288;
pub const EPOLL_CTL_ADD: u32 = 1;
pub const EPOLL_CTL_DEL: u32 = 2;
pub const EPOLL_CTL_MOD: u32 = 3;
pub const EPOLL_IOC_TYPE: u32 = 138;
pub const MAX_STACK_ALLOC: u32 = 832;
pub const FRONTEND_STACK_ALLOC: u32 = 256;
pub const SELECT_STACK_ALLOC: u32 = 256;
pub const POLL_STACK_ALLOC: u32 = 256;
pub const WQUEUES_STACK_ALLOC: u32 = 576;
pub const RTC_DEV_BUSY: u32 = 0;
pub const RTC_NO_CDEV: u32 = 1;
pub const RTC_TIMESTAMP_BEGIN_0000: i64 = -62167219200;
pub const RTC_TIMESTAMP_BEGIN_1900: i64 = -2208988800;
pub const RTC_TIMESTAMP_BEGIN_2000: u32 = 946684800;
pub const RTC_TIMESTAMP_END_2063: u32 = 2966371199;
pub const RTC_TIMESTAMP_END_2079: u32 = 3471292799;
pub const RTC_TIMESTAMP_END_2099: u32 = 4102444799;
pub const RTC_TIMESTAMP_END_2199: u64 = 7258118399;
pub const RTC_TIMESTAMP_END_9999: u64 = 253402300799;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ftrace_branch_data {
    pub func: *const ::std::os::raw::c_char,
    pub file: *const ::std::os::raw::c_char,
    pub line: ::std::os::raw::c_uint,
    pub __bindgen_anon_1: ftrace_branch_data__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ftrace_branch_data__bindgen_ty_1 {
    pub __bindgen_anon_1: ftrace_branch_data__bindgen_ty_1__bindgen_ty_1,
    pub __bindgen_anon_2: ftrace_branch_data__bindgen_ty_1__bindgen_ty_2,
    pub miss_hit: [::std::os::raw::c_ulong; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ftrace_branch_data__bindgen_ty_1__bindgen_ty_1 {
    pub correct: ::std::os::raw::c_ulong,
    pub incorrect: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ftrace_branch_data__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<ftrace_branch_data__bindgen_ty_1__bindgen_ty_1>() - 16usize];
    ["Alignment of ftrace_branch_data__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<ftrace_branch_data__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: ftrace_branch_data__bindgen_ty_1__bindgen_ty_1::correct"]
        [::std::mem::offset_of!(ftrace_branch_data__bindgen_ty_1__bindgen_ty_1, correct) - 0usize];
    ["Offset of field: ftrace_branch_data__bindgen_ty_1__bindgen_ty_1::incorrect"][::std::mem::offset_of!(
        ftrace_branch_data__bindgen_ty_1__bindgen_ty_1,
        incorrect
    ) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ftrace_branch_data__bindgen_ty_1__bindgen_ty_2 {
    pub miss: ::std::os::raw::c_ulong,
    pub hit: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ftrace_branch_data__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<ftrace_branch_data__bindgen_ty_1__bindgen_ty_2>() - 16usize];
    ["Alignment of ftrace_branch_data__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<ftrace_branch_data__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: ftrace_branch_data__bindgen_ty_1__bindgen_ty_2::miss"]
        [::std::mem::offset_of!(ftrace_branch_data__bindgen_ty_1__bindgen_ty_2, miss) - 0usize];
    ["Offset of field: ftrace_branch_data__bindgen_ty_1__bindgen_ty_2::hit"]
        [::std::mem::offset_of!(ftrace_branch_data__bindgen_ty_1__bindgen_ty_2, hit) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ftrace_branch_data__bindgen_ty_1"]
        [::std::mem::size_of::<ftrace_branch_data__bindgen_ty_1>() - 16usize];
    ["Alignment of ftrace_branch_data__bindgen_ty_1"]
        [::std::mem::align_of::<ftrace_branch_data__bindgen_ty_1>() - 8usize];
    ["Offset of field: ftrace_branch_data__bindgen_ty_1::miss_hit"]
        [::std::mem::offset_of!(ftrace_branch_data__bindgen_ty_1, miss_hit) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ftrace_branch_data"][::std::mem::size_of::<ftrace_branch_data>() - 40usize];
    ["Alignment of ftrace_branch_data"][::std::mem::align_of::<ftrace_branch_data>() - 8usize];
    ["Offset of field: ftrace_branch_data::func"]
        [::std::mem::offset_of!(ftrace_branch_data, func) - 0usize];
    ["Offset of field: ftrace_branch_data::file"]
        [::std::mem::offset_of!(ftrace_branch_data, file) - 8usize];
    ["Offset of field: ftrace_branch_data::line"]
        [::std::mem::offset_of!(ftrace_branch_data, line) - 16usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ftrace_likely_data {
    pub data: ftrace_branch_data,
    pub constant: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ftrace_likely_data"][::std::mem::size_of::<ftrace_likely_data>() - 48usize];
    ["Alignment of ftrace_likely_data"][::std::mem::align_of::<ftrace_likely_data>() - 8usize];
    ["Offset of field: ftrace_likely_data::data"]
        [::std::mem::offset_of!(ftrace_likely_data, data) - 0usize];
    ["Offset of field: ftrace_likely_data::constant"]
        [::std::mem::offset_of!(ftrace_likely_data, constant) - 40usize];
};
extern "C" {
    pub fn ftrace_likely_update(
        f: *mut ftrace_likely_data,
        val: ::std::os::raw::c_int,
        expect: ::std::os::raw::c_int,
        is_constant: ::std::os::raw::c_int,
    );
}
pub type __s8 = ::std::os::raw::c_schar;
pub type __u8 = ::std::os::raw::c_uchar;
pub type __s16 = ::std::os::raw::c_short;
pub type __u16 = ::std::os::raw::c_ushort;
pub type __s32 = ::std::os::raw::c_int;
pub type __u32 = ::std::os::raw::c_uint;
pub type __s64 = ::std::os::raw::c_longlong;
pub type __u64 = ::std::os::raw::c_ulonglong;
pub type s8 = __s8;
pub type u8_ = __u8;
pub type s16 = __s16;
pub type u16_ = __u16;
pub type s32 = __s32;
pub type u32_ = __u32;
pub type s64 = __s64;
pub type u64_ = __u64;
pub const false_: _bindgen_ty_1 = 0;
pub const true_: _bindgen_ty_1 = 1;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __kernel_fd_set {
    pub fds_bits: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_fd_set"][::std::mem::size_of::<__kernel_fd_set>() - 128usize];
    ["Alignment of __kernel_fd_set"][::std::mem::align_of::<__kernel_fd_set>() - 8usize];
    ["Offset of field: __kernel_fd_set::fds_bits"]
        [::std::mem::offset_of!(__kernel_fd_set, fds_bits) - 0usize];
};
pub type __kernel_sighandler_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
pub type __kernel_key_t = ::std::os::raw::c_int;
pub type __kernel_mqd_t = ::std::os::raw::c_int;
pub type __kernel_old_uid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_gid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_dev_t = ::std::os::raw::c_ulong;
pub type __kernel_long_t = ::std::os::raw::c_long;
pub type __kernel_ulong_t = ::std::os::raw::c_ulong;
pub type __kernel_ino_t = __kernel_ulong_t;
pub type __kernel_mode_t = ::std::os::raw::c_uint;
pub type __kernel_pid_t = ::std::os::raw::c_int;
pub type __kernel_ipc_pid_t = ::std::os::raw::c_int;
pub type __kernel_uid_t = ::std::os::raw::c_uint;
pub type __kernel_gid_t = ::std::os::raw::c_uint;
pub type __kernel_suseconds_t = __kernel_long_t;
pub type __kernel_daddr_t = ::std::os::raw::c_int;
pub type __kernel_uid32_t = ::std::os::raw::c_uint;
pub type __kernel_gid32_t = ::std::os::raw::c_uint;
pub type __kernel_size_t = __kernel_ulong_t;
pub type __kernel_ssize_t = __kernel_long_t;
pub type __kernel_ptrdiff_t = __kernel_long_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __kernel_fsid_t {
    pub val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_fsid_t"][::std::mem::size_of::<__kernel_fsid_t>() - 8usize];
    ["Alignment of __kernel_fsid_t"][::std::mem::align_of::<__kernel_fsid_t>() - 4usize];
    ["Offset of field: __kernel_fsid_t::val"]
        [::std::mem::offset_of!(__kernel_fsid_t, val) - 0usize];
};
pub type __kernel_off_t = __kernel_long_t;
pub type __kernel_loff_t = ::std::os::raw::c_longlong;
pub type __kernel_old_time_t = __kernel_long_t;
pub type __kernel_time64_t = ::std::os::raw::c_longlong;
pub type __kernel_clock_t = __kernel_long_t;
pub type __kernel_timer_t = ::std::os::raw::c_int;
pub type __kernel_clockid_t = ::std::os::raw::c_int;
pub type __kernel_caddr_t = *mut ::std::os::raw::c_char;
pub type __kernel_uid16_t = ::std::os::raw::c_ushort;
pub type __kernel_gid16_t = ::std::os::raw::c_ushort;
pub type __s128 = i128;
pub type __u128 = u128;
pub type __le16 = __u16;
pub type __be16 = __u16;
pub type __le32 = __u32;
pub type __be32 = __u32;
pub type __le64 = __u64;
pub type __be64 = __u64;
pub type __sum16 = __u16;
pub type __wsum = __u32;
pub type __poll_t = ::std::os::raw::c_uint;
pub type s128 = __s128;
pub type u128_ = __u128;
pub type __kernel_dev_t = u32_;
pub type fd_set = __kernel_fd_set;
pub type dev_t = __kernel_dev_t;
pub type ino_t = __kernel_ulong_t;
pub type mode_t = __kernel_mode_t;
pub type umode_t = ::std::os::raw::c_ushort;
pub type nlink_t = u32_;
pub type off_t = __kernel_off_t;
pub type pid_t = __kernel_pid_t;
pub type daddr_t = __kernel_daddr_t;
pub type key_t = __kernel_key_t;
pub type suseconds_t = __kernel_suseconds_t;
pub type timer_t = __kernel_timer_t;
pub type clockid_t = __kernel_clockid_t;
pub type mqd_t = __kernel_mqd_t;
pub type bool_ = bool;
pub type uid_t = __kernel_uid32_t;
pub type gid_t = __kernel_gid32_t;
pub type uid16_t = __kernel_uid16_t;
pub type gid16_t = __kernel_gid16_t;
pub type old_uid_t = __kernel_old_uid_t;
pub type old_gid_t = __kernel_old_gid_t;
pub type loff_t = __kernel_loff_t;
pub type clock_t = __kernel_clock_t;
pub type caddr_t = __kernel_caddr_t;
pub type u_char = ::std::os::raw::c_uchar;
pub type u_short = ::std::os::raw::c_ushort;
pub type u_int = ::std::os::raw::c_uint;
pub type u_long = ::std::os::raw::c_ulong;
pub type unchar = ::std::os::raw::c_uchar;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type ulong = ::std::os::raw::c_ulong;
pub type u_int8_t = u8_;
pub type u_int16_t = u16_;
pub type u_int32_t = u32_;
pub type u_int64_t = u64_;
pub type ktime_t = s64;
#[doc = " The type used for indexing onto a disc or disc partition.\n\n Linux always considers sectors to be 512 bytes long independently\n of the devices real block size.\n\n blkcnt_t is the type of the inode's block count."]
pub type sector_t = u64_;
pub type blkcnt_t = u64_;
pub type dma_addr_t = u64_;
pub type gfp_t = ::std::os::raw::c_uint;
pub type slab_flags_t = ::std::os::raw::c_uint;
pub type fmode_t = ::std::os::raw::c_uint;
pub type phys_addr_t = u64_;
pub type resource_size_t = phys_addr_t;
pub type irq_hw_number_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct atomic_t {
    pub counter: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of atomic_t"][::std::mem::size_of::<atomic_t>() - 4usize];
    ["Alignment of atomic_t"][::std::mem::align_of::<atomic_t>() - 4usize];
    ["Offset of field: atomic_t::counter"][::std::mem::offset_of!(atomic_t, counter) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct atomic64_t {
    pub counter: s64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of atomic64_t"][::std::mem::size_of::<atomic64_t>() - 8usize];
    ["Alignment of atomic64_t"][::std::mem::align_of::<atomic64_t>() - 8usize];
    ["Offset of field: atomic64_t::counter"][::std::mem::offset_of!(atomic64_t, counter) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcuref_t {
    pub refcnt: atomic_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcuref_t"][::std::mem::size_of::<rcuref_t>() - 4usize];
    ["Alignment of rcuref_t"][::std::mem::align_of::<rcuref_t>() - 4usize];
    ["Offset of field: rcuref_t::refcnt"][::std::mem::offset_of!(rcuref_t, refcnt) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct list_head {
    pub next: *mut list_head,
    pub prev: *mut list_head,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of list_head"][::std::mem::size_of::<list_head>() - 16usize];
    ["Alignment of list_head"][::std::mem::align_of::<list_head>() - 8usize];
    ["Offset of field: list_head::next"][::std::mem::offset_of!(list_head, next) - 0usize];
    ["Offset of field: list_head::prev"][::std::mem::offset_of!(list_head, prev) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hlist_head {
    pub first: *mut hlist_node,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hlist_head"][::std::mem::size_of::<hlist_head>() - 8usize];
    ["Alignment of hlist_head"][::std::mem::align_of::<hlist_head>() - 8usize];
    ["Offset of field: hlist_head::first"][::std::mem::offset_of!(hlist_head, first) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hlist_node {
    pub next: *mut hlist_node,
    pub pprev: *mut *mut hlist_node,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hlist_node"][::std::mem::size_of::<hlist_node>() - 16usize];
    ["Alignment of hlist_node"][::std::mem::align_of::<hlist_node>() - 8usize];
    ["Offset of field: hlist_node::next"][::std::mem::offset_of!(hlist_node, next) - 0usize];
    ["Offset of field: hlist_node::pprev"][::std::mem::offset_of!(hlist_node, pprev) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ustat {
    pub f_tfree: __kernel_daddr_t,
    pub f_tinode: ::std::os::raw::c_ulong,
    pub f_fname: [::std::os::raw::c_char; 6usize],
    pub f_fpack: [::std::os::raw::c_char; 6usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ustat"][::std::mem::size_of::<ustat>() - 32usize];
    ["Alignment of ustat"][::std::mem::align_of::<ustat>() - 8usize];
    ["Offset of field: ustat::f_tfree"][::std::mem::offset_of!(ustat, f_tfree) - 0usize];
    ["Offset of field: ustat::f_tinode"][::std::mem::offset_of!(ustat, f_tinode) - 8usize];
    ["Offset of field: ustat::f_fname"][::std::mem::offset_of!(ustat, f_fname) - 16usize];
    ["Offset of field: ustat::f_fpack"][::std::mem::offset_of!(ustat, f_fpack) - 22usize];
};
#[doc = " struct callback_head - callback structure for use with RCU and task_work\n @next: next update requests in a list\n @func: actual update function to call after the grace period.\n\n The struct is aligned to size of pointer. On most architectures it happens\n naturally due ABI requirements, but some architectures (like CRIS) have\n weird ABI and we need to ask it explicitly.\n\n The alignment is required to guarantee that bit 0 of @next will be\n clear under normal conditions -- as long as we use call_rcu() or\n call_srcu() to queue the callback.\n\n This guarantee is important for few reasons:\n  - future call_rcu_lazy() will make use of lower bits in the pointer;\n  - the structure shares storage space in struct page with @compound_head,\n    which encode PageTail() in bit 0. The guarantee is needed to avoid\n    false-positive PageTail()."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct callback_head {
    pub next: *mut callback_head,
    pub func: ::std::option::Option<unsafe extern "C" fn(head: *mut callback_head)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of callback_head"][::std::mem::size_of::<callback_head>() - 16usize];
    ["Alignment of callback_head"][::std::mem::align_of::<callback_head>() - 8usize];
    ["Offset of field: callback_head::next"][::std::mem::offset_of!(callback_head, next) - 0usize];
    ["Offset of field: callback_head::func"][::std::mem::offset_of!(callback_head, func) - 8usize];
};
pub type rcu_callback_t = ::std::option::Option<unsafe extern "C" fn(head: *mut callback_head)>;
pub type call_rcu_func_t =
    ::std::option::Option<unsafe extern "C" fn(head: *mut callback_head, func: rcu_callback_t)>;
pub type swap_r_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        a: *mut ::std::os::raw::c_void,
        b: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
        priv_: *const ::std::os::raw::c_void,
    ),
>;
pub type swap_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        a: *mut ::std::os::raw::c_void,
        b: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
    ),
>;
pub type cmp_r_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        a: *const ::std::os::raw::c_void,
        b: *const ::std::os::raw::c_void,
        priv_: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type cmp_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        a: *const ::std::os::raw::c_void,
        b: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct kcsan_scoped_access {}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kcsan_scoped_access"][::std::mem::size_of::<kcsan_scoped_access>() - 0usize];
    ["Alignment of kcsan_scoped_access"][::std::mem::align_of::<kcsan_scoped_access>() - 1usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct sysinfo {
    pub uptime: __kernel_long_t,
    pub loads: [__kernel_ulong_t; 3usize],
    pub totalram: __kernel_ulong_t,
    pub freeram: __kernel_ulong_t,
    pub sharedram: __kernel_ulong_t,
    pub bufferram: __kernel_ulong_t,
    pub totalswap: __kernel_ulong_t,
    pub freeswap: __kernel_ulong_t,
    pub procs: __u16,
    pub pad: __u16,
    pub totalhigh: __kernel_ulong_t,
    pub freehigh: __kernel_ulong_t,
    pub mem_unit: __u32,
    pub _f: __IncompleteArrayField<::std::os::raw::c_char>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sysinfo"][::std::mem::size_of::<sysinfo>() - 112usize];
    ["Alignment of sysinfo"][::std::mem::align_of::<sysinfo>() - 8usize];
    ["Offset of field: sysinfo::uptime"][::std::mem::offset_of!(sysinfo, uptime) - 0usize];
    ["Offset of field: sysinfo::loads"][::std::mem::offset_of!(sysinfo, loads) - 8usize];
    ["Offset of field: sysinfo::totalram"][::std::mem::offset_of!(sysinfo, totalram) - 32usize];
    ["Offset of field: sysinfo::freeram"][::std::mem::offset_of!(sysinfo, freeram) - 40usize];
    ["Offset of field: sysinfo::sharedram"][::std::mem::offset_of!(sysinfo, sharedram) - 48usize];
    ["Offset of field: sysinfo::bufferram"][::std::mem::offset_of!(sysinfo, bufferram) - 56usize];
    ["Offset of field: sysinfo::totalswap"][::std::mem::offset_of!(sysinfo, totalswap) - 64usize];
    ["Offset of field: sysinfo::freeswap"][::std::mem::offset_of!(sysinfo, freeswap) - 72usize];
    ["Offset of field: sysinfo::procs"][::std::mem::offset_of!(sysinfo, procs) - 80usize];
    ["Offset of field: sysinfo::pad"][::std::mem::offset_of!(sysinfo, pad) - 82usize];
    ["Offset of field: sysinfo::totalhigh"][::std::mem::offset_of!(sysinfo, totalhigh) - 88usize];
    ["Offset of field: sysinfo::freehigh"][::std::mem::offset_of!(sysinfo, freehigh) - 96usize];
    ["Offset of field: sysinfo::mem_unit"][::std::mem::offset_of!(sysinfo, mem_unit) - 104usize];
    ["Offset of field: sysinfo::_f"][::std::mem::offset_of!(sysinfo, _f) - 108usize];
};
#[repr(C)]
#[repr(align(64))]
#[derive(Debug)]
pub struct cacheline_padding {
    pub x: __IncompleteArrayField<::std::os::raw::c_char>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cacheline_padding"][::std::mem::size_of::<cacheline_padding>() - 0usize];
    ["Alignment of cacheline_padding"][::std::mem::align_of::<cacheline_padding>() - 64usize];
    ["Offset of field: cacheline_padding::x"]
        [::std::mem::offset_of!(cacheline_padding, x) - 0usize];
};
extern "C" {
    #[link_name = "\u{1}rsp"]
    pub static mut current_stack_pointer: ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn __bad_size_call_parameter();
}
extern "C" {
    pub static mut __per_cpu_offset: [::std::os::raw::c_ulong; 8192usize];
}
extern "C" {
    pub fn setup_per_cpu_areas();
}
extern "C" {
    pub static mut this_cpu_off: ::std::os::raw::c_ulong;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pcpu_hot {
    pub __bindgen_anon_1: pcpu_hot__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pcpu_hot__bindgen_ty_1 {
    pub __bindgen_anon_1: pcpu_hot__bindgen_ty_1__bindgen_ty_1,
    pub pad: [u8_; 64usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pcpu_hot__bindgen_ty_1__bindgen_ty_1 {
    pub current_task: *mut task_struct,
    pub preempt_count: ::std::os::raw::c_int,
    pub cpu_number: ::std::os::raw::c_int,
    pub call_depth: u64_,
    pub top_of_stack: ::std::os::raw::c_ulong,
    pub hardirq_stack_ptr: *mut ::std::os::raw::c_void,
    pub softirq_pending: u16_,
    pub hardirq_stack_inuse: bool_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pcpu_hot__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<pcpu_hot__bindgen_ty_1__bindgen_ty_1>() - 48usize];
    ["Alignment of pcpu_hot__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<pcpu_hot__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: pcpu_hot__bindgen_ty_1__bindgen_ty_1::current_task"]
        [::std::mem::offset_of!(pcpu_hot__bindgen_ty_1__bindgen_ty_1, current_task) - 0usize];
    ["Offset of field: pcpu_hot__bindgen_ty_1__bindgen_ty_1::preempt_count"]
        [::std::mem::offset_of!(pcpu_hot__bindgen_ty_1__bindgen_ty_1, preempt_count) - 8usize];
    ["Offset of field: pcpu_hot__bindgen_ty_1__bindgen_ty_1::cpu_number"]
        [::std::mem::offset_of!(pcpu_hot__bindgen_ty_1__bindgen_ty_1, cpu_number) - 12usize];
    ["Offset of field: pcpu_hot__bindgen_ty_1__bindgen_ty_1::call_depth"]
        [::std::mem::offset_of!(pcpu_hot__bindgen_ty_1__bindgen_ty_1, call_depth) - 16usize];
    ["Offset of field: pcpu_hot__bindgen_ty_1__bindgen_ty_1::top_of_stack"]
        [::std::mem::offset_of!(pcpu_hot__bindgen_ty_1__bindgen_ty_1, top_of_stack) - 24usize];
    ["Offset of field: pcpu_hot__bindgen_ty_1__bindgen_ty_1::hardirq_stack_ptr"]
        [::std::mem::offset_of!(pcpu_hot__bindgen_ty_1__bindgen_ty_1, hardirq_stack_ptr) - 32usize];
    ["Offset of field: pcpu_hot__bindgen_ty_1__bindgen_ty_1::softirq_pending"]
        [::std::mem::offset_of!(pcpu_hot__bindgen_ty_1__bindgen_ty_1, softirq_pending) - 40usize];
    ["Offset of field: pcpu_hot__bindgen_ty_1__bindgen_ty_1::hardirq_stack_inuse"][::std::mem::offset_of!(
        pcpu_hot__bindgen_ty_1__bindgen_ty_1,
        hardirq_stack_inuse
    ) - 42usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pcpu_hot__bindgen_ty_1"][::std::mem::size_of::<pcpu_hot__bindgen_ty_1>() - 64usize];
    ["Alignment of pcpu_hot__bindgen_ty_1"]
        [::std::mem::align_of::<pcpu_hot__bindgen_ty_1>() - 8usize];
    ["Offset of field: pcpu_hot__bindgen_ty_1::pad"]
        [::std::mem::offset_of!(pcpu_hot__bindgen_ty_1, pad) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pcpu_hot"][::std::mem::size_of::<pcpu_hot>() - 64usize];
    ["Alignment of pcpu_hot"][::std::mem::align_of::<pcpu_hot>() - 8usize];
};
extern "C" {
    pub static mut pcpu_hot: pcpu_hot;
}
extern "C" {
    pub static mut const_pcpu_hot: pcpu_hot;
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct alt_instr {
    pub instr_offset: s32,
    pub repl_offset: s32,
    pub __bindgen_anon_1: alt_instr__bindgen_ty_1,
    pub instrlen: u8_,
    pub replacementlen: u8_,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union alt_instr__bindgen_ty_1 {
    pub __bindgen_anon_1: alt_instr__bindgen_ty_1__bindgen_ty_1,
    pub ft_flags: u32_,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct alt_instr__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of alt_instr__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<alt_instr__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Alignment of alt_instr__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<alt_instr__bindgen_ty_1__bindgen_ty_1>() - 4usize];
};
impl alt_instr__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn cpuid(&self) -> u32_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_cpuid(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn flags(&self) -> u32_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_flags(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(cpuid: u32_, flags: u32_) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let cpuid: u32 = unsafe { ::std::mem::transmute(cpuid) };
            cpuid as u64
        });
        __bindgen_bitfield_unit.set(16usize, 16u8, {
            let flags: u32 = unsafe { ::std::mem::transmute(flags) };
            flags as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of alt_instr__bindgen_ty_1"][::std::mem::size_of::<alt_instr__bindgen_ty_1>() - 4usize];
    ["Alignment of alt_instr__bindgen_ty_1"]
        [::std::mem::align_of::<alt_instr__bindgen_ty_1>() - 4usize];
    ["Offset of field: alt_instr__bindgen_ty_1::ft_flags"]
        [::std::mem::offset_of!(alt_instr__bindgen_ty_1, ft_flags) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of alt_instr"][::std::mem::size_of::<alt_instr>() - 14usize];
    ["Alignment of alt_instr"][::std::mem::align_of::<alt_instr>() - 1usize];
    ["Offset of field: alt_instr::instr_offset"]
        [::std::mem::offset_of!(alt_instr, instr_offset) - 0usize];
    ["Offset of field: alt_instr::repl_offset"]
        [::std::mem::offset_of!(alt_instr, repl_offset) - 4usize];
    ["Offset of field: alt_instr::instrlen"][::std::mem::offset_of!(alt_instr, instrlen) - 12usize];
    ["Offset of field: alt_instr::replacementlen"]
        [::std::mem::offset_of!(alt_instr, replacementlen) - 13usize];
};
extern "C" {
    pub static mut __alt_instructions: [alt_instr; 0usize];
}
extern "C" {
    pub static mut __alt_instructions_end: [alt_instr; 0usize];
}
extern "C" {
    pub static mut alternatives_patched: ::std::os::raw::c_int;
}
extern "C" {
    pub fn alternative_instructions();
}
extern "C" {
    pub fn apply_alternatives(start: *mut alt_instr, end: *mut alt_instr);
}
extern "C" {
    pub fn apply_retpolines(start: *mut s32, end: *mut s32);
}
extern "C" {
    pub fn apply_returns(start: *mut s32, end: *mut s32);
}
extern "C" {
    pub fn apply_seal_endbr(start: *mut s32, end: *mut s32);
}
extern "C" {
    pub fn apply_fineibt(
        start_retpoline: *mut s32,
        end_retpoine: *mut s32,
        start_cfi: *mut s32,
        end_cfi: *mut s32,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct callthunk_sites {
    pub call_start: *mut s32,
    pub call_end: *mut s32,
    pub alt_start: *mut alt_instr,
    pub alt_end: *mut alt_instr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of callthunk_sites"][::std::mem::size_of::<callthunk_sites>() - 32usize];
    ["Alignment of callthunk_sites"][::std::mem::align_of::<callthunk_sites>() - 8usize];
    ["Offset of field: callthunk_sites::call_start"]
        [::std::mem::offset_of!(callthunk_sites, call_start) - 0usize];
    ["Offset of field: callthunk_sites::call_end"]
        [::std::mem::offset_of!(callthunk_sites, call_end) - 8usize];
    ["Offset of field: callthunk_sites::alt_start"]
        [::std::mem::offset_of!(callthunk_sites, alt_start) - 16usize];
    ["Offset of field: callthunk_sites::alt_end"]
        [::std::mem::offset_of!(callthunk_sites, alt_end) - 24usize];
};
extern "C" {
    pub fn callthunks_patch_builtin_calls();
}
extern "C" {
    pub fn callthunks_patch_module_calls(sites: *mut callthunk_sites, mod_: *mut module);
}
extern "C" {
    pub fn callthunks_translate_call_dest(
        dest: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn x86_call_depth_emit_accounting(
        pprog: *mut *mut u8_,
        func: *mut ::std::os::raw::c_void,
        ip: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn alternatives_smp_module_add(
        mod_: *mut module,
        name: *mut ::std::os::raw::c_char,
        locks: *mut ::std::os::raw::c_void,
        locks_end: *mut ::std::os::raw::c_void,
        text: *mut ::std::os::raw::c_void,
        text_end: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn alternatives_smp_module_del(mod_: *mut module);
}
extern "C" {
    pub fn alternatives_enable_smp();
}
extern "C" {
    pub fn alternatives_text_reserved(
        start: *mut ::std::os::raw::c_void,
        end: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub static mut skip_smp_alternatives: bool_;
}
extern "C" {
    pub fn BUG_func();
}
extern "C" {
    pub fn nop_func();
}
extern "C" {
    pub static x86_nops: [*const ::std::os::raw::c_uchar; 0usize];
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct qspinlock {
    pub __bindgen_anon_1: qspinlock__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union qspinlock__bindgen_ty_1 {
    pub val: atomic_t,
    pub __bindgen_anon_1: qspinlock__bindgen_ty_1__bindgen_ty_1,
    pub __bindgen_anon_2: qspinlock__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct qspinlock__bindgen_ty_1__bindgen_ty_1 {
    pub locked: u8_,
    pub pending: u8_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of qspinlock__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<qspinlock__bindgen_ty_1__bindgen_ty_1>() - 2usize];
    ["Alignment of qspinlock__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<qspinlock__bindgen_ty_1__bindgen_ty_1>() - 1usize];
    ["Offset of field: qspinlock__bindgen_ty_1__bindgen_ty_1::locked"]
        [::std::mem::offset_of!(qspinlock__bindgen_ty_1__bindgen_ty_1, locked) - 0usize];
    ["Offset of field: qspinlock__bindgen_ty_1__bindgen_ty_1::pending"]
        [::std::mem::offset_of!(qspinlock__bindgen_ty_1__bindgen_ty_1, pending) - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct qspinlock__bindgen_ty_1__bindgen_ty_2 {
    pub locked_pending: u16_,
    pub tail: u16_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of qspinlock__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<qspinlock__bindgen_ty_1__bindgen_ty_2>() - 4usize];
    ["Alignment of qspinlock__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<qspinlock__bindgen_ty_1__bindgen_ty_2>() - 2usize];
    ["Offset of field: qspinlock__bindgen_ty_1__bindgen_ty_2::locked_pending"]
        [::std::mem::offset_of!(qspinlock__bindgen_ty_1__bindgen_ty_2, locked_pending) - 0usize];
    ["Offset of field: qspinlock__bindgen_ty_1__bindgen_ty_2::tail"]
        [::std::mem::offset_of!(qspinlock__bindgen_ty_1__bindgen_ty_2, tail) - 2usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of qspinlock__bindgen_ty_1"][::std::mem::size_of::<qspinlock__bindgen_ty_1>() - 4usize];
    ["Alignment of qspinlock__bindgen_ty_1"]
        [::std::mem::align_of::<qspinlock__bindgen_ty_1>() - 4usize];
    ["Offset of field: qspinlock__bindgen_ty_1::val"]
        [::std::mem::offset_of!(qspinlock__bindgen_ty_1, val) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of qspinlock"][::std::mem::size_of::<qspinlock>() - 4usize];
    ["Alignment of qspinlock"][::std::mem::align_of::<qspinlock>() - 4usize];
};
pub type arch_spinlock_t = qspinlock;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct qrwlock {
    pub __bindgen_anon_1: qrwlock__bindgen_ty_1,
    pub wait_lock: arch_spinlock_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union qrwlock__bindgen_ty_1 {
    pub cnts: atomic_t,
    pub __bindgen_anon_1: qrwlock__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct qrwlock__bindgen_ty_1__bindgen_ty_1 {
    pub wlocked: u8_,
    pub __lstate: [u8_; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of qrwlock__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<qrwlock__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Alignment of qrwlock__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<qrwlock__bindgen_ty_1__bindgen_ty_1>() - 1usize];
    ["Offset of field: qrwlock__bindgen_ty_1__bindgen_ty_1::wlocked"]
        [::std::mem::offset_of!(qrwlock__bindgen_ty_1__bindgen_ty_1, wlocked) - 0usize];
    ["Offset of field: qrwlock__bindgen_ty_1__bindgen_ty_1::__lstate"]
        [::std::mem::offset_of!(qrwlock__bindgen_ty_1__bindgen_ty_1, __lstate) - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of qrwlock__bindgen_ty_1"][::std::mem::size_of::<qrwlock__bindgen_ty_1>() - 4usize];
    ["Alignment of qrwlock__bindgen_ty_1"]
        [::std::mem::align_of::<qrwlock__bindgen_ty_1>() - 4usize];
    ["Offset of field: qrwlock__bindgen_ty_1::cnts"]
        [::std::mem::offset_of!(qrwlock__bindgen_ty_1, cnts) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of qrwlock"][::std::mem::size_of::<qrwlock>() - 8usize];
    ["Alignment of qrwlock"][::std::mem::align_of::<qrwlock>() - 4usize];
    ["Offset of field: qrwlock::wait_lock"][::std::mem::offset_of!(qrwlock, wait_lock) - 4usize];
};
pub type arch_rwlock_t = qrwlock;
pub const lockdep_wait_type_LD_WAIT_INV: lockdep_wait_type = 0;
pub const lockdep_wait_type_LD_WAIT_FREE: lockdep_wait_type = 1;
pub const lockdep_wait_type_LD_WAIT_SPIN: lockdep_wait_type = 2;
pub const lockdep_wait_type_LD_WAIT_CONFIG: lockdep_wait_type = 2;
pub const lockdep_wait_type_LD_WAIT_SLEEP: lockdep_wait_type = 3;
pub const lockdep_wait_type_LD_WAIT_MAX: lockdep_wait_type = 4;
pub type lockdep_wait_type = ::std::os::raw::c_uint;
pub const lockdep_lock_type_LD_LOCK_NORMAL: lockdep_lock_type = 0;
pub const lockdep_lock_type_LD_LOCK_PERCPU: lockdep_lock_type = 1;
pub const lockdep_lock_type_LD_LOCK_WAIT_OVERRIDE: lockdep_lock_type = 2;
pub const lockdep_lock_type_LD_LOCK_MAX: lockdep_lock_type = 3;
pub type lockdep_lock_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lock_class_key {}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lock_class_key"][::std::mem::size_of::<lock_class_key>() - 0usize];
    ["Alignment of lock_class_key"][::std::mem::align_of::<lock_class_key>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lockdep_map {}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lockdep_map"][::std::mem::size_of::<lockdep_map>() - 0usize];
    ["Alignment of lockdep_map"][::std::mem::align_of::<lockdep_map>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pin_cookie {}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pin_cookie"][::std::mem::size_of::<pin_cookie>() - 0usize];
    ["Alignment of pin_cookie"][::std::mem::align_of::<pin_cookie>() - 1usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct raw_spinlock {
    pub raw_lock: arch_spinlock_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of raw_spinlock"][::std::mem::size_of::<raw_spinlock>() - 4usize];
    ["Alignment of raw_spinlock"][::std::mem::align_of::<raw_spinlock>() - 4usize];
    ["Offset of field: raw_spinlock::raw_lock"]
        [::std::mem::offset_of!(raw_spinlock, raw_lock) - 0usize];
};
pub type raw_spinlock_t = raw_spinlock;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct spinlock {
    pub __bindgen_anon_1: spinlock__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spinlock__bindgen_ty_1 {
    pub rlock: raw_spinlock,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of spinlock__bindgen_ty_1"][::std::mem::size_of::<spinlock__bindgen_ty_1>() - 4usize];
    ["Alignment of spinlock__bindgen_ty_1"]
        [::std::mem::align_of::<spinlock__bindgen_ty_1>() - 4usize];
    ["Offset of field: spinlock__bindgen_ty_1::rlock"]
        [::std::mem::offset_of!(spinlock__bindgen_ty_1, rlock) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of spinlock"][::std::mem::size_of::<spinlock>() - 4usize];
    ["Alignment of spinlock"][::std::mem::align_of::<spinlock>() - 4usize];
};
pub type spinlock_t = spinlock;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct rwlock_t {
    pub raw_lock: arch_rwlock_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rwlock_t"][::std::mem::size_of::<rwlock_t>() - 8usize];
    ["Alignment of rwlock_t"][::std::mem::align_of::<rwlock_t>() - 4usize];
    ["Offset of field: rwlock_t::raw_lock"][::std::mem::offset_of!(rwlock_t, raw_lock) - 0usize];
};
pub type va_list = __builtin_va_list;
extern "C" {
    pub fn __sw_hweight8(w: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn __sw_hweight16(w: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn __sw_hweight32(w: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn __sw_hweight64(w: __u64) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub static hex_asc: [::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub static hex_asc_upper: [::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub fn hex_to_bin(ch: ::std::os::raw::c_uchar) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn hex2bin(
        dst: *mut u8_,
        src: *const ::std::os::raw::c_char,
        count: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bin2hex(
        dst: *mut ::std::os::raw::c_char,
        src: *const ::std::os::raw::c_void,
        count: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mac_pton(s: *const ::std::os::raw::c_char, mac: *mut u8_) -> bool_;
}
extern "C" {
    pub fn _kstrtoul(
        s: *const ::std::os::raw::c_char,
        base: ::std::os::raw::c_uint,
        res: *mut ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _kstrtol(
        s: *const ::std::os::raw::c_char,
        base: ::std::os::raw::c_uint,
        res: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kstrtoull(
        s: *const ::std::os::raw::c_char,
        base: ::std::os::raw::c_uint,
        res: *mut ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kstrtoll(
        s: *const ::std::os::raw::c_char,
        base: ::std::os::raw::c_uint,
        res: *mut ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kstrtouint(
        s: *const ::std::os::raw::c_char,
        base: ::std::os::raw::c_uint,
        res: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kstrtoint(
        s: *const ::std::os::raw::c_char,
        base: ::std::os::raw::c_uint,
        res: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kstrtou16(
        s: *const ::std::os::raw::c_char,
        base: ::std::os::raw::c_uint,
        res: *mut u16_,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kstrtos16(
        s: *const ::std::os::raw::c_char,
        base: ::std::os::raw::c_uint,
        res: *mut s16,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kstrtou8(
        s: *const ::std::os::raw::c_char,
        base: ::std::os::raw::c_uint,
        res: *mut u8_,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kstrtos8(
        s: *const ::std::os::raw::c_char,
        base: ::std::os::raw::c_uint,
        res: *mut s8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kstrtobool(s: *const ::std::os::raw::c_char, res: *mut bool_) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kstrtoull_from_user(
        s: *const ::std::os::raw::c_char,
        count: usize,
        base: ::std::os::raw::c_uint,
        res: *mut ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kstrtoll_from_user(
        s: *const ::std::os::raw::c_char,
        count: usize,
        base: ::std::os::raw::c_uint,
        res: *mut ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kstrtoul_from_user(
        s: *const ::std::os::raw::c_char,
        count: usize,
        base: ::std::os::raw::c_uint,
        res: *mut ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kstrtol_from_user(
        s: *const ::std::os::raw::c_char,
        count: usize,
        base: ::std::os::raw::c_uint,
        res: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kstrtouint_from_user(
        s: *const ::std::os::raw::c_char,
        count: usize,
        base: ::std::os::raw::c_uint,
        res: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kstrtoint_from_user(
        s: *const ::std::os::raw::c_char,
        count: usize,
        base: ::std::os::raw::c_uint,
        res: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kstrtou16_from_user(
        s: *const ::std::os::raw::c_char,
        count: usize,
        base: ::std::os::raw::c_uint,
        res: *mut u16_,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kstrtos16_from_user(
        s: *const ::std::os::raw::c_char,
        count: usize,
        base: ::std::os::raw::c_uint,
        res: *mut s16,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kstrtou8_from_user(
        s: *const ::std::os::raw::c_char,
        count: usize,
        base: ::std::os::raw::c_uint,
        res: *mut u8_,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kstrtos8_from_user(
        s: *const ::std::os::raw::c_char,
        count: usize,
        base: ::std::os::raw::c_uint,
        res: *mut s8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kstrtobool_from_user(
        s: *const ::std::os::raw::c_char,
        count: usize,
        res: *mut bool_,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn simple_strtoul(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn simple_strtol(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn simple_strtoull(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn simple_strtoll(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_longlong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct s8_fract {
    pub numerator: __s8,
    pub denominator: __s8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of s8_fract"][::std::mem::size_of::<s8_fract>() - 2usize];
    ["Alignment of s8_fract"][::std::mem::align_of::<s8_fract>() - 1usize];
    ["Offset of field: s8_fract::numerator"][::std::mem::offset_of!(s8_fract, numerator) - 0usize];
    ["Offset of field: s8_fract::denominator"]
        [::std::mem::offset_of!(s8_fract, denominator) - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct u8_fract {
    pub numerator: __u8,
    pub denominator: __u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of u8_fract"][::std::mem::size_of::<u8_fract>() - 2usize];
    ["Alignment of u8_fract"][::std::mem::align_of::<u8_fract>() - 1usize];
    ["Offset of field: u8_fract::numerator"][::std::mem::offset_of!(u8_fract, numerator) - 0usize];
    ["Offset of field: u8_fract::denominator"]
        [::std::mem::offset_of!(u8_fract, denominator) - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct s16_fract {
    pub numerator: __s16,
    pub denominator: __s16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of s16_fract"][::std::mem::size_of::<s16_fract>() - 4usize];
    ["Alignment of s16_fract"][::std::mem::align_of::<s16_fract>() - 2usize];
    ["Offset of field: s16_fract::numerator"]
        [::std::mem::offset_of!(s16_fract, numerator) - 0usize];
    ["Offset of field: s16_fract::denominator"]
        [::std::mem::offset_of!(s16_fract, denominator) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct u16_fract {
    pub numerator: __u16,
    pub denominator: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of u16_fract"][::std::mem::size_of::<u16_fract>() - 4usize];
    ["Alignment of u16_fract"][::std::mem::align_of::<u16_fract>() - 2usize];
    ["Offset of field: u16_fract::numerator"]
        [::std::mem::offset_of!(u16_fract, numerator) - 0usize];
    ["Offset of field: u16_fract::denominator"]
        [::std::mem::offset_of!(u16_fract, denominator) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct s32_fract {
    pub numerator: __s32,
    pub denominator: __s32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of s32_fract"][::std::mem::size_of::<s32_fract>() - 8usize];
    ["Alignment of s32_fract"][::std::mem::align_of::<s32_fract>() - 4usize];
    ["Offset of field: s32_fract::numerator"]
        [::std::mem::offset_of!(s32_fract, numerator) - 0usize];
    ["Offset of field: s32_fract::denominator"]
        [::std::mem::offset_of!(s32_fract, denominator) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct u32_fract {
    pub numerator: __u32,
    pub denominator: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of u32_fract"][::std::mem::size_of::<u32_fract>() - 8usize];
    ["Alignment of u32_fract"][::std::mem::align_of::<u32_fract>() - 4usize];
    ["Offset of field: u32_fract::numerator"]
        [::std::mem::offset_of!(u32_fract, numerator) - 0usize];
    ["Offset of field: u32_fract::denominator"]
        [::std::mem::offset_of!(u32_fract, denominator) - 4usize];
};
extern "C" {
    pub fn int_pow(base: u64_, exp: ::std::os::raw::c_uint) -> u64_;
}
extern "C" {
    pub fn int_sqrt(arg1: ::std::os::raw::c_ulong) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub static mut panic_blink: ::std::option::Option<
        unsafe extern "C" fn(state: ::std::os::raw::c_int) -> ::std::os::raw::c_long,
    >;
}
extern "C" {
    pub fn panic(fmt: *const ::std::os::raw::c_char, ...) -> !;
}
extern "C" {
    pub fn nmi_panic(regs: *mut pt_regs, msg: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn check_panic_on_warn(origin: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn oops_enter();
}
extern "C" {
    pub fn oops_exit();
}
extern "C" {
    pub fn oops_may_print() -> bool_;
}
extern "C" {
    pub static mut panic_triggering_all_cpu_backtrace: bool_;
}
extern "C" {
    pub static mut panic_timeout: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut panic_print: ::std::os::raw::c_ulong;
}
extern "C" {
    pub static mut panic_on_oops: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut panic_on_unrecovered_nmi: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut panic_on_io_nmi: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut panic_on_warn: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut panic_on_taint: ::std::os::raw::c_ulong;
}
extern "C" {
    pub static mut panic_on_taint_nousertaint: bool_;
}
extern "C" {
    pub static mut sysctl_panic_on_rcu_stall: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut sysctl_max_rcu_stall_to_panic: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut sysctl_panic_on_stackoverflow: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut crash_kexec_post_notifiers: bool_;
}
extern "C" {
    pub fn __stack_chk_fail();
}
extern "C" {
    pub fn abort() -> !;
}
extern "C" {
    pub static mut panic_cpu: atomic_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct taint_flag {
    pub c_true: ::std::os::raw::c_char,
    pub c_false: ::std::os::raw::c_char,
    pub module: bool_,
    pub desc: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of taint_flag"][::std::mem::size_of::<taint_flag>() - 16usize];
    ["Alignment of taint_flag"][::std::mem::align_of::<taint_flag>() - 8usize];
    ["Offset of field: taint_flag::c_true"][::std::mem::offset_of!(taint_flag, c_true) - 0usize];
    ["Offset of field: taint_flag::c_false"][::std::mem::offset_of!(taint_flag, c_false) - 1usize];
    ["Offset of field: taint_flag::module"][::std::mem::offset_of!(taint_flag, module) - 2usize];
    ["Offset of field: taint_flag::desc"][::std::mem::offset_of!(taint_flag, desc) - 8usize];
};
extern "C" {
    pub static taint_flags: [taint_flag; 19usize];
}
pub const lockdep_ok_LOCKDEP_STILL_OK: lockdep_ok = 0;
pub const lockdep_ok_LOCKDEP_NOW_UNRELIABLE: lockdep_ok = 1;
pub type lockdep_ok = ::std::os::raw::c_uint;
extern "C" {
    pub fn print_tainted() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn print_tainted_verbose() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn add_taint(flag: ::std::os::raw::c_uint, arg1: lockdep_ok);
}
extern "C" {
    pub fn test_taint(flag: ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn get_taint() -> ::std::os::raw::c_ulong;
}
pub type initcall_t = ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>;
pub type exitcall_t = ::std::option::Option<unsafe extern "C" fn()>;
pub type initcall_entry_t = ::std::os::raw::c_int;
extern "C" {
    pub static mut __con_initcall_start: [initcall_entry_t; 0usize];
}
extern "C" {
    pub static mut __con_initcall_end: [initcall_entry_t; 0usize];
}
pub type ctor_fn_t = ::std::option::Option<unsafe extern "C" fn()>;
extern "C" {
    pub fn do_one_initcall(fn_: initcall_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub static mut boot_command_line: [::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub static mut saved_command_line: *mut ::std::os::raw::c_char;
}
extern "C" {
    pub static mut saved_command_line_len: ::std::os::raw::c_uint;
}
extern "C" {
    pub static mut reset_devices: ::std::os::raw::c_uint;
}
extern "C" {
    pub fn setup_arch(arg1: *mut *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn prepare_namespace();
}
extern "C" {
    pub fn init_rootfs();
}
extern "C" {
    pub fn init_IRQ();
}
extern "C" {
    pub fn time_init();
}
extern "C" {
    pub fn poking_init();
}
extern "C" {
    pub fn pgtable_cache_init();
}
extern "C" {
    pub static mut __initcall_start: [initcall_entry_t; 0usize];
}
extern "C" {
    pub static mut __initcall0_start: [initcall_entry_t; 0usize];
}
extern "C" {
    pub static mut __initcall1_start: [initcall_entry_t; 0usize];
}
extern "C" {
    pub static mut __initcall2_start: [initcall_entry_t; 0usize];
}
extern "C" {
    pub static mut __initcall3_start: [initcall_entry_t; 0usize];
}
extern "C" {
    pub static mut __initcall4_start: [initcall_entry_t; 0usize];
}
extern "C" {
    pub static mut __initcall5_start: [initcall_entry_t; 0usize];
}
extern "C" {
    pub static mut __initcall6_start: [initcall_entry_t; 0usize];
}
extern "C" {
    pub static mut __initcall7_start: [initcall_entry_t; 0usize];
}
extern "C" {
    pub static mut __initcall_end: [initcall_entry_t; 0usize];
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct file_system_type {
    pub name: *const ::std::os::raw::c_char,
    pub fs_flags: ::std::os::raw::c_int,
    pub init_fs_context:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut fs_context) -> ::std::os::raw::c_int>,
    pub parameters: *const fs_parameter_spec,
    pub mount: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut file_system_type,
            arg2: ::std::os::raw::c_int,
            arg3: *const ::std::os::raw::c_char,
            arg4: *mut ::std::os::raw::c_void,
        ) -> *mut dentry,
    >,
    pub kill_sb: ::std::option::Option<unsafe extern "C" fn(arg1: *mut super_block)>,
    pub owner: *mut module,
    pub next: *mut file_system_type,
    pub fs_supers: hlist_head,
    pub s_lock_key: lock_class_key,
    pub s_umount_key: lock_class_key,
    pub s_vfs_rename_key: lock_class_key,
    pub s_writers_key: [lock_class_key; 3usize],
    pub i_lock_key: lock_class_key,
    pub i_mutex_key: lock_class_key,
    pub invalidate_lock_key: lock_class_key,
    pub i_mutex_dir_key: lock_class_key,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of file_system_type"][::std::mem::size_of::<file_system_type>() - 72usize];
    ["Alignment of file_system_type"][::std::mem::align_of::<file_system_type>() - 8usize];
    ["Offset of field: file_system_type::name"]
        [::std::mem::offset_of!(file_system_type, name) - 0usize];
    ["Offset of field: file_system_type::fs_flags"]
        [::std::mem::offset_of!(file_system_type, fs_flags) - 8usize];
    ["Offset of field: file_system_type::init_fs_context"]
        [::std::mem::offset_of!(file_system_type, init_fs_context) - 16usize];
    ["Offset of field: file_system_type::parameters"]
        [::std::mem::offset_of!(file_system_type, parameters) - 24usize];
    ["Offset of field: file_system_type::mount"]
        [::std::mem::offset_of!(file_system_type, mount) - 32usize];
    ["Offset of field: file_system_type::kill_sb"]
        [::std::mem::offset_of!(file_system_type, kill_sb) - 40usize];
    ["Offset of field: file_system_type::owner"]
        [::std::mem::offset_of!(file_system_type, owner) - 48usize];
    ["Offset of field: file_system_type::next"]
        [::std::mem::offset_of!(file_system_type, next) - 56usize];
    ["Offset of field: file_system_type::fs_supers"]
        [::std::mem::offset_of!(file_system_type, fs_supers) - 64usize];
    ["Offset of field: file_system_type::s_lock_key"]
        [::std::mem::offset_of!(file_system_type, s_lock_key) - 72usize];
    ["Offset of field: file_system_type::s_umount_key"]
        [::std::mem::offset_of!(file_system_type, s_umount_key) - 72usize];
    ["Offset of field: file_system_type::s_vfs_rename_key"]
        [::std::mem::offset_of!(file_system_type, s_vfs_rename_key) - 72usize];
    ["Offset of field: file_system_type::s_writers_key"]
        [::std::mem::offset_of!(file_system_type, s_writers_key) - 72usize];
    ["Offset of field: file_system_type::i_lock_key"]
        [::std::mem::offset_of!(file_system_type, i_lock_key) - 72usize];
    ["Offset of field: file_system_type::i_mutex_key"]
        [::std::mem::offset_of!(file_system_type, i_mutex_key) - 72usize];
    ["Offset of field: file_system_type::invalidate_lock_key"]
        [::std::mem::offset_of!(file_system_type, invalidate_lock_key) - 72usize];
    ["Offset of field: file_system_type::i_mutex_dir_key"]
        [::std::mem::offset_of!(file_system_type, i_mutex_dir_key) - 72usize];
};
extern "C" {
    pub static mut rootfs_fs_type: file_system_type;
}
extern "C" {
    pub static mut rodata_enabled: bool_;
}
extern "C" {
    pub fn mark_rodata_ro();
}
extern "C" {
    pub static mut late_time_init: ::std::option::Option<unsafe extern "C" fn()>;
}
extern "C" {
    pub static mut initcall_debug: bool_;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct obs_kernel_param {
    pub str_: *const ::std::os::raw::c_char,
    pub setup_func: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int,
    >,
    pub early: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of obs_kernel_param"][::std::mem::size_of::<obs_kernel_param>() - 24usize];
    ["Alignment of obs_kernel_param"][::std::mem::align_of::<obs_kernel_param>() - 8usize];
    ["Offset of field: obs_kernel_param::str_"]
        [::std::mem::offset_of!(obs_kernel_param, str_) - 0usize];
    ["Offset of field: obs_kernel_param::setup_func"]
        [::std::mem::offset_of!(obs_kernel_param, setup_func) - 8usize];
    ["Offset of field: obs_kernel_param::early"]
        [::std::mem::offset_of!(obs_kernel_param, early) - 16usize];
};
extern "C" {
    pub static __setup_start: [obs_kernel_param; 0usize];
}
extern "C" {
    pub static __setup_end: [obs_kernel_param; 0usize];
}
extern "C" {
    pub fn parse_early_param();
}
extern "C" {
    pub fn parse_early_options(cmdline: *mut ::std::os::raw::c_char);
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ratelimit_state {
    pub lock: raw_spinlock_t,
    pub interval: ::std::os::raw::c_int,
    pub burst: ::std::os::raw::c_int,
    pub printed: ::std::os::raw::c_int,
    pub missed: ::std::os::raw::c_int,
    pub begin: ::std::os::raw::c_ulong,
    pub flags: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ratelimit_state"][::std::mem::size_of::<ratelimit_state>() - 40usize];
    ["Alignment of ratelimit_state"][::std::mem::align_of::<ratelimit_state>() - 8usize];
    ["Offset of field: ratelimit_state::lock"]
        [::std::mem::offset_of!(ratelimit_state, lock) - 0usize];
    ["Offset of field: ratelimit_state::interval"]
        [::std::mem::offset_of!(ratelimit_state, interval) - 4usize];
    ["Offset of field: ratelimit_state::burst"]
        [::std::mem::offset_of!(ratelimit_state, burst) - 8usize];
    ["Offset of field: ratelimit_state::printed"]
        [::std::mem::offset_of!(ratelimit_state, printed) - 12usize];
    ["Offset of field: ratelimit_state::missed"]
        [::std::mem::offset_of!(ratelimit_state, missed) - 16usize];
    ["Offset of field: ratelimit_state::begin"]
        [::std::mem::offset_of!(ratelimit_state, begin) - 24usize];
    ["Offset of field: ratelimit_state::flags"]
        [::std::mem::offset_of!(ratelimit_state, flags) - 32usize];
};
extern "C" {
    pub fn ___ratelimit(
        rs: *mut ratelimit_state,
        func: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub static linux_banner: [::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub static linux_proc_banner: [::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub static mut oops_in_progress: ::std::os::raw::c_int;
}
extern "C" {
    pub fn match_devname_and_update_preferred_console(
        match_: *const ::std::os::raw::c_char,
        name: *const ::std::os::raw::c_char,
        idx: ::std::os::raw::c_short,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub static mut console_printk: [::std::os::raw::c_int; 0usize];
}
extern "C" {
    pub fn console_verbose();
}
extern "C" {
    pub static mut devkmsg_log_str: [::std::os::raw::c_char; 10usize];
}
extern "C" {
    pub static mut suppress_printk: ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct va_format {
    pub fmt: *const ::std::os::raw::c_char,
    pub va: *mut va_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of va_format"][::std::mem::size_of::<va_format>() - 16usize];
    ["Alignment of va_format"][::std::mem::align_of::<va_format>() - 8usize];
    ["Offset of field: va_format::fmt"][::std::mem::offset_of!(va_format, fmt) - 0usize];
    ["Offset of field: va_format::va"][::std::mem::offset_of!(va_format, va) - 8usize];
};
extern "C" {
    pub fn early_printk(fmt: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    pub fn vprintk_emit(
        facility: ::std::os::raw::c_int,
        level: ::std::os::raw::c_int,
        dev_info: *const dev_printk_info,
        fmt: *const ::std::os::raw::c_char,
        args: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintk(
        fmt: *const ::std::os::raw::c_char,
        args: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _printk(fmt: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _printk_deferred(fmt: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __printk_safe_enter();
}
extern "C" {
    pub fn __printk_safe_exit();
}
extern "C" {
    pub fn __printk_ratelimit(func: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printk_timed_ratelimit(
        caller_jiffies: *mut ::std::os::raw::c_ulong,
        interval_msec: ::std::os::raw::c_uint,
    ) -> bool_;
}
extern "C" {
    pub static mut printk_delay_msec: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut dmesg_restrict: ::std::os::raw::c_int;
}
extern "C" {
    pub fn wake_up_klogd();
}
extern "C" {
    pub fn log_buf_addr_get() -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn log_buf_len_get() -> u32_;
}
extern "C" {
    pub fn log_buf_vmcoreinfo_setup();
}
extern "C" {
    pub fn setup_log_buf(early: ::std::os::raw::c_int);
}
extern "C" {
    pub fn dump_stack_set_arch_desc(fmt: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    pub fn dump_stack_print_info(log_lvl: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn show_regs_print_info(log_lvl: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn dump_stack_lvl(log_lvl: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn dump_stack();
}
extern "C" {
    pub fn printk_trigger_flush();
}
extern "C" {
    pub fn console_try_replay_all();
}
extern "C" {
    pub fn this_cpu_in_panic() -> bool_;
}
extern "C" {
    pub fn __printk_cpu_sync_try_get() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __printk_cpu_sync_wait();
}
extern "C" {
    pub fn __printk_cpu_sync_put();
}
extern "C" {
    pub static mut kptr_restrict: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut static_key_initialized: bool_;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct static_key {
    pub enabled: atomic_t,
    pub __bindgen_anon_1: static_key__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union static_key__bindgen_ty_1 {
    pub type_: ::std::os::raw::c_ulong,
    pub entries: *mut jump_entry,
    pub next: *mut static_key_mod,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of static_key__bindgen_ty_1"]
        [::std::mem::size_of::<static_key__bindgen_ty_1>() - 8usize];
    ["Alignment of static_key__bindgen_ty_1"]
        [::std::mem::align_of::<static_key__bindgen_ty_1>() - 8usize];
    ["Offset of field: static_key__bindgen_ty_1::type_"]
        [::std::mem::offset_of!(static_key__bindgen_ty_1, type_) - 0usize];
    ["Offset of field: static_key__bindgen_ty_1::entries"]
        [::std::mem::offset_of!(static_key__bindgen_ty_1, entries) - 0usize];
    ["Offset of field: static_key__bindgen_ty_1::next"]
        [::std::mem::offset_of!(static_key__bindgen_ty_1, next) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of static_key"][::std::mem::size_of::<static_key>() - 16usize];
    ["Alignment of static_key"][::std::mem::align_of::<static_key>() - 8usize];
    ["Offset of field: static_key::enabled"][::std::mem::offset_of!(static_key, enabled) - 0usize];
};
extern "C" {
    pub fn arch_jump_entry_size(entry: *mut jump_entry) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct jump_entry {
    pub code: s32,
    pub target: s32,
    pub key: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of jump_entry"][::std::mem::size_of::<jump_entry>() - 16usize];
    ["Alignment of jump_entry"][::std::mem::align_of::<jump_entry>() - 8usize];
    ["Offset of field: jump_entry::code"][::std::mem::offset_of!(jump_entry, code) - 0usize];
    ["Offset of field: jump_entry::target"][::std::mem::offset_of!(jump_entry, target) - 4usize];
    ["Offset of field: jump_entry::key"][::std::mem::offset_of!(jump_entry, key) - 8usize];
};
pub const jump_label_type_JUMP_LABEL_NOP: jump_label_type = 0;
pub const jump_label_type_JUMP_LABEL_JMP: jump_label_type = 1;
pub type jump_label_type = ::std::os::raw::c_uint;
extern "C" {
    pub static mut __start___jump_table: [jump_entry; 0usize];
}
extern "C" {
    pub static mut __stop___jump_table: [jump_entry; 0usize];
}
extern "C" {
    pub fn jump_label_init();
}
extern "C" {
    pub fn jump_label_init_ro();
}
extern "C" {
    pub fn jump_label_lock();
}
extern "C" {
    pub fn jump_label_unlock();
}
extern "C" {
    pub fn arch_jump_label_transform(entry: *mut jump_entry, type_: jump_label_type);
}
extern "C" {
    pub fn arch_jump_label_transform_queue(entry: *mut jump_entry, type_: jump_label_type)
        -> bool_;
}
extern "C" {
    pub fn arch_jump_label_transform_apply();
}
extern "C" {
    pub fn jump_label_text_reserved(
        start: *mut ::std::os::raw::c_void,
        end: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn static_key_slow_inc(key: *mut static_key) -> bool_;
}
extern "C" {
    pub fn static_key_fast_inc_not_disabled(key: *mut static_key) -> bool_;
}
extern "C" {
    pub fn static_key_slow_dec(key: *mut static_key);
}
extern "C" {
    pub fn static_key_slow_inc_cpuslocked(key: *mut static_key) -> bool_;
}
extern "C" {
    pub fn static_key_slow_dec_cpuslocked(key: *mut static_key);
}
extern "C" {
    pub fn static_key_count(key: *mut static_key) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn static_key_enable(key: *mut static_key);
}
extern "C" {
    pub fn static_key_disable(key: *mut static_key);
}
extern "C" {
    pub fn static_key_enable_cpuslocked(key: *mut static_key);
}
extern "C" {
    pub fn static_key_disable_cpuslocked(key: *mut static_key);
}
extern "C" {
    pub fn jump_label_init_type(entry: *mut jump_entry) -> jump_label_type;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct static_key_true {
    pub key: static_key,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of static_key_true"][::std::mem::size_of::<static_key_true>() - 16usize];
    ["Alignment of static_key_true"][::std::mem::align_of::<static_key_true>() - 8usize];
    ["Offset of field: static_key_true::key"]
        [::std::mem::offset_of!(static_key_true, key) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct static_key_false {
    pub key: static_key,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of static_key_false"][::std::mem::size_of::<static_key_false>() - 16usize];
    ["Alignment of static_key_false"][::std::mem::align_of::<static_key_false>() - 8usize];
    ["Offset of field: static_key_false::key"]
        [::std::mem::offset_of!(static_key_false, key) - 0usize];
};
extern "C" {
    pub fn ____wrong_branch_error() -> bool_;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _ddebug {
    pub modname: *const ::std::os::raw::c_char,
    pub function: *const ::std::os::raw::c_char,
    pub filename: *const ::std::os::raw::c_char,
    pub format: *const ::std::os::raw::c_char,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub key: _ddebug__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _ddebug__bindgen_ty_1 {
    pub dd_key_true: static_key_true,
    pub dd_key_false: static_key_false,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ddebug__bindgen_ty_1"][::std::mem::size_of::<_ddebug__bindgen_ty_1>() - 16usize];
    ["Alignment of _ddebug__bindgen_ty_1"]
        [::std::mem::align_of::<_ddebug__bindgen_ty_1>() - 8usize];
    ["Offset of field: _ddebug__bindgen_ty_1::dd_key_true"]
        [::std::mem::offset_of!(_ddebug__bindgen_ty_1, dd_key_true) - 0usize];
    ["Offset of field: _ddebug__bindgen_ty_1::dd_key_false"]
        [::std::mem::offset_of!(_ddebug__bindgen_ty_1, dd_key_false) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ddebug"][::std::mem::size_of::<_ddebug>() - 56usize];
    ["Alignment of _ddebug"][::std::mem::align_of::<_ddebug>() - 8usize];
    ["Offset of field: _ddebug::modname"][::std::mem::offset_of!(_ddebug, modname) - 0usize];
    ["Offset of field: _ddebug::function"][::std::mem::offset_of!(_ddebug, function) - 8usize];
    ["Offset of field: _ddebug::filename"][::std::mem::offset_of!(_ddebug, filename) - 16usize];
    ["Offset of field: _ddebug::format"][::std::mem::offset_of!(_ddebug, format) - 24usize];
    ["Offset of field: _ddebug::key"][::std::mem::offset_of!(_ddebug, key) - 40usize];
};
impl _ddebug {
    #[inline]
    pub fn lineno(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 18u8) as u32) }
    }
    #[inline]
    pub fn set_lineno(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 18u8, val as u64)
        }
    }
    #[inline]
    pub fn class_id(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(18usize, 6u8) as u32) }
    }
    #[inline]
    pub fn set_class_id(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(18usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub fn flags(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_flags(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        lineno: ::std::os::raw::c_uint,
        class_id: ::std::os::raw::c_uint,
        flags: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 18u8, {
            let lineno: u32 = unsafe { ::std::mem::transmute(lineno) };
            lineno as u64
        });
        __bindgen_bitfield_unit.set(18usize, 6u8, {
            let class_id: u32 = unsafe { ::std::mem::transmute(class_id) };
            class_id as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let flags: u32 = unsafe { ::std::mem::transmute(flags) };
            flags as u64
        });
        __bindgen_bitfield_unit
    }
}
pub const class_map_type_DD_CLASS_TYPE_DISJOINT_BITS: class_map_type = 0;
#[doc = " DD_CLASS_TYPE_DISJOINT_BITS: classes are independent, one per bit.\n expecting hex input. Built for drm.debug, basis for other types."]
pub const class_map_type_DD_CLASS_TYPE_LEVEL_NUM: class_map_type = 1;
#[doc = " DD_CLASS_TYPE_LEVEL_NUM: input is numeric level, 0-N.\n N turns on just bits N-1 .. 0, so N=0 turns all bits off."]
pub const class_map_type_DD_CLASS_TYPE_DISJOINT_NAMES: class_map_type = 2;
#[doc = " DD_CLASS_TYPE_DISJOINT_NAMES: input is a CSV of [+-]CLASS_NAMES,\n classes are independent, like _DISJOINT_BITS."]
pub const class_map_type_DD_CLASS_TYPE_LEVEL_NAMES: class_map_type = 3;
pub type class_map_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ddebug_class_map {
    pub link: list_head,
    pub mod_: *mut module,
    pub mod_name: *const ::std::os::raw::c_char,
    pub class_names: *mut *const ::std::os::raw::c_char,
    pub length: ::std::os::raw::c_int,
    pub base: ::std::os::raw::c_int,
    pub map_type: class_map_type,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ddebug_class_map"][::std::mem::size_of::<ddebug_class_map>() - 56usize];
    ["Alignment of ddebug_class_map"][::std::mem::align_of::<ddebug_class_map>() - 8usize];
    ["Offset of field: ddebug_class_map::link"]
        [::std::mem::offset_of!(ddebug_class_map, link) - 0usize];
    ["Offset of field: ddebug_class_map::mod_"]
        [::std::mem::offset_of!(ddebug_class_map, mod_) - 16usize];
    ["Offset of field: ddebug_class_map::mod_name"]
        [::std::mem::offset_of!(ddebug_class_map, mod_name) - 24usize];
    ["Offset of field: ddebug_class_map::class_names"]
        [::std::mem::offset_of!(ddebug_class_map, class_names) - 32usize];
    ["Offset of field: ddebug_class_map::length"]
        [::std::mem::offset_of!(ddebug_class_map, length) - 40usize];
    ["Offset of field: ddebug_class_map::base"]
        [::std::mem::offset_of!(ddebug_class_map, base) - 44usize];
    ["Offset of field: ddebug_class_map::map_type"]
        [::std::mem::offset_of!(ddebug_class_map, map_type) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ddebug_info {
    pub descs: *mut _ddebug,
    pub classes: *mut ddebug_class_map,
    pub num_descs: ::std::os::raw::c_uint,
    pub num_classes: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ddebug_info"][::std::mem::size_of::<_ddebug_info>() - 24usize];
    ["Alignment of _ddebug_info"][::std::mem::align_of::<_ddebug_info>() - 8usize];
    ["Offset of field: _ddebug_info::descs"][::std::mem::offset_of!(_ddebug_info, descs) - 0usize];
    ["Offset of field: _ddebug_info::classes"]
        [::std::mem::offset_of!(_ddebug_info, classes) - 8usize];
    ["Offset of field: _ddebug_info::num_descs"]
        [::std::mem::offset_of!(_ddebug_info, num_descs) - 16usize];
    ["Offset of field: _ddebug_info::num_classes"]
        [::std::mem::offset_of!(_ddebug_info, num_classes) - 20usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ddebug_class_param {
    pub __bindgen_anon_1: ddebug_class_param__bindgen_ty_1,
    pub flags: [::std::os::raw::c_char; 8usize],
    pub map: *const ddebug_class_map,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ddebug_class_param__bindgen_ty_1 {
    pub bits: *mut ::std::os::raw::c_ulong,
    pub lvl: *mut ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ddebug_class_param__bindgen_ty_1"]
        [::std::mem::size_of::<ddebug_class_param__bindgen_ty_1>() - 8usize];
    ["Alignment of ddebug_class_param__bindgen_ty_1"]
        [::std::mem::align_of::<ddebug_class_param__bindgen_ty_1>() - 8usize];
    ["Offset of field: ddebug_class_param__bindgen_ty_1::bits"]
        [::std::mem::offset_of!(ddebug_class_param__bindgen_ty_1, bits) - 0usize];
    ["Offset of field: ddebug_class_param__bindgen_ty_1::lvl"]
        [::std::mem::offset_of!(ddebug_class_param__bindgen_ty_1, lvl) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ddebug_class_param"][::std::mem::size_of::<ddebug_class_param>() - 24usize];
    ["Alignment of ddebug_class_param"][::std::mem::align_of::<ddebug_class_param>() - 8usize];
    ["Offset of field: ddebug_class_param::flags"]
        [::std::mem::offset_of!(ddebug_class_param, flags) - 8usize];
    ["Offset of field: ddebug_class_param::map"]
        [::std::mem::offset_of!(ddebug_class_param, map) - 16usize];
};
extern "C" {
    pub fn __dynamic_pr_debug(descriptor: *mut _ddebug, fmt: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    pub fn __dynamic_dev_dbg(
        descriptor: *mut _ddebug,
        dev: *const device,
        fmt: *const ::std::os::raw::c_char,
        ...
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct net_device {
    _unused: [u8; 0],
}
extern "C" {
    pub fn __dynamic_netdev_dbg(
        descriptor: *mut _ddebug,
        dev: *const net_device,
        fmt: *const ::std::os::raw::c_char,
        ...
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ib_device {
    _unused: [u8; 0],
}
extern "C" {
    pub fn __dynamic_ibdev_dbg(
        descriptor: *mut _ddebug,
        ibdev: *const ib_device,
        fmt: *const ::std::os::raw::c_char,
        ...
    );
}
extern "C" {
    pub fn ddebug_dyndbg_module_param_cb(
        param: *mut ::std::os::raw::c_char,
        val: *mut ::std::os::raw::c_char,
        modname: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn param_set_dyndbg_classes(
        instr: *const ::std::os::raw::c_char,
        kp: *const kernel_param,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn param_get_dyndbg_classes(
        buffer: *mut ::std::os::raw::c_char,
        kp: *const kernel_param,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct kernel_param_ops {
    pub flags: ::std::os::raw::c_uint,
    pub set: ::std::option::Option<
        unsafe extern "C" fn(
            val: *const ::std::os::raw::c_char,
            kp: *const kernel_param,
        ) -> ::std::os::raw::c_int,
    >,
    pub get: ::std::option::Option<
        unsafe extern "C" fn(
            buffer: *mut ::std::os::raw::c_char,
            kp: *const kernel_param,
        ) -> ::std::os::raw::c_int,
    >,
    pub free: ::std::option::Option<unsafe extern "C" fn(arg: *mut ::std::os::raw::c_void)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kernel_param_ops"][::std::mem::size_of::<kernel_param_ops>() - 32usize];
    ["Alignment of kernel_param_ops"][::std::mem::align_of::<kernel_param_ops>() - 8usize];
    ["Offset of field: kernel_param_ops::flags"]
        [::std::mem::offset_of!(kernel_param_ops, flags) - 0usize];
    ["Offset of field: kernel_param_ops::set"]
        [::std::mem::offset_of!(kernel_param_ops, set) - 8usize];
    ["Offset of field: kernel_param_ops::get"]
        [::std::mem::offset_of!(kernel_param_ops, get) - 16usize];
    ["Offset of field: kernel_param_ops::free"]
        [::std::mem::offset_of!(kernel_param_ops, free) - 24usize];
};
extern "C" {
    pub static param_ops_dyndbg_classes: kernel_param_ops;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct file_operations {
    pub owner: *mut module,
    pub fop_flags: fop_flags_t,
    pub llseek: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut file, arg2: loff_t, arg3: ::std::os::raw::c_int) -> loff_t,
    >,
    pub read: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut file,
            arg2: *mut ::std::os::raw::c_char,
            arg3: usize,
            arg4: *mut loff_t,
        ) -> isize,
    >,
    pub write: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut file,
            arg2: *const ::std::os::raw::c_char,
            arg3: usize,
            arg4: *mut loff_t,
        ) -> isize,
    >,
    pub read_iter:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut kiocb, arg2: *mut iov_iter) -> isize>,
    pub write_iter:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut kiocb, arg2: *mut iov_iter) -> isize>,
    pub iopoll: ::std::option::Option<
        unsafe extern "C" fn(
            kiocb: *mut kiocb,
            arg1: *mut io_comp_batch,
            flags: ::std::os::raw::c_uint,
        ) -> ::std::os::raw::c_int,
    >,
    pub iterate_shared: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut file, arg2: *mut dir_context) -> ::std::os::raw::c_int,
    >,
    pub poll: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut file, arg2: *mut poll_table_struct) -> __poll_t,
    >,
    pub unlocked_ioctl: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut file,
            arg2: ::std::os::raw::c_uint,
            arg3: ::std::os::raw::c_ulong,
        ) -> ::std::os::raw::c_long,
    >,
    pub compat_ioctl: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut file,
            arg2: ::std::os::raw::c_uint,
            arg3: ::std::os::raw::c_ulong,
        ) -> ::std::os::raw::c_long,
    >,
    pub mmap: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut file, arg2: *mut vm_area_struct) -> ::std::os::raw::c_int,
    >,
    pub open: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut inode, arg2: *mut file) -> ::std::os::raw::c_int,
    >,
    pub flush: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut file, id: fl_owner_t) -> ::std::os::raw::c_int,
    >,
    pub release: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut inode, arg2: *mut file) -> ::std::os::raw::c_int,
    >,
    pub fsync: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut file,
            arg2: loff_t,
            arg3: loff_t,
            datasync: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub fasync: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: *mut file,
            arg3: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub lock: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut file,
            arg2: ::std::os::raw::c_int,
            arg3: *mut file_lock,
        ) -> ::std::os::raw::c_int,
    >,
    pub get_unmapped_area: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut file,
            arg2: ::std::os::raw::c_ulong,
            arg3: ::std::os::raw::c_ulong,
            arg4: ::std::os::raw::c_ulong,
            arg5: ::std::os::raw::c_ulong,
        ) -> ::std::os::raw::c_ulong,
    >,
    pub check_flags: ::std::option::Option<
        unsafe extern "C" fn(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int,
    >,
    pub flock: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut file,
            arg2: ::std::os::raw::c_int,
            arg3: *mut file_lock,
        ) -> ::std::os::raw::c_int,
    >,
    pub splice_write: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut pipe_inode_info,
            arg2: *mut file,
            arg3: *mut loff_t,
            arg4: usize,
            arg5: ::std::os::raw::c_uint,
        ) -> isize,
    >,
    pub splice_read: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut file,
            arg2: *mut loff_t,
            arg3: *mut pipe_inode_info,
            arg4: usize,
            arg5: ::std::os::raw::c_uint,
        ) -> isize,
    >,
    pub splice_eof: ::std::option::Option<unsafe extern "C" fn(file: *mut file)>,
    pub setlease: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut file,
            arg2: ::std::os::raw::c_int,
            arg3: *mut *mut file_lease,
            arg4: *mut *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
    pub fallocate: ::std::option::Option<
        unsafe extern "C" fn(
            file: *mut file,
            mode: ::std::os::raw::c_int,
            offset: loff_t,
            len: loff_t,
        ) -> ::std::os::raw::c_long,
    >,
    pub show_fdinfo: ::std::option::Option<unsafe extern "C" fn(m: *mut seq_file, f: *mut file)>,
    pub copy_file_range: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut file,
            arg2: loff_t,
            arg3: *mut file,
            arg4: loff_t,
            arg5: usize,
            arg6: ::std::os::raw::c_uint,
        ) -> isize,
    >,
    pub remap_file_range: ::std::option::Option<
        unsafe extern "C" fn(
            file_in: *mut file,
            pos_in: loff_t,
            file_out: *mut file,
            pos_out: loff_t,
            len: loff_t,
            remap_flags: ::std::os::raw::c_uint,
        ) -> loff_t,
    >,
    pub fadvise: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut file,
            arg2: loff_t,
            arg3: loff_t,
            arg4: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub uring_cmd: ::std::option::Option<
        unsafe extern "C" fn(
            ioucmd: *mut io_uring_cmd,
            issue_flags: ::std::os::raw::c_uint,
        ) -> ::std::os::raw::c_int,
    >,
    pub uring_cmd_iopoll: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut io_uring_cmd,
            arg2: *mut io_comp_batch,
            poll_flags: ::std::os::raw::c_uint,
        ) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of file_operations"][::std::mem::size_of::<file_operations>() - 264usize];
    ["Alignment of file_operations"][::std::mem::align_of::<file_operations>() - 8usize];
    ["Offset of field: file_operations::owner"]
        [::std::mem::offset_of!(file_operations, owner) - 0usize];
    ["Offset of field: file_operations::fop_flags"]
        [::std::mem::offset_of!(file_operations, fop_flags) - 8usize];
    ["Offset of field: file_operations::llseek"]
        [::std::mem::offset_of!(file_operations, llseek) - 16usize];
    ["Offset of field: file_operations::read"]
        [::std::mem::offset_of!(file_operations, read) - 24usize];
    ["Offset of field: file_operations::write"]
        [::std::mem::offset_of!(file_operations, write) - 32usize];
    ["Offset of field: file_operations::read_iter"]
        [::std::mem::offset_of!(file_operations, read_iter) - 40usize];
    ["Offset of field: file_operations::write_iter"]
        [::std::mem::offset_of!(file_operations, write_iter) - 48usize];
    ["Offset of field: file_operations::iopoll"]
        [::std::mem::offset_of!(file_operations, iopoll) - 56usize];
    ["Offset of field: file_operations::iterate_shared"]
        [::std::mem::offset_of!(file_operations, iterate_shared) - 64usize];
    ["Offset of field: file_operations::poll"]
        [::std::mem::offset_of!(file_operations, poll) - 72usize];
    ["Offset of field: file_operations::unlocked_ioctl"]
        [::std::mem::offset_of!(file_operations, unlocked_ioctl) - 80usize];
    ["Offset of field: file_operations::compat_ioctl"]
        [::std::mem::offset_of!(file_operations, compat_ioctl) - 88usize];
    ["Offset of field: file_operations::mmap"]
        [::std::mem::offset_of!(file_operations, mmap) - 96usize];
    ["Offset of field: file_operations::open"]
        [::std::mem::offset_of!(file_operations, open) - 104usize];
    ["Offset of field: file_operations::flush"]
        [::std::mem::offset_of!(file_operations, flush) - 112usize];
    ["Offset of field: file_operations::release"]
        [::std::mem::offset_of!(file_operations, release) - 120usize];
    ["Offset of field: file_operations::fsync"]
        [::std::mem::offset_of!(file_operations, fsync) - 128usize];
    ["Offset of field: file_operations::fasync"]
        [::std::mem::offset_of!(file_operations, fasync) - 136usize];
    ["Offset of field: file_operations::lock"]
        [::std::mem::offset_of!(file_operations, lock) - 144usize];
    ["Offset of field: file_operations::get_unmapped_area"]
        [::std::mem::offset_of!(file_operations, get_unmapped_area) - 152usize];
    ["Offset of field: file_operations::check_flags"]
        [::std::mem::offset_of!(file_operations, check_flags) - 160usize];
    ["Offset of field: file_operations::flock"]
        [::std::mem::offset_of!(file_operations, flock) - 168usize];
    ["Offset of field: file_operations::splice_write"]
        [::std::mem::offset_of!(file_operations, splice_write) - 176usize];
    ["Offset of field: file_operations::splice_read"]
        [::std::mem::offset_of!(file_operations, splice_read) - 184usize];
    ["Offset of field: file_operations::splice_eof"]
        [::std::mem::offset_of!(file_operations, splice_eof) - 192usize];
    ["Offset of field: file_operations::setlease"]
        [::std::mem::offset_of!(file_operations, setlease) - 200usize];
    ["Offset of field: file_operations::fallocate"]
        [::std::mem::offset_of!(file_operations, fallocate) - 208usize];
    ["Offset of field: file_operations::show_fdinfo"]
        [::std::mem::offset_of!(file_operations, show_fdinfo) - 216usize];
    ["Offset of field: file_operations::copy_file_range"]
        [::std::mem::offset_of!(file_operations, copy_file_range) - 224usize];
    ["Offset of field: file_operations::remap_file_range"]
        [::std::mem::offset_of!(file_operations, remap_file_range) - 232usize];
    ["Offset of field: file_operations::fadvise"]
        [::std::mem::offset_of!(file_operations, fadvise) - 240usize];
    ["Offset of field: file_operations::uring_cmd"]
        [::std::mem::offset_of!(file_operations, uring_cmd) - 248usize];
    ["Offset of field: file_operations::uring_cmd_iopoll"]
        [::std::mem::offset_of!(file_operations, uring_cmd_iopoll) - 256usize];
};
extern "C" {
    pub static kmsg_fops: file_operations;
}
pub const DUMP_PREFIX_NONE: _bindgen_ty_2 = 0;
pub const DUMP_PREFIX_ADDRESS: _bindgen_ty_2 = 1;
pub const DUMP_PREFIX_OFFSET: _bindgen_ty_2 = 2;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
extern "C" {
    pub fn hex_dump_to_buffer(
        buf: *const ::std::os::raw::c_void,
        len: usize,
        rowsize: ::std::os::raw::c_int,
        groupsize: ::std::os::raw::c_int,
        linebuf: *mut ::std::os::raw::c_char,
        linebuflen: usize,
        ascii: bool_,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn print_hex_dump(
        level: *const ::std::os::raw::c_char,
        prefix_str: *const ::std::os::raw::c_char,
        prefix_type: ::std::os::raw::c_int,
        rowsize: ::std::os::raw::c_int,
        groupsize: ::std::os::raw::c_int,
        buf: *const ::std::os::raw::c_void,
        len: usize,
        ascii: bool_,
    );
}
extern "C" {
    pub fn num_to_str(
        buf: *mut ::std::os::raw::c_char,
        size: ::std::os::raw::c_int,
        num: ::std::os::raw::c_ulonglong,
        width: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(
        buf: *mut ::std::os::raw::c_char,
        fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(
        buf: *mut ::std::os::raw::c_char,
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(
        buf: *mut ::std::os::raw::c_char,
        size: ::std::os::raw::c_ulong,
        fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(
        buf: *mut ::std::os::raw::c_char,
        size: ::std::os::raw::c_ulong,
        fmt: *const ::std::os::raw::c_char,
        args: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scnprintf(
        buf: *mut ::std::os::raw::c_char,
        size: usize,
        fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscnprintf(
        buf: *mut ::std::os::raw::c_char,
        size: usize,
        fmt: *const ::std::os::raw::c_char,
        args: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kasprintf(
        gfp: gfp_t,
        fmt: *const ::std::os::raw::c_char,
        ...
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn kvasprintf(
        gfp: gfp_t,
        fmt: *const ::std::os::raw::c_char,
        args: *mut __va_list_tag,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn kvasprintf_const(
        gfp: gfp_t,
        fmt: *const ::std::os::raw::c_char,
        args: *mut __va_list_tag,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn sscanf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub static mut no_hash_pointers: bool_;
}
extern "C" {
    pub fn no_hash_pointers_enable(str_: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct static_call_site {
    pub addr: s32,
    pub key: s32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of static_call_site"][::std::mem::size_of::<static_call_site>() - 8usize];
    ["Alignment of static_call_site"][::std::mem::align_of::<static_call_site>() - 4usize];
    ["Offset of field: static_call_site::addr"]
        [::std::mem::offset_of!(static_call_site, addr) - 0usize];
    ["Offset of field: static_call_site::key"]
        [::std::mem::offset_of!(static_call_site, key) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct static_call_key {
    pub func: *mut ::std::os::raw::c_void,
    pub __bindgen_anon_1: static_call_key__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union static_call_key__bindgen_ty_1 {
    pub type_: ::std::os::raw::c_ulong,
    pub mods: *mut static_call_mod,
    pub sites: *mut static_call_site,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of static_call_key__bindgen_ty_1"]
        [::std::mem::size_of::<static_call_key__bindgen_ty_1>() - 8usize];
    ["Alignment of static_call_key__bindgen_ty_1"]
        [::std::mem::align_of::<static_call_key__bindgen_ty_1>() - 8usize];
    ["Offset of field: static_call_key__bindgen_ty_1::type_"]
        [::std::mem::offset_of!(static_call_key__bindgen_ty_1, type_) - 0usize];
    ["Offset of field: static_call_key__bindgen_ty_1::mods"]
        [::std::mem::offset_of!(static_call_key__bindgen_ty_1, mods) - 0usize];
    ["Offset of field: static_call_key__bindgen_ty_1::sites"]
        [::std::mem::offset_of!(static_call_key__bindgen_ty_1, sites) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of static_call_key"][::std::mem::size_of::<static_call_key>() - 16usize];
    ["Alignment of static_call_key"][::std::mem::align_of::<static_call_key>() - 8usize];
    ["Offset of field: static_call_key::func"]
        [::std::mem::offset_of!(static_call_key, func) - 0usize];
};
extern "C" {
    pub fn __cond_resched() -> ::std::os::raw::c_int;
}
extern "C" {
    pub static mut __SCK__might_resched: static_call_key;
}
extern "C" {
    pub fn __SCT__might_resched() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn do_exit(error_code: ::std::os::raw::c_long) -> !;
}
extern "C" {
    pub fn core_kernel_text(addr: ::std::os::raw::c_ulong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __kernel_text_address(addr: ::std::os::raw::c_ulong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kernel_text_address(addr: ::std::os::raw::c_ulong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn func_ptr_is_kernel_text(ptr: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bust_spinlocks(yes: ::std::os::raw::c_int);
}
extern "C" {
    pub static mut root_mountflags: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut early_boot_irqs_disabled: bool_;
}
pub const system_states_SYSTEM_BOOTING: system_states = 0;
pub const system_states_SYSTEM_SCHEDULING: system_states = 1;
pub const system_states_SYSTEM_FREEING_INITMEM: system_states = 2;
pub const system_states_SYSTEM_RUNNING: system_states = 3;
pub const system_states_SYSTEM_HALT: system_states = 4;
pub const system_states_SYSTEM_POWER_OFF: system_states = 5;
pub const system_states_SYSTEM_RESTART: system_states = 6;
pub const system_states_SYSTEM_SUSPEND: system_states = 7;
pub type system_states = ::std::os::raw::c_uint;
extern "C" {
    pub static mut system_state: system_states;
}
pub const ftrace_dump_mode_DUMP_NONE: ftrace_dump_mode = 0;
pub const ftrace_dump_mode_DUMP_ALL: ftrace_dump_mode = 1;
pub const ftrace_dump_mode_DUMP_ORIG: ftrace_dump_mode = 2;
pub const ftrace_dump_mode_DUMP_PARAM: ftrace_dump_mode = 3;
pub type ftrace_dump_mode = ::std::os::raw::c_uint;
extern "C" {
    pub fn tracing_on();
}
extern "C" {
    pub fn tracing_off();
}
extern "C" {
    pub fn tracing_is_on() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tracing_snapshot();
}
extern "C" {
    pub fn tracing_snapshot_alloc();
}
extern "C" {
    pub fn tracing_start();
}
extern "C" {
    pub fn tracing_stop();
}
extern "C" {
    pub fn __trace_bprintk(
        ip: ::std::os::raw::c_ulong,
        fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __trace_printk(
        ip: ::std::os::raw::c_ulong,
        fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __trace_bputs(
        ip: ::std::os::raw::c_ulong,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __trace_puts(
        ip: ::std::os::raw::c_ulong,
        str_: *const ::std::os::raw::c_char,
        size: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn trace_dump_stack(skip: ::std::os::raw::c_int);
}
extern "C" {
    pub fn __ftrace_vbprintk(
        ip: ::std::os::raw::c_ulong,
        fmt: *const ::std::os::raw::c_char,
        ap: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __ftrace_vprintk(
        ip: ::std::os::raw::c_ulong,
        fmt: *const ::std::os::raw::c_char,
        ap: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftrace_dump(oops_dump_mode: ftrace_dump_mode);
}
extern "C" {
    pub fn _find_next_bit(
        addr1: *const ::std::os::raw::c_ulong,
        nbits: ::std::os::raw::c_ulong,
        start: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn _find_next_and_bit(
        addr1: *const ::std::os::raw::c_ulong,
        addr2: *const ::std::os::raw::c_ulong,
        nbits: ::std::os::raw::c_ulong,
        start: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn _find_next_andnot_bit(
        addr1: *const ::std::os::raw::c_ulong,
        addr2: *const ::std::os::raw::c_ulong,
        nbits: ::std::os::raw::c_ulong,
        start: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn _find_next_or_bit(
        addr1: *const ::std::os::raw::c_ulong,
        addr2: *const ::std::os::raw::c_ulong,
        nbits: ::std::os::raw::c_ulong,
        start: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn _find_next_zero_bit(
        addr: *const ::std::os::raw::c_ulong,
        nbits: ::std::os::raw::c_ulong,
        start: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn _find_first_bit(
        addr: *const ::std::os::raw::c_ulong,
        size: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn __find_nth_bit(
        addr: *const ::std::os::raw::c_ulong,
        size: ::std::os::raw::c_ulong,
        n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn __find_nth_and_bit(
        addr1: *const ::std::os::raw::c_ulong,
        addr2: *const ::std::os::raw::c_ulong,
        size: ::std::os::raw::c_ulong,
        n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn __find_nth_andnot_bit(
        addr1: *const ::std::os::raw::c_ulong,
        addr2: *const ::std::os::raw::c_ulong,
        size: ::std::os::raw::c_ulong,
        n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn __find_nth_and_andnot_bit(
        addr1: *const ::std::os::raw::c_ulong,
        addr2: *const ::std::os::raw::c_ulong,
        addr3: *const ::std::os::raw::c_ulong,
        size: ::std::os::raw::c_ulong,
        n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn _find_first_and_bit(
        addr1: *const ::std::os::raw::c_ulong,
        addr2: *const ::std::os::raw::c_ulong,
        size: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn _find_first_and_and_bit(
        addr1: *const ::std::os::raw::c_ulong,
        addr2: *const ::std::os::raw::c_ulong,
        addr3: *const ::std::os::raw::c_ulong,
        size: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn _find_first_zero_bit(
        addr: *const ::std::os::raw::c_ulong,
        size: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn _find_last_bit(
        addr: *const ::std::os::raw::c_ulong,
        size: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    #[doc = " find_next_clump8 - find next 8-bit clump with set bits in a memory region\n @clump: location to store copy of found clump\n @addr: address to base the search on\n @size: bitmap size in number of bits\n @offset: bit offset at which to start searching\n\n Returns the bit offset for the next set clump; the found clump value is\n copied to the location pointed by @clump. If no bits are set, returns @size."]
    pub fn find_next_clump8(
        clump: *mut ::std::os::raw::c_ulong,
        addr: *const ::std::os::raw::c_ulong,
        size: ::std::os::raw::c_ulong,
        offset: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strndup_user(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_long,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn memdup_user(
        arg1: *const ::std::os::raw::c_void,
        arg2: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn vmemdup_user(
        arg1: *const ::std::os::raw::c_void,
        arg2: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memdup_user_nul(
        arg1: *const ::std::os::raw::c_void,
        arg2: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memcpy(
        to: *mut ::std::os::raw::c_void,
        from: *const ::std::os::raw::c_void,
        len: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn __memcpy(
        to: *mut ::std::os::raw::c_void,
        from: *const ::std::os::raw::c_void,
        len: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memset(
        s: *mut ::std::os::raw::c_void,
        c: ::std::os::raw::c_int,
        n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn __memset(
        s: *mut ::std::os::raw::c_void,
        c: ::std::os::raw::c_int,
        n: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memmove(
        dest: *mut ::std::os::raw::c_void,
        src: *const ::std::os::raw::c_void,
        count: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn __memmove(
        dest: *mut ::std::os::raw::c_void,
        src: *const ::std::os::raw::c_void,
        count: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memcmp(
        cs: *const ::std::os::raw::c_void,
        ct: *const ::std::os::raw::c_void,
        count: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strlen(s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strcpy(
        dest: *mut ::std::os::raw::c_char,
        src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcat(
        dest: *mut ::std::os::raw::c_char,
        src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcmp(
        cs: *const ::std::os::raw::c_char,
        ct: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __memcpy_flushcache(
        dst: *mut ::std::os::raw::c_void,
        src: *const ::std::os::raw::c_void,
        cnt: usize,
    );
}
extern "C" {
    pub fn strncpy(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn sized_strscpy(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: usize,
    ) -> isize;
}
extern "C" {
    pub fn strncat(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strlcat(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: __kernel_size_t,
    ) -> usize;
}
extern "C" {
    pub fn strncmp(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp(
        s1: *const ::std::os::raw::c_char,
        s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp(
        s1: *const ::std::os::raw::c_char,
        s2: *const ::std::os::raw::c_char,
        n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strchr(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strchrnul(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strnchrnul(
        arg1: *const ::std::os::raw::c_char,
        arg2: usize,
        arg3: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strnchr(
        arg1: *const ::std::os::raw::c_char,
        arg2: usize,
        arg3: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strrchr(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn skip_spaces(arg1: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strim(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strstr(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strnstr(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strnlen(arg1: *const ::std::os::raw::c_char, arg2: __kernel_size_t) -> __kernel_size_t;
}
extern "C" {
    pub fn strpbrk(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strsep(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strspn(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strcspn(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn __memcat_p(
        a: *mut *mut ::std::os::raw::c_void,
        b: *mut *mut ::std::os::raw::c_void,
    ) -> *mut *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memscan(
        arg1: *mut ::std::os::raw::c_void,
        arg2: ::std::os::raw::c_int,
        arg3: __kernel_size_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn bcmp(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memchr(
        arg1: *const ::std::os::raw::c_void,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memchr_inv(
        s: *const ::std::os::raw::c_void,
        c: ::std::os::raw::c_int,
        n: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strreplace(
        str_: *mut ::std::os::raw::c_char,
        old: ::std::os::raw::c_char,
        new: ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn kfree_const(x: *const ::std::os::raw::c_void);
}
extern "C" {
    pub fn kstrdup(s: *const ::std::os::raw::c_char, gfp: gfp_t) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn kstrdup_const(
        s: *const ::std::os::raw::c_char,
        gfp: gfp_t,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn kstrndup(
        s: *const ::std::os::raw::c_char,
        len: usize,
        gfp: gfp_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn kmemdup_noprof(
        src: *const ::std::os::raw::c_void,
        len: usize,
        gfp: gfp_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn kvmemdup(
        src: *const ::std::os::raw::c_void,
        len: usize,
        gfp: gfp_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn kmemdup_nul(
        s: *const ::std::os::raw::c_char,
        len: usize,
        gfp: gfp_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn kmemdup_array(
        src: *const ::std::os::raw::c_void,
        count: usize,
        element_size: usize,
        gfp: gfp_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn argv_split(
        gfp: gfp_t,
        str_: *const ::std::os::raw::c_char,
        argcp: *mut ::std::os::raw::c_int,
    ) -> *mut *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn argv_free(argv: *mut *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn get_option(
        str_: *mut *mut ::std::os::raw::c_char,
        pint: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn get_options(
        str_: *const ::std::os::raw::c_char,
        nints: ::std::os::raw::c_int,
        ints: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn memparse(
        ptr: *const ::std::os::raw::c_char,
        retptr: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn parse_option_str(
        str_: *const ::std::os::raw::c_char,
        option: *const ::std::os::raw::c_char,
    ) -> bool_;
}
extern "C" {
    pub fn next_arg(
        args: *mut ::std::os::raw::c_char,
        param: *mut *mut ::std::os::raw::c_char,
        val: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn sysfs_streq(
        s1: *const ::std::os::raw::c_char,
        s2: *const ::std::os::raw::c_char,
    ) -> bool_;
}
extern "C" {
    pub fn match_string(
        array: *const *const ::std::os::raw::c_char,
        n: usize,
        string: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __sysfs_match_string(
        array: *const *const ::std::os::raw::c_char,
        n: usize,
        s: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vbin_printf(
        bin_buf: *mut u32_,
        size: usize,
        fmt: *const ::std::os::raw::c_char,
        args: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bstr_printf(
        buf: *mut ::std::os::raw::c_char,
        size: usize,
        fmt: *const ::std::os::raw::c_char,
        bin_buf: *const u32_,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bprintf(
        bin_buf: *mut u32_,
        size: usize,
        fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memory_read_from_buffer(
        to: *mut ::std::os::raw::c_void,
        count: usize,
        ppos: *mut loff_t,
        from: *const ::std::os::raw::c_void,
        available: usize,
    ) -> isize;
}
extern "C" {
    pub fn ptr_to_hashval(
        ptr: *const ::std::os::raw::c_void,
        hashval_out: *mut ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memweight(ptr: *const ::std::os::raw::c_void, bytes: usize) -> usize;
}
extern "C" {
    pub fn memcpy_and_pad(
        dest: *mut ::std::os::raw::c_void,
        dest_len: usize,
        src: *const ::std::os::raw::c_void,
        count: usize,
        pad: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn bitmap_parse_user(
        ubuf: *const ::std::os::raw::c_char,
        ulen: ::std::os::raw::c_uint,
        dst: *mut ::std::os::raw::c_ulong,
        nbits: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bitmap_print_to_pagebuf(
        list: bool_,
        buf: *mut ::std::os::raw::c_char,
        maskp: *const ::std::os::raw::c_ulong,
        nmaskbits: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bitmap_print_bitmask_to_buf(
        buf: *mut ::std::os::raw::c_char,
        maskp: *const ::std::os::raw::c_ulong,
        nmaskbits: ::std::os::raw::c_int,
        off: loff_t,
        count: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bitmap_print_list_to_buf(
        buf: *mut ::std::os::raw::c_char,
        maskp: *const ::std::os::raw::c_ulong,
        nmaskbits: ::std::os::raw::c_int,
        off: loff_t,
        count: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bitmap_parse(
        buf: *const ::std::os::raw::c_char,
        buflen: ::std::os::raw::c_uint,
        dst: *mut ::std::os::raw::c_ulong,
        nbits: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bitmap_parselist(
        buf: *const ::std::os::raw::c_char,
        maskp: *mut ::std::os::raw::c_ulong,
        nmaskbits: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bitmap_parselist_user(
        ubuf: *const ::std::os::raw::c_char,
        ulen: ::std::os::raw::c_uint,
        dst: *mut ::std::os::raw::c_ulong,
        nbits: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " DOC: declare bitmap\n The DECLARE_BITMAP(name,bits) macro, in linux/types.h, can be used\n to declare an array named 'name' of just enough unsigned longs to\n contain all bit positions from 0 to 'bits' - 1."]
    pub fn bitmap_alloc(
        nbits: ::std::os::raw::c_uint,
        flags: gfp_t,
    ) -> *mut ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn bitmap_zalloc(
        nbits: ::std::os::raw::c_uint,
        flags: gfp_t,
    ) -> *mut ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn bitmap_alloc_node(
        nbits: ::std::os::raw::c_uint,
        flags: gfp_t,
        node: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn bitmap_zalloc_node(
        nbits: ::std::os::raw::c_uint,
        flags: gfp_t,
        node: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn bitmap_free(bitmap: *const ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn devm_bitmap_alloc(
        dev: *mut device,
        nbits: ::std::os::raw::c_uint,
        flags: gfp_t,
    ) -> *mut ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn devm_bitmap_zalloc(
        dev: *mut device,
        nbits: ::std::os::raw::c_uint,
        flags: gfp_t,
    ) -> *mut ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn __bitmap_equal(
        bitmap1: *const ::std::os::raw::c_ulong,
        bitmap2: *const ::std::os::raw::c_ulong,
        nbits: ::std::os::raw::c_uint,
    ) -> bool_;
}
extern "C" {
    pub fn __bitmap_or_equal(
        src1: *const ::std::os::raw::c_ulong,
        src2: *const ::std::os::raw::c_ulong,
        src3: *const ::std::os::raw::c_ulong,
        nbits: ::std::os::raw::c_uint,
    ) -> bool_;
}
extern "C" {
    pub fn __bitmap_complement(
        dst: *mut ::std::os::raw::c_ulong,
        src: *const ::std::os::raw::c_ulong,
        nbits: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn __bitmap_shift_right(
        dst: *mut ::std::os::raw::c_ulong,
        src: *const ::std::os::raw::c_ulong,
        shift: ::std::os::raw::c_uint,
        nbits: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn __bitmap_shift_left(
        dst: *mut ::std::os::raw::c_ulong,
        src: *const ::std::os::raw::c_ulong,
        shift: ::std::os::raw::c_uint,
        nbits: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn bitmap_cut(
        dst: *mut ::std::os::raw::c_ulong,
        src: *const ::std::os::raw::c_ulong,
        first: ::std::os::raw::c_uint,
        cut: ::std::os::raw::c_uint,
        nbits: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn __bitmap_and(
        dst: *mut ::std::os::raw::c_ulong,
        bitmap1: *const ::std::os::raw::c_ulong,
        bitmap2: *const ::std::os::raw::c_ulong,
        nbits: ::std::os::raw::c_uint,
    ) -> bool_;
}
extern "C" {
    pub fn __bitmap_or(
        dst: *mut ::std::os::raw::c_ulong,
        bitmap1: *const ::std::os::raw::c_ulong,
        bitmap2: *const ::std::os::raw::c_ulong,
        nbits: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn __bitmap_xor(
        dst: *mut ::std::os::raw::c_ulong,
        bitmap1: *const ::std::os::raw::c_ulong,
        bitmap2: *const ::std::os::raw::c_ulong,
        nbits: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn __bitmap_andnot(
        dst: *mut ::std::os::raw::c_ulong,
        bitmap1: *const ::std::os::raw::c_ulong,
        bitmap2: *const ::std::os::raw::c_ulong,
        nbits: ::std::os::raw::c_uint,
    ) -> bool_;
}
extern "C" {
    pub fn __bitmap_replace(
        dst: *mut ::std::os::raw::c_ulong,
        old: *const ::std::os::raw::c_ulong,
        new: *const ::std::os::raw::c_ulong,
        mask: *const ::std::os::raw::c_ulong,
        nbits: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn __bitmap_intersects(
        bitmap1: *const ::std::os::raw::c_ulong,
        bitmap2: *const ::std::os::raw::c_ulong,
        nbits: ::std::os::raw::c_uint,
    ) -> bool_;
}
extern "C" {
    pub fn __bitmap_subset(
        bitmap1: *const ::std::os::raw::c_ulong,
        bitmap2: *const ::std::os::raw::c_ulong,
        nbits: ::std::os::raw::c_uint,
    ) -> bool_;
}
extern "C" {
    pub fn __bitmap_weight(
        bitmap: *const ::std::os::raw::c_ulong,
        nbits: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn __bitmap_weight_and(
        bitmap1: *const ::std::os::raw::c_ulong,
        bitmap2: *const ::std::os::raw::c_ulong,
        nbits: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn __bitmap_weight_andnot(
        bitmap1: *const ::std::os::raw::c_ulong,
        bitmap2: *const ::std::os::raw::c_ulong,
        nbits: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn __bitmap_set(
        map: *mut ::std::os::raw::c_ulong,
        start: ::std::os::raw::c_uint,
        len: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn __bitmap_clear(
        map: *mut ::std::os::raw::c_ulong,
        start: ::std::os::raw::c_uint,
        len: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn bitmap_find_next_zero_area_off(
        map: *mut ::std::os::raw::c_ulong,
        size: ::std::os::raw::c_ulong,
        start: ::std::os::raw::c_ulong,
        nr: ::std::os::raw::c_uint,
        align_mask: ::std::os::raw::c_ulong,
        align_offset: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn bitmap_remap(
        dst: *mut ::std::os::raw::c_ulong,
        src: *const ::std::os::raw::c_ulong,
        old: *const ::std::os::raw::c_ulong,
        new: *const ::std::os::raw::c_ulong,
        nbits: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn bitmap_bitremap(
        oldbit: ::std::os::raw::c_int,
        old: *const ::std::os::raw::c_ulong,
        new: *const ::std::os::raw::c_ulong,
        bits: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bitmap_onto(
        dst: *mut ::std::os::raw::c_ulong,
        orig: *const ::std::os::raw::c_ulong,
        relmap: *const ::std::os::raw::c_ulong,
        bits: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn bitmap_fold(
        dst: *mut ::std::os::raw::c_ulong,
        orig: *const ::std::os::raw::c_ulong,
        sz: ::std::os::raw::c_uint,
        nbits: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn bitmap_from_arr32(
        bitmap: *mut ::std::os::raw::c_ulong,
        buf: *const u32_,
        nbits: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn bitmap_to_arr32(
        buf: *mut u32_,
        bitmap: *const ::std::os::raw::c_ulong,
        nbits: ::std::os::raw::c_uint,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cpumask {
    pub bits: [::std::os::raw::c_ulong; 128usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpumask"][::std::mem::size_of::<cpumask>() - 1024usize];
    ["Alignment of cpumask"][::std::mem::align_of::<cpumask>() - 8usize];
    ["Offset of field: cpumask::bits"][::std::mem::offset_of!(cpumask, bits) - 0usize];
};
pub type cpumask_t = cpumask;
pub type cpumask_var_t = *mut cpumask;
extern "C" {
    pub fn __xchg_wrong_size();
}
extern "C" {
    pub fn __cmpxchg_wrong_size();
}
extern "C" {
    pub fn __xadd_wrong_size();
}
extern "C" {
    pub fn __add_wrong_size();
}
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union __u128_halves {
    pub full: u128_,
    pub __bindgen_anon_1: __u128_halves__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __u128_halves__bindgen_ty_1 {
    pub low: u64_,
    pub high: u64_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __u128_halves__bindgen_ty_1"]
        [::std::mem::size_of::<__u128_halves__bindgen_ty_1>() - 16usize];
    ["Alignment of __u128_halves__bindgen_ty_1"]
        [::std::mem::align_of::<__u128_halves__bindgen_ty_1>() - 8usize];
    ["Offset of field: __u128_halves__bindgen_ty_1::low"]
        [::std::mem::offset_of!(__u128_halves__bindgen_ty_1, low) - 0usize];
    ["Offset of field: __u128_halves__bindgen_ty_1::high"]
        [::std::mem::offset_of!(__u128_halves__bindgen_ty_1, high) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __u128_halves"][::std::mem::size_of::<__u128_halves>() - 16usize];
    ["Alignment of __u128_halves"][::std::mem::align_of::<__u128_halves>() - 16usize];
    ["Offset of field: __u128_halves::full"][::std::mem::offset_of!(__u128_halves, full) - 0usize];
};
pub type atomic_long_t = atomic64_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct unwind_hint {
    pub ip: u32_,
    pub sp_offset: s16,
    pub sp_reg: u8_,
    pub type_: u8_,
    pub signal: u8_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of unwind_hint"][::std::mem::size_of::<unwind_hint>() - 12usize];
    ["Alignment of unwind_hint"][::std::mem::align_of::<unwind_hint>() - 4usize];
    ["Offset of field: unwind_hint::ip"][::std::mem::offset_of!(unwind_hint, ip) - 0usize];
    ["Offset of field: unwind_hint::sp_offset"]
        [::std::mem::offset_of!(unwind_hint, sp_offset) - 4usize];
    ["Offset of field: unwind_hint::sp_reg"][::std::mem::offset_of!(unwind_hint, sp_reg) - 6usize];
    ["Offset of field: unwind_hint::type_"][::std::mem::offset_of!(unwind_hint, type_) - 7usize];
    ["Offset of field: unwind_hint::signal"][::std::mem::offset_of!(unwind_hint, signal) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct warn_args {
    _unused: [u8; 0],
}
extern "C" {
    pub fn __warn(
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
        caller: *mut ::std::os::raw::c_void,
        taint: ::std::os::raw::c_uint,
        regs: *mut pt_regs,
        args: *mut warn_args,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bug_entry {
    pub bug_addr_disp: ::std::os::raw::c_int,
    pub file_disp: ::std::os::raw::c_int,
    pub line: ::std::os::raw::c_ushort,
    pub flags: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bug_entry"][::std::mem::size_of::<bug_entry>() - 12usize];
    ["Alignment of bug_entry"][::std::mem::align_of::<bug_entry>() - 4usize];
    ["Offset of field: bug_entry::bug_addr_disp"]
        [::std::mem::offset_of!(bug_entry, bug_addr_disp) - 0usize];
    ["Offset of field: bug_entry::file_disp"]
        [::std::mem::offset_of!(bug_entry, file_disp) - 4usize];
    ["Offset of field: bug_entry::line"][::std::mem::offset_of!(bug_entry, line) - 8usize];
    ["Offset of field: bug_entry::flags"][::std::mem::offset_of!(bug_entry, flags) - 10usize];
};
extern "C" {
    pub fn warn_slowpath_fmt(
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
        taint: ::std::os::raw::c_uint,
        fmt: *const ::std::os::raw::c_char,
        ...
    );
}
extern "C" {
    pub fn __warn_printk(fmt: *const ::std::os::raw::c_char, ...);
}
pub const bug_trap_type_BUG_TRAP_TYPE_NONE: bug_trap_type = 0;
pub const bug_trap_type_BUG_TRAP_TYPE_WARN: bug_trap_type = 1;
pub const bug_trap_type_BUG_TRAP_TYPE_BUG: bug_trap_type = 2;
pub type bug_trap_type = ::std::os::raw::c_uint;
extern "C" {
    pub fn bug_get_file_line(
        bug: *mut bug_entry,
        file: *mut *const ::std::os::raw::c_char,
        line: *mut ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn find_bug(bugaddr: ::std::os::raw::c_ulong) -> *mut bug_entry;
}
extern "C" {
    pub fn report_bug(bug_addr: ::std::os::raw::c_ulong, regs: *mut pt_regs) -> bug_trap_type;
}
extern "C" {
    pub fn is_valid_bugaddr(addr: ::std::os::raw::c_ulong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn generic_bug_clear_once();
}
pub const ___GFP_DMA_BIT: _bindgen_ty_3 = 0;
pub const ___GFP_HIGHMEM_BIT: _bindgen_ty_3 = 1;
pub const ___GFP_DMA32_BIT: _bindgen_ty_3 = 2;
pub const ___GFP_MOVABLE_BIT: _bindgen_ty_3 = 3;
pub const ___GFP_RECLAIMABLE_BIT: _bindgen_ty_3 = 4;
pub const ___GFP_HIGH_BIT: _bindgen_ty_3 = 5;
pub const ___GFP_IO_BIT: _bindgen_ty_3 = 6;
pub const ___GFP_FS_BIT: _bindgen_ty_3 = 7;
pub const ___GFP_ZERO_BIT: _bindgen_ty_3 = 8;
pub const ___GFP_UNUSED_BIT: _bindgen_ty_3 = 9;
pub const ___GFP_DIRECT_RECLAIM_BIT: _bindgen_ty_3 = 10;
pub const ___GFP_KSWAPD_RECLAIM_BIT: _bindgen_ty_3 = 11;
pub const ___GFP_WRITE_BIT: _bindgen_ty_3 = 12;
pub const ___GFP_NOWARN_BIT: _bindgen_ty_3 = 13;
pub const ___GFP_RETRY_MAYFAIL_BIT: _bindgen_ty_3 = 14;
pub const ___GFP_NOFAIL_BIT: _bindgen_ty_3 = 15;
pub const ___GFP_NORETRY_BIT: _bindgen_ty_3 = 16;
pub const ___GFP_MEMALLOC_BIT: _bindgen_ty_3 = 17;
pub const ___GFP_COMP_BIT: _bindgen_ty_3 = 18;
pub const ___GFP_NOMEMALLOC_BIT: _bindgen_ty_3 = 19;
pub const ___GFP_HARDWALL_BIT: _bindgen_ty_3 = 20;
pub const ___GFP_THISNODE_BIT: _bindgen_ty_3 = 21;
pub const ___GFP_ACCOUNT_BIT: _bindgen_ty_3 = 22;
pub const ___GFP_ZEROTAGS_BIT: _bindgen_ty_3 = 23;
pub const ___GFP_NO_OBJ_EXT_BIT: _bindgen_ty_3 = 24;
pub const ___GFP_LAST_BIT: _bindgen_ty_3 = 25;
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
extern "C" {
    pub fn phys_to_target_node(start: phys_addr_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memory_add_physaddr_to_nid(start: u64_) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn numa_nearest_node(
        node: ::std::os::raw::c_int,
        state: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn numa_fill_memblks(start: u64_, end: u64_) -> ::std::os::raw::c_int;
}
#[doc = " struct attribute_group - data structure used to declare an attribute group.\n @name:\tOptional: Attribute group name\n\t\tIf specified, the attribute group will be created in a\n\t\tnew subdirectory with this name. Additionally when a\n\t\tgroup is named, @is_visible and @is_bin_visible may\n\t\treturn SYSFS_GROUP_INVISIBLE to control visibility of\n\t\tthe directory itself.\n @is_visible:\tOptional: Function to return permissions associated with an\n\t\tattribute of the group. Will be called repeatedly for\n\t\teach non-binary attribute in the group. Only read/write\n\t\tpermissions as well as SYSFS_PREALLOC are accepted. Must\n\t\treturn 0 if an attribute is not visible. The returned\n\t\tvalue will replace static permissions defined in struct\n\t\tattribute. Use SYSFS_GROUP_VISIBLE() when assigning this\n\t\tcallback to specify separate _group_visible() and\n\t\t_attr_visible() handlers.\n @is_bin_visible:\n\t\tOptional: Function to return permissions associated with a\n\t\tbinary attribute of the group. Will be called repeatedly\n\t\tfor each binary attribute in the group. Only read/write\n\t\tpermissions as well as SYSFS_PREALLOC (and the\n\t\tvisibility flags for named groups) are accepted. Must\n\t\treturn 0 if a binary attribute is not visible. The\n\t\treturned value will replace static permissions defined\n\t\tin struct bin_attribute. If @is_visible is not set, Use\n\t\tSYSFS_GROUP_VISIBLE() when assigning this callback to\n\t\tspecify separate _group_visible() and _attr_visible()\n\t\thandlers.\n @attrs:\tPointer to NULL terminated list of attributes.\n @bin_attrs:\tPointer to NULL terminated list of binary attributes.\n\t\tEither attrs or bin_attrs or both must be provided."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct attribute_group {
    pub name: *const ::std::os::raw::c_char,
    pub is_visible: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut kobject,
            arg2: *mut attribute,
            arg3: ::std::os::raw::c_int,
        ) -> umode_t,
    >,
    pub is_bin_visible: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut kobject,
            arg2: *mut bin_attribute,
            arg3: ::std::os::raw::c_int,
        ) -> umode_t,
    >,
    pub attrs: *mut *mut attribute,
    pub bin_attrs: *mut *mut bin_attribute,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of attribute_group"][::std::mem::size_of::<attribute_group>() - 40usize];
    ["Alignment of attribute_group"][::std::mem::align_of::<attribute_group>() - 8usize];
    ["Offset of field: attribute_group::name"]
        [::std::mem::offset_of!(attribute_group, name) - 0usize];
    ["Offset of field: attribute_group::is_visible"]
        [::std::mem::offset_of!(attribute_group, is_visible) - 8usize];
    ["Offset of field: attribute_group::is_bin_visible"]
        [::std::mem::offset_of!(attribute_group, is_bin_visible) - 16usize];
    ["Offset of field: attribute_group::attrs"]
        [::std::mem::offset_of!(attribute_group, attrs) - 24usize];
    ["Offset of field: attribute_group::bin_attrs"]
        [::std::mem::offset_of!(attribute_group, bin_attrs) - 32usize];
};
extern "C" {
    pub static arch_node_dev_group: attribute_group;
}
extern "C" {
    pub static mut nr_cpu_ids: ::std::os::raw::c_uint;
}
extern "C" {
    pub static mut __cpu_possible_mask: cpumask;
}
extern "C" {
    pub static mut __cpu_online_mask: cpumask;
}
extern "C" {
    pub static mut __cpu_enabled_mask: cpumask;
}
extern "C" {
    pub static mut __cpu_present_mask: cpumask;
}
extern "C" {
    pub static mut __cpu_active_mask: cpumask;
}
extern "C" {
    pub static mut __cpu_dying_mask: cpumask;
}
extern "C" {
    pub static mut __num_online_cpus: atomic_t;
}
extern "C" {
    pub static mut cpus_booted_once_mask: cpumask_t;
}
extern "C" {
    pub fn cpumask_local_spread(
        i: ::std::os::raw::c_uint,
        node: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn cpumask_any_and_distribute(
        src1p: *const cpumask,
        src2p: *const cpumask,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn cpumask_any_distribute(srcp: *const cpumask) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn cpumask_next_wrap(
        n: ::std::os::raw::c_int,
        mask: *const cpumask,
        start: ::std::os::raw::c_int,
        wrap: bool_,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn alloc_cpumask_var_node(
        mask: *mut cpumask_var_t,
        flags: gfp_t,
        node: ::std::os::raw::c_int,
    ) -> bool_;
}
extern "C" {
    pub fn alloc_bootmem_cpumask_var(mask: *mut cpumask_var_t);
}
extern "C" {
    pub fn free_cpumask_var(mask: cpumask_var_t);
}
extern "C" {
    pub fn free_bootmem_cpumask_var(mask: cpumask_var_t);
}
extern "C" {
    pub static cpu_all_bits: [::std::os::raw::c_ulong; 128usize];
}
extern "C" {
    pub fn init_cpu_present(src: *const cpumask);
}
extern "C" {
    pub fn init_cpu_possible(src: *const cpumask);
}
extern "C" {
    pub fn init_cpu_online(src: *const cpumask);
}
extern "C" {
    pub fn set_cpu_online(cpu: ::std::os::raw::c_uint, online: bool_);
}
extern "C" {
    pub static mut cpu_bit_bitmap: [[::std::os::raw::c_ulong; 128usize]; 65usize];
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct llist_head {
    pub first: *mut llist_node,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of llist_head"][::std::mem::size_of::<llist_head>() - 8usize];
    ["Alignment of llist_head"][::std::mem::align_of::<llist_head>() - 8usize];
    ["Offset of field: llist_head::first"][::std::mem::offset_of!(llist_head, first) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct llist_node {
    pub next: *mut llist_node,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of llist_node"][::std::mem::size_of::<llist_node>() - 8usize];
    ["Alignment of llist_node"][::std::mem::align_of::<llist_node>() - 8usize];
    ["Offset of field: llist_node::next"][::std::mem::offset_of!(llist_node, next) - 0usize];
};
extern "C" {
    pub fn llist_add_batch(
        new_first: *mut llist_node,
        new_last: *mut llist_node,
        head: *mut llist_head,
    ) -> bool_;
}
extern "C" {
    pub fn llist_del_first(head: *mut llist_head) -> *mut llist_node;
}
extern "C" {
    pub fn llist_del_first_this(head: *mut llist_head, this: *mut llist_node) -> bool_;
}
extern "C" {
    pub fn llist_reverse_order(head: *mut llist_node) -> *mut llist_node;
}
pub const CSD_FLAG_LOCK: _bindgen_ty_4 = 1;
pub const IRQ_WORK_PENDING: _bindgen_ty_4 = 1;
pub const IRQ_WORK_BUSY: _bindgen_ty_4 = 2;
pub const IRQ_WORK_LAZY: _bindgen_ty_4 = 4;
pub const IRQ_WORK_HARD_IRQ: _bindgen_ty_4 = 8;
pub const IRQ_WORK_CLAIMED: _bindgen_ty_4 = 3;
pub const CSD_TYPE_ASYNC: _bindgen_ty_4 = 0;
pub const CSD_TYPE_SYNC: _bindgen_ty_4 = 16;
pub const CSD_TYPE_IRQ_WORK: _bindgen_ty_4 = 32;
pub const CSD_TYPE_TTWU: _bindgen_ty_4 = 48;
pub const CSD_FLAG_TYPE_MASK: _bindgen_ty_4 = 240;
pub type _bindgen_ty_4 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __call_single_node {
    pub llist: llist_node,
    pub __bindgen_anon_1: __call_single_node__bindgen_ty_1,
    pub src: u16_,
    pub dst: u16_,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __call_single_node__bindgen_ty_1 {
    pub u_flags: ::std::os::raw::c_uint,
    pub a_flags: atomic_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __call_single_node__bindgen_ty_1"]
        [::std::mem::size_of::<__call_single_node__bindgen_ty_1>() - 4usize];
    ["Alignment of __call_single_node__bindgen_ty_1"]
        [::std::mem::align_of::<__call_single_node__bindgen_ty_1>() - 4usize];
    ["Offset of field: __call_single_node__bindgen_ty_1::u_flags"]
        [::std::mem::offset_of!(__call_single_node__bindgen_ty_1, u_flags) - 0usize];
    ["Offset of field: __call_single_node__bindgen_ty_1::a_flags"]
        [::std::mem::offset_of!(__call_single_node__bindgen_ty_1, a_flags) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __call_single_node"][::std::mem::size_of::<__call_single_node>() - 16usize];
    ["Alignment of __call_single_node"][::std::mem::align_of::<__call_single_node>() - 8usize];
    ["Offset of field: __call_single_node::llist"]
        [::std::mem::offset_of!(__call_single_node, llist) - 0usize];
    ["Offset of field: __call_single_node::src"]
        [::std::mem::offset_of!(__call_single_node, src) - 12usize];
    ["Offset of field: __call_single_node::dst"]
        [::std::mem::offset_of!(__call_single_node, dst) - 14usize];
};
pub type smp_call_func_t =
    ::std::option::Option<unsafe extern "C" fn(info: *mut ::std::os::raw::c_void)>;
pub type smp_cond_func_t = ::std::option::Option<
    unsafe extern "C" fn(cpu: ::std::os::raw::c_int, info: *mut ::std::os::raw::c_void) -> bool_,
>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __call_single_data {
    pub node: __call_single_node,
    pub func: smp_call_func_t,
    pub info: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __call_single_data"][::std::mem::size_of::<__call_single_data>() - 32usize];
    ["Alignment of __call_single_data"][::std::mem::align_of::<__call_single_data>() - 8usize];
    ["Offset of field: __call_single_data::node"]
        [::std::mem::offset_of!(__call_single_data, node) - 0usize];
    ["Offset of field: __call_single_data::func"]
        [::std::mem::offset_of!(__call_single_data, func) - 16usize];
    ["Offset of field: __call_single_data::info"]
        [::std::mem::offset_of!(__call_single_data, info) - 24usize];
};
pub type call_single_data_t = __call_single_data;
extern "C" {
    pub fn __smp_call_single_queue(cpu: ::std::os::raw::c_int, node: *mut llist_node);
}
extern "C" {
    pub static mut total_cpus: ::std::os::raw::c_uint;
}
extern "C" {
    pub fn smp_call_function_single(
        cpuid: ::std::os::raw::c_int,
        func: smp_call_func_t,
        info: *mut ::std::os::raw::c_void,
        wait: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn on_each_cpu_cond_mask(
        cond_func: smp_cond_func_t,
        func: smp_call_func_t,
        info: *mut ::std::os::raw::c_void,
        wait: bool_,
        mask: *const cpumask,
    );
}
extern "C" {
    pub fn smp_call_function_single_async(
        cpu: ::std::os::raw::c_int,
        csd: *mut call_single_data_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn panic_smp_self_stop() -> !;
}
extern "C" {
    pub fn nmi_panic_self_stop(regs: *mut pt_regs) -> !;
}
extern "C" {
    pub fn crash_smp_send_stop();
}
extern "C" {
    pub fn smp_prepare_boot_cpu();
}
extern "C" {
    pub fn preempt_schedule();
}
extern "C" {
    pub fn preempt_schedule_thunk();
}
extern "C" {
    pub fn preempt_schedule_notrace();
}
extern "C" {
    pub fn preempt_schedule_notrace_thunk();
}
extern "C" {
    pub static mut __SCK__preempt_schedule: static_call_key;
}
extern "C" {
    pub fn __SCT__preempt_schedule();
}
extern "C" {
    pub static mut __SCK__preempt_schedule_notrace: static_call_key;
}
extern "C" {
    pub fn __SCT__preempt_schedule_notrace();
}
#[doc = " preempt_ops - notifiers called when a task is preempted and rescheduled\n @sched_in: we're about to be rescheduled:\n    notifier: struct preempt_notifier for the task being scheduled\n    cpu:  cpu we're scheduled on\n @sched_out: we've just been preempted\n    notifier: struct preempt_notifier for the task being preempted\n    next: the task that's kicking us out\n\n Please note that sched_in and out are called under different\n contexts.  sched_out is called with rq lock held and irq disabled\n while sched_in is called without rq lock and irq enabled.  This\n difference is intentional and depended upon by its users."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct preempt_ops {
    pub sched_in: ::std::option::Option<
        unsafe extern "C" fn(notifier: *mut preempt_notifier, cpu: ::std::os::raw::c_int),
    >,
    pub sched_out: ::std::option::Option<
        unsafe extern "C" fn(notifier: *mut preempt_notifier, next: *mut task_struct),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of preempt_ops"][::std::mem::size_of::<preempt_ops>() - 16usize];
    ["Alignment of preempt_ops"][::std::mem::align_of::<preempt_ops>() - 8usize];
    ["Offset of field: preempt_ops::sched_in"]
        [::std::mem::offset_of!(preempt_ops, sched_in) - 0usize];
    ["Offset of field: preempt_ops::sched_out"]
        [::std::mem::offset_of!(preempt_ops, sched_out) - 8usize];
};
#[doc = " preempt_notifier - key for installing preemption notifiers\n @link: internal use\n @ops: defines the notifier functions to be called\n\n Usually used in conjunction with container_of()."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct preempt_notifier {
    pub link: hlist_node,
    pub ops: *mut preempt_ops,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of preempt_notifier"][::std::mem::size_of::<preempt_notifier>() - 24usize];
    ["Alignment of preempt_notifier"][::std::mem::align_of::<preempt_notifier>() - 8usize];
    ["Offset of field: preempt_notifier::link"]
        [::std::mem::offset_of!(preempt_notifier, link) - 0usize];
    ["Offset of field: preempt_notifier::ops"]
        [::std::mem::offset_of!(preempt_notifier, ops) - 16usize];
};
extern "C" {
    pub fn preempt_notifier_inc();
}
extern "C" {
    pub fn preempt_notifier_dec();
}
extern "C" {
    pub fn preempt_notifier_register(notifier: *mut preempt_notifier);
}
extern "C" {
    pub fn preempt_notifier_unregister(notifier: *mut preempt_notifier);
}
extern "C" {
    pub fn migrate_disable();
}
extern "C" {
    pub fn migrate_enable();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct class_preempt_t {
    pub lock: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of class_preempt_t"][::std::mem::size_of::<class_preempt_t>() - 8usize];
    ["Alignment of class_preempt_t"][::std::mem::align_of::<class_preempt_t>() - 8usize];
    ["Offset of field: class_preempt_t::lock"]
        [::std::mem::offset_of!(class_preempt_t, lock) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct class_preempt_notrace_t {
    pub lock: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of class_preempt_notrace_t"][::std::mem::size_of::<class_preempt_notrace_t>() - 8usize];
    ["Alignment of class_preempt_notrace_t"]
        [::std::mem::align_of::<class_preempt_notrace_t>() - 8usize];
    ["Offset of field: class_preempt_notrace_t::lock"]
        [::std::mem::offset_of!(class_preempt_notrace_t, lock) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct class_migrate_t {
    pub lock: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of class_migrate_t"][::std::mem::size_of::<class_migrate_t>() - 8usize];
    ["Alignment of class_migrate_t"][::std::mem::align_of::<class_migrate_t>() - 8usize];
    ["Offset of field: class_migrate_t::lock"]
        [::std::mem::offset_of!(class_migrate_t, lock) - 0usize];
};
extern "C" {
    pub fn preempt_model_none() -> bool_;
}
extern "C" {
    pub fn preempt_model_voluntary() -> bool_;
}
extern "C" {
    pub fn preempt_model_full() -> bool_;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    _unused: [u8; 0],
}
pub const timespec_type_TT_NONE: timespec_type = 0;
pub const timespec_type_TT_NATIVE: timespec_type = 1;
pub const timespec_type_TT_COMPAT: timespec_type = 2;
pub type timespec_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct restart_block {
    pub arch_data: ::std::os::raw::c_ulong,
    pub fn_: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut restart_block) -> ::std::os::raw::c_long,
    >,
    pub __bindgen_anon_1: restart_block__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union restart_block__bindgen_ty_1 {
    pub futex: restart_block__bindgen_ty_1__bindgen_ty_1,
    pub nanosleep: restart_block__bindgen_ty_1__bindgen_ty_2,
    pub poll: restart_block__bindgen_ty_1__bindgen_ty_3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct restart_block__bindgen_ty_1__bindgen_ty_1 {
    pub uaddr: *mut u32_,
    pub val: u32_,
    pub flags: u32_,
    pub bitset: u32_,
    pub time: u64_,
    pub uaddr2: *mut u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of restart_block__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<restart_block__bindgen_ty_1__bindgen_ty_1>() - 40usize];
    ["Alignment of restart_block__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<restart_block__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: restart_block__bindgen_ty_1__bindgen_ty_1::uaddr"]
        [::std::mem::offset_of!(restart_block__bindgen_ty_1__bindgen_ty_1, uaddr) - 0usize];
    ["Offset of field: restart_block__bindgen_ty_1__bindgen_ty_1::val"]
        [::std::mem::offset_of!(restart_block__bindgen_ty_1__bindgen_ty_1, val) - 8usize];
    ["Offset of field: restart_block__bindgen_ty_1__bindgen_ty_1::flags"]
        [::std::mem::offset_of!(restart_block__bindgen_ty_1__bindgen_ty_1, flags) - 12usize];
    ["Offset of field: restart_block__bindgen_ty_1__bindgen_ty_1::bitset"]
        [::std::mem::offset_of!(restart_block__bindgen_ty_1__bindgen_ty_1, bitset) - 16usize];
    ["Offset of field: restart_block__bindgen_ty_1__bindgen_ty_1::time"]
        [::std::mem::offset_of!(restart_block__bindgen_ty_1__bindgen_ty_1, time) - 24usize];
    ["Offset of field: restart_block__bindgen_ty_1__bindgen_ty_1::uaddr2"]
        [::std::mem::offset_of!(restart_block__bindgen_ty_1__bindgen_ty_1, uaddr2) - 32usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct restart_block__bindgen_ty_1__bindgen_ty_2 {
    pub clockid: clockid_t,
    pub type_: timespec_type,
    pub __bindgen_anon_1: restart_block__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1,
    pub expires: u64_,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union restart_block__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1 {
    pub rmtp: *mut __kernel_timespec,
    pub compat_rmtp: *mut old_timespec32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of restart_block__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1"]
        [::std::mem::size_of::<restart_block__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1>() - 8usize];
    ["Alignment of restart_block__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1"][::std::mem::align_of::<
        restart_block__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1,
    >() - 8usize];
    ["Offset of field: restart_block__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1::rmtp"][::std::mem::offset_of!(
        restart_block__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1,
        rmtp
    ) - 0usize];
    ["Offset of field: restart_block__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1::compat_rmtp"][::std::mem::offset_of!(
        restart_block__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1,
        compat_rmtp
    )
        - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of restart_block__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<restart_block__bindgen_ty_1__bindgen_ty_2>() - 24usize];
    ["Alignment of restart_block__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<restart_block__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: restart_block__bindgen_ty_1__bindgen_ty_2::clockid"]
        [::std::mem::offset_of!(restart_block__bindgen_ty_1__bindgen_ty_2, clockid) - 0usize];
    ["Offset of field: restart_block__bindgen_ty_1__bindgen_ty_2::type_"]
        [::std::mem::offset_of!(restart_block__bindgen_ty_1__bindgen_ty_2, type_) - 4usize];
    ["Offset of field: restart_block__bindgen_ty_1__bindgen_ty_2::expires"]
        [::std::mem::offset_of!(restart_block__bindgen_ty_1__bindgen_ty_2, expires) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct restart_block__bindgen_ty_1__bindgen_ty_3 {
    pub ufds: *mut pollfd,
    pub nfds: ::std::os::raw::c_int,
    pub has_timeout: ::std::os::raw::c_int,
    pub tv_sec: ::std::os::raw::c_ulong,
    pub tv_nsec: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of restart_block__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::size_of::<restart_block__bindgen_ty_1__bindgen_ty_3>() - 32usize];
    ["Alignment of restart_block__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::align_of::<restart_block__bindgen_ty_1__bindgen_ty_3>() - 8usize];
    ["Offset of field: restart_block__bindgen_ty_1__bindgen_ty_3::ufds"]
        [::std::mem::offset_of!(restart_block__bindgen_ty_1__bindgen_ty_3, ufds) - 0usize];
    ["Offset of field: restart_block__bindgen_ty_1__bindgen_ty_3::nfds"]
        [::std::mem::offset_of!(restart_block__bindgen_ty_1__bindgen_ty_3, nfds) - 8usize];
    ["Offset of field: restart_block__bindgen_ty_1__bindgen_ty_3::has_timeout"]
        [::std::mem::offset_of!(restart_block__bindgen_ty_1__bindgen_ty_3, has_timeout) - 12usize];
    ["Offset of field: restart_block__bindgen_ty_1__bindgen_ty_3::tv_sec"]
        [::std::mem::offset_of!(restart_block__bindgen_ty_1__bindgen_ty_3, tv_sec) - 16usize];
    ["Offset of field: restart_block__bindgen_ty_1__bindgen_ty_3::tv_nsec"]
        [::std::mem::offset_of!(restart_block__bindgen_ty_1__bindgen_ty_3, tv_nsec) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of restart_block__bindgen_ty_1"]
        [::std::mem::size_of::<restart_block__bindgen_ty_1>() - 40usize];
    ["Alignment of restart_block__bindgen_ty_1"]
        [::std::mem::align_of::<restart_block__bindgen_ty_1>() - 8usize];
    ["Offset of field: restart_block__bindgen_ty_1::futex"]
        [::std::mem::offset_of!(restart_block__bindgen_ty_1, futex) - 0usize];
    ["Offset of field: restart_block__bindgen_ty_1::nanosleep"]
        [::std::mem::offset_of!(restart_block__bindgen_ty_1, nanosleep) - 0usize];
    ["Offset of field: restart_block__bindgen_ty_1::poll"]
        [::std::mem::offset_of!(restart_block__bindgen_ty_1, poll) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of restart_block"][::std::mem::size_of::<restart_block>() - 56usize];
    ["Alignment of restart_block"][::std::mem::align_of::<restart_block>() - 8usize];
    ["Offset of field: restart_block::arch_data"]
        [::std::mem::offset_of!(restart_block, arch_data) - 0usize];
    ["Offset of field: restart_block::fn_"][::std::mem::offset_of!(restart_block, fn_) - 8usize];
};
extern "C" {
    pub fn do_no_restart_syscall(parm: *mut restart_block) -> ::std::os::raw::c_long;
}
pub const BAD_STACK: _bindgen_ty_5 = -1;
pub const NOT_STACK: _bindgen_ty_5 = 0;
pub const GOOD_FRAME: _bindgen_ty_5 = 1;
pub const GOOD_STACK: _bindgen_ty_5 = 2;
pub type _bindgen_ty_5 = ::std::os::raw::c_int;
pub const syscall_work_bit_SYSCALL_WORK_BIT_SECCOMP: syscall_work_bit = 0;
pub const syscall_work_bit_SYSCALL_WORK_BIT_SYSCALL_TRACEPOINT: syscall_work_bit = 1;
pub const syscall_work_bit_SYSCALL_WORK_BIT_SYSCALL_TRACE: syscall_work_bit = 2;
pub const syscall_work_bit_SYSCALL_WORK_BIT_SYSCALL_EMU: syscall_work_bit = 3;
pub const syscall_work_bit_SYSCALL_WORK_BIT_SYSCALL_AUDIT: syscall_work_bit = 4;
pub const syscall_work_bit_SYSCALL_WORK_BIT_SYSCALL_USER_DISPATCH: syscall_work_bit = 5;
pub const syscall_work_bit_SYSCALL_WORK_BIT_SYSCALL_EXIT_TRAP: syscall_work_bit = 6;
pub type syscall_work_bit = ::std::os::raw::c_uint;
#[doc = " @CC_ATTR_MEM_ENCRYPT: Memory encryption is active\n\n The platform/OS is running with active memory encryption. This\n includes running either as a bare-metal system or a hypervisor\n and actively using memory encryption or as a guest/virtual machine\n and actively using memory encryption.\n\n Examples include SME, SEV and SEV-ES."]
pub const cc_attr_CC_ATTR_MEM_ENCRYPT: cc_attr = 0;
#[doc = " @CC_ATTR_HOST_MEM_ENCRYPT: Host memory encryption is active\n\n The platform/OS is running as a bare-metal system or a hypervisor\n and actively using memory encryption.\n\n Examples include SME."]
pub const cc_attr_CC_ATTR_HOST_MEM_ENCRYPT: cc_attr = 1;
#[doc = " @CC_ATTR_GUEST_MEM_ENCRYPT: Guest memory encryption is active\n\n The platform/OS is running as a guest/virtual machine and actively\n using memory encryption.\n\n Examples include SEV and SEV-ES."]
pub const cc_attr_CC_ATTR_GUEST_MEM_ENCRYPT: cc_attr = 2;
#[doc = " @CC_ATTR_GUEST_STATE_ENCRYPT: Guest state encryption is active\n\n The platform/OS is running as a guest/virtual machine and actively\n using memory encryption and register state encryption.\n\n Examples include SEV-ES."]
pub const cc_attr_CC_ATTR_GUEST_STATE_ENCRYPT: cc_attr = 3;
#[doc = " @CC_ATTR_GUEST_UNROLL_STRING_IO: String I/O is implemented with\n                                  IN/OUT instructions\n\n The platform/OS is running as a guest/virtual machine and uses\n IN/OUT instructions in place of string I/O.\n\n Examples include TDX guest & SEV."]
pub const cc_attr_CC_ATTR_GUEST_UNROLL_STRING_IO: cc_attr = 4;
#[doc = " @CC_ATTR_SEV_SNP: Guest SNP is active.\n\n The platform/OS is running as a guest/virtual machine and actively\n using AMD SEV-SNP features."]
pub const cc_attr_CC_ATTR_GUEST_SEV_SNP: cc_attr = 5;
#[doc = " @CC_ATTR_HOST_SEV_SNP: AMD SNP enabled on the host.\n\n The host kernel is running with the necessary features\n enabled to run SEV-SNP guests."]
pub const cc_attr_CC_ATTR_HOST_SEV_SNP: cc_attr = 6;
#[doc = " enum cc_attr - Confidential computing attributes\n\n These attributes represent confidential computing features that are\n currently active."]
pub type cc_attr = ::std::os::raw::c_uint;
extern "C" {
    #[doc = " cc_platform_has() - Checks if the specified cc_attr attribute is active\n @attr: Confidential computing attribute to check\n\n The cc_platform_has() function will return an indicator as to whether the\n specified Confidential Computing attribute is currently active.\n\n Context: Any context\n Return:\n * TRUE  - Specified Confidential Computing attribute is active\n * FALSE - Specified Confidential Computing attribute is not active"]
    pub fn cc_platform_has(attr: cc_attr) -> bool_;
}
extern "C" {
    pub fn cc_platform_set(attr: cc_attr);
}
extern "C" {
    pub fn cc_platform_clear(attr: cc_attr);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct boot_params {
    _unused: [u8; 0],
}
extern "C" {
    pub fn mem_encrypt_init();
}
extern "C" {
    pub fn mem_encrypt_setup_arch();
}
extern "C" {
    pub static mut sme_me_mask: u64_;
}
extern "C" {
    pub static mut sev_status: u64_;
}
extern "C" {
    pub fn sme_encrypt_execute(
        encrypted_kernel_vaddr: ::std::os::raw::c_ulong,
        decrypted_kernel_vaddr: ::std::os::raw::c_ulong,
        kernel_len: ::std::os::raw::c_ulong,
        encryption_wa: ::std::os::raw::c_ulong,
        encryption_pgd: ::std::os::raw::c_ulong,
    );
}
extern "C" {
    pub fn sme_early_encrypt(paddr: resource_size_t, size: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn sme_early_decrypt(paddr: resource_size_t, size: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn sme_map_bootdata(real_mode_data: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn sme_unmap_bootdata(real_mode_data: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn sme_early_init();
}
extern "C" {
    pub fn sme_encrypt_kernel(bp: *mut boot_params);
}
extern "C" {
    pub fn sme_enable(bp: *mut boot_params);
}
extern "C" {
    pub fn early_set_memory_decrypted(
        vaddr: ::std::os::raw::c_ulong,
        size: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn early_set_memory_encrypted(
        vaddr: ::std::os::raw::c_ulong,
        size: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn early_set_mem_enc_dec_hypercall(
        vaddr: ::std::os::raw::c_ulong,
        size: ::std::os::raw::c_ulong,
        enc: bool_,
    );
}
extern "C" {
    pub fn mem_encrypt_free_decrypted_mem();
}
extern "C" {
    pub fn sev_es_init_vc_handling();
}
extern "C" {
    pub fn add_encrypt_protection_map();
}
extern "C" {
    pub static mut __start_bss_decrypted: [::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub static mut __end_bss_decrypted: [::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub static mut __start_bss_decrypted_unused: [::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub fn kaslr_get_random_long(purpose: *const ::std::os::raw::c_char)
        -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn kernel_randomize_memory();
}
extern "C" {
    pub fn init_trampoline_kaslr();
}
extern "C" {
    pub static mut physical_mask: phys_addr_t;
}
extern "C" {
    pub fn devmem_is_allowed(pagenr: ::std::os::raw::c_ulong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub static mut max_low_pfn_mapped: ::std::os::raw::c_ulong;
}
extern "C" {
    pub static mut max_pfn_mapped: ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn pfn_range_is_mapped(
        start_pfn: ::std::os::raw::c_ulong,
        end_pfn: ::std::os::raw::c_ulong,
    ) -> bool_;
}
extern "C" {
    pub fn initmem_init();
}
extern "C" {
    pub static mut max_pfn: ::std::os::raw::c_ulong;
}
extern "C" {
    pub static mut phys_base: ::std::os::raw::c_ulong;
}
extern "C" {
    pub static mut page_offset_base: ::std::os::raw::c_ulong;
}
extern "C" {
    pub static mut vmalloc_base: ::std::os::raw::c_ulong;
}
extern "C" {
    pub static mut vmemmap_base: ::std::os::raw::c_ulong;
}
extern "C" {
    pub static mut physmem_end: ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn clear_page_orig(page: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn clear_page_rep(page: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn clear_page_erms(page: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn copy_page(to: *mut ::std::os::raw::c_void, from: *mut ::std::os::raw::c_void);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct range {
    pub start: u64_,
    pub end: u64_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of range"][::std::mem::size_of::<range>() - 16usize];
    ["Alignment of range"][::std::mem::align_of::<range>() - 8usize];
    ["Offset of field: range::start"][::std::mem::offset_of!(range, start) - 0usize];
    ["Offset of field: range::end"][::std::mem::offset_of!(range, end) - 8usize];
};
extern "C" {
    pub fn add_range(
        range: *mut range,
        az: ::std::os::raw::c_int,
        nr_range: ::std::os::raw::c_int,
        start: u64_,
        end: u64_,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn add_range_with_merge(
        range: *mut range,
        az: ::std::os::raw::c_int,
        nr_range: ::std::os::raw::c_int,
        start: u64_,
        end: u64_,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn subtract_range(range: *mut range, az: ::std::os::raw::c_int, start: u64_, end: u64_);
}
extern "C" {
    pub fn clean_sort_range(range: *mut range, az: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sort_range(range: *mut range, nr_range: ::std::os::raw::c_int);
}
extern "C" {
    pub static mut pfn_mapped: [range; 0usize];
}
extern "C" {
    pub static mut nr_pfn_mapped: ::std::os::raw::c_int;
}
extern "C" {
    pub fn __virt_addr_valid(kaddr: ::std::os::raw::c_ulong) -> bool_;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pfn_t {
    pub val: u64_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pfn_t"][::std::mem::size_of::<pfn_t>() - 8usize];
    ["Alignment of pfn_t"][::std::mem::align_of::<pfn_t>() - 8usize];
    ["Offset of field: pfn_t::val"][::std::mem::offset_of!(pfn_t, val) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct io_bitmap {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vm86 {
    _unused: [u8; 0],
}
extern "C" {
    pub static mut early_idt_handler_array: [[::std::os::raw::c_char; 9usize]; 32usize];
}
extern "C" {
    pub fn early_ignore_irq();
}
extern "C" {
    pub static mut xen_early_idt_handler_array: [[::std::os::raw::c_char; 8usize]; 32usize];
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct fred_cs {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fred_cs"][::std::mem::size_of::<fred_cs>() - 8usize];
    ["Alignment of fred_cs"][::std::mem::align_of::<fred_cs>() - 8usize];
};
impl fred_cs {
    #[inline]
    pub fn cs(&self) -> u64_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u64) }
    }
    #[inline]
    pub fn set_cs(&mut self, val: u64_) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn sl(&self) -> u64_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 2u8) as u64) }
    }
    #[inline]
    pub fn set_sl(&mut self, val: u64_) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn wfe(&self) -> u64_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(18usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_wfe(&mut self, val: u64_) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(18usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(cs: u64_, sl: u64_, wfe: u64_) -> __BindgenBitfieldUnit<[u8; 8usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let cs: u64 = unsafe { ::std::mem::transmute(cs) };
            cs as u64
        });
        __bindgen_bitfield_unit.set(16usize, 2u8, {
            let sl: u64 = unsafe { ::std::mem::transmute(sl) };
            sl as u64
        });
        __bindgen_bitfield_unit.set(18usize, 1u8, {
            let wfe: u64 = unsafe { ::std::mem::transmute(wfe) };
            wfe as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct fred_ss {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fred_ss"][::std::mem::size_of::<fred_ss>() - 8usize];
    ["Alignment of fred_ss"][::std::mem::align_of::<fred_ss>() - 8usize];
};
impl fred_ss {
    #[inline]
    pub fn ss(&self) -> u64_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u64) }
    }
    #[inline]
    pub fn set_ss(&mut self, val: u64_) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn sti(&self) -> u64_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_sti(&mut self, val: u64_) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn swevent(&self) -> u64_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(17usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_swevent(&mut self, val: u64_) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(17usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn nmi(&self) -> u64_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(18usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_nmi(&mut self, val: u64_) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(18usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn vector(&self) -> u64_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(32usize, 8u8) as u64) }
    }
    #[inline]
    pub fn set_vector(&mut self, val: u64_) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(32usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn type_(&self) -> u64_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(48usize, 4u8) as u64) }
    }
    #[inline]
    pub fn set_type(&mut self, val: u64_) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(48usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn enclave(&self) -> u64_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(56usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_enclave(&mut self, val: u64_) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(56usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn lm(&self) -> u64_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(57usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_lm(&mut self, val: u64_) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(57usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn nested(&self) -> u64_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(58usize, 1u8) as u64) }
    }
    #[inline]
    pub fn set_nested(&mut self, val: u64_) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(58usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn insnlen(&self) -> u64_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(60usize, 4u8) as u64) }
    }
    #[inline]
    pub fn set_insnlen(&mut self, val: u64_) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(60usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        ss: u64_,
        sti: u64_,
        swevent: u64_,
        nmi: u64_,
        vector: u64_,
        type_: u64_,
        enclave: u64_,
        lm: u64_,
        nested: u64_,
        insnlen: u64_,
    ) -> __BindgenBitfieldUnit<[u8; 8usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let ss: u64 = unsafe { ::std::mem::transmute(ss) };
            ss as u64
        });
        __bindgen_bitfield_unit.set(16usize, 1u8, {
            let sti: u64 = unsafe { ::std::mem::transmute(sti) };
            sti as u64
        });
        __bindgen_bitfield_unit.set(17usize, 1u8, {
            let swevent: u64 = unsafe { ::std::mem::transmute(swevent) };
            swevent as u64
        });
        __bindgen_bitfield_unit.set(18usize, 1u8, {
            let nmi: u64 = unsafe { ::std::mem::transmute(nmi) };
            nmi as u64
        });
        __bindgen_bitfield_unit.set(32usize, 8u8, {
            let vector: u64 = unsafe { ::std::mem::transmute(vector) };
            vector as u64
        });
        __bindgen_bitfield_unit.set(48usize, 4u8, {
            let type_: u64 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(56usize, 1u8, {
            let enclave: u64 = unsafe { ::std::mem::transmute(enclave) };
            enclave as u64
        });
        __bindgen_bitfield_unit.set(57usize, 1u8, {
            let lm: u64 = unsafe { ::std::mem::transmute(lm) };
            lm as u64
        });
        __bindgen_bitfield_unit.set(58usize, 1u8, {
            let nested: u64 = unsafe { ::std::mem::transmute(nested) };
            nested as u64
        });
        __bindgen_bitfield_unit.set(60usize, 4u8, {
            let insnlen: u64 = unsafe { ::std::mem::transmute(insnlen) };
            insnlen as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pt_regs {
    pub r15: ::std::os::raw::c_ulong,
    pub r14: ::std::os::raw::c_ulong,
    pub r13: ::std::os::raw::c_ulong,
    pub r12: ::std::os::raw::c_ulong,
    pub bp: ::std::os::raw::c_ulong,
    pub bx: ::std::os::raw::c_ulong,
    pub r11: ::std::os::raw::c_ulong,
    pub r10: ::std::os::raw::c_ulong,
    pub r9: ::std::os::raw::c_ulong,
    pub r8: ::std::os::raw::c_ulong,
    pub ax: ::std::os::raw::c_ulong,
    pub cx: ::std::os::raw::c_ulong,
    pub dx: ::std::os::raw::c_ulong,
    pub si: ::std::os::raw::c_ulong,
    pub di: ::std::os::raw::c_ulong,
    pub orig_ax: ::std::os::raw::c_ulong,
    pub ip: ::std::os::raw::c_ulong,
    pub __bindgen_anon_1: pt_regs__bindgen_ty_1,
    pub flags: ::std::os::raw::c_ulong,
    pub sp: ::std::os::raw::c_ulong,
    pub __bindgen_anon_2: pt_regs__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pt_regs__bindgen_ty_1 {
    pub cs: u16_,
    pub csx: u64_,
    pub fred_cs: fred_cs,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pt_regs__bindgen_ty_1"][::std::mem::size_of::<pt_regs__bindgen_ty_1>() - 8usize];
    ["Alignment of pt_regs__bindgen_ty_1"]
        [::std::mem::align_of::<pt_regs__bindgen_ty_1>() - 8usize];
    ["Offset of field: pt_regs__bindgen_ty_1::cs"]
        [::std::mem::offset_of!(pt_regs__bindgen_ty_1, cs) - 0usize];
    ["Offset of field: pt_regs__bindgen_ty_1::csx"]
        [::std::mem::offset_of!(pt_regs__bindgen_ty_1, csx) - 0usize];
    ["Offset of field: pt_regs__bindgen_ty_1::fred_cs"]
        [::std::mem::offset_of!(pt_regs__bindgen_ty_1, fred_cs) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pt_regs__bindgen_ty_2 {
    pub ss: u16_,
    pub ssx: u64_,
    pub fred_ss: fred_ss,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pt_regs__bindgen_ty_2"][::std::mem::size_of::<pt_regs__bindgen_ty_2>() - 8usize];
    ["Alignment of pt_regs__bindgen_ty_2"]
        [::std::mem::align_of::<pt_regs__bindgen_ty_2>() - 8usize];
    ["Offset of field: pt_regs__bindgen_ty_2::ss"]
        [::std::mem::offset_of!(pt_regs__bindgen_ty_2, ss) - 0usize];
    ["Offset of field: pt_regs__bindgen_ty_2::ssx"]
        [::std::mem::offset_of!(pt_regs__bindgen_ty_2, ssx) - 0usize];
    ["Offset of field: pt_regs__bindgen_ty_2::fred_ss"]
        [::std::mem::offset_of!(pt_regs__bindgen_ty_2, fred_ss) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pt_regs"][::std::mem::size_of::<pt_regs>() - 168usize];
    ["Alignment of pt_regs"][::std::mem::align_of::<pt_regs>() - 8usize];
    ["Offset of field: pt_regs::r15"][::std::mem::offset_of!(pt_regs, r15) - 0usize];
    ["Offset of field: pt_regs::r14"][::std::mem::offset_of!(pt_regs, r14) - 8usize];
    ["Offset of field: pt_regs::r13"][::std::mem::offset_of!(pt_regs, r13) - 16usize];
    ["Offset of field: pt_regs::r12"][::std::mem::offset_of!(pt_regs, r12) - 24usize];
    ["Offset of field: pt_regs::bp"][::std::mem::offset_of!(pt_regs, bp) - 32usize];
    ["Offset of field: pt_regs::bx"][::std::mem::offset_of!(pt_regs, bx) - 40usize];
    ["Offset of field: pt_regs::r11"][::std::mem::offset_of!(pt_regs, r11) - 48usize];
    ["Offset of field: pt_regs::r10"][::std::mem::offset_of!(pt_regs, r10) - 56usize];
    ["Offset of field: pt_regs::r9"][::std::mem::offset_of!(pt_regs, r9) - 64usize];
    ["Offset of field: pt_regs::r8"][::std::mem::offset_of!(pt_regs, r8) - 72usize];
    ["Offset of field: pt_regs::ax"][::std::mem::offset_of!(pt_regs, ax) - 80usize];
    ["Offset of field: pt_regs::cx"][::std::mem::offset_of!(pt_regs, cx) - 88usize];
    ["Offset of field: pt_regs::dx"][::std::mem::offset_of!(pt_regs, dx) - 96usize];
    ["Offset of field: pt_regs::si"][::std::mem::offset_of!(pt_regs, si) - 104usize];
    ["Offset of field: pt_regs::di"][::std::mem::offset_of!(pt_regs, di) - 112usize];
    ["Offset of field: pt_regs::orig_ax"][::std::mem::offset_of!(pt_regs, orig_ax) - 120usize];
    ["Offset of field: pt_regs::ip"][::std::mem::offset_of!(pt_regs, ip) - 128usize];
    ["Offset of field: pt_regs::flags"][::std::mem::offset_of!(pt_regs, flags) - 144usize];
    ["Offset of field: pt_regs::sp"][::std::mem::offset_of!(pt_regs, sp) - 152usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct desc_struct {
    pub limit0: u16_,
    pub base0: u16_,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of desc_struct"][::std::mem::size_of::<desc_struct>() - 8usize];
    ["Alignment of desc_struct"][::std::mem::align_of::<desc_struct>() - 1usize];
    ["Offset of field: desc_struct::limit0"][::std::mem::offset_of!(desc_struct, limit0) - 0usize];
    ["Offset of field: desc_struct::base0"][::std::mem::offset_of!(desc_struct, base0) - 2usize];
};
impl desc_struct {
    #[inline]
    pub fn base1(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u16) }
    }
    #[inline]
    pub fn set_base1(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn type_(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 4u8) as u16) }
    }
    #[inline]
    pub fn set_type(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn s(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_s(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn dpl(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_dpl(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn p(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_p(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn limit1(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 4u8) as u16) }
    }
    #[inline]
    pub fn set_limit1(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn avl(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(20usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_avl(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(20usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn l(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(21usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_l(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(21usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn d(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(22usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_d(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(22usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn g(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(23usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_g(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(23usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn base2(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u16) }
    }
    #[inline]
    pub fn set_base2(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        base1: u16_,
        type_: u16_,
        s: u16_,
        dpl: u16_,
        p: u16_,
        limit1: u16_,
        avl: u16_,
        l: u16_,
        d: u16_,
        g: u16_,
        base2: u16_,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let base1: u16 = unsafe { ::std::mem::transmute(base1) };
            base1 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 4u8, {
            let type_: u16 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let s: u16 = unsafe { ::std::mem::transmute(s) };
            s as u64
        });
        __bindgen_bitfield_unit.set(13usize, 2u8, {
            let dpl: u16 = unsafe { ::std::mem::transmute(dpl) };
            dpl as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let p: u16 = unsafe { ::std::mem::transmute(p) };
            p as u64
        });
        __bindgen_bitfield_unit.set(16usize, 4u8, {
            let limit1: u16 = unsafe { ::std::mem::transmute(limit1) };
            limit1 as u64
        });
        __bindgen_bitfield_unit.set(20usize, 1u8, {
            let avl: u16 = unsafe { ::std::mem::transmute(avl) };
            avl as u64
        });
        __bindgen_bitfield_unit.set(21usize, 1u8, {
            let l: u16 = unsafe { ::std::mem::transmute(l) };
            l as u64
        });
        __bindgen_bitfield_unit.set(22usize, 1u8, {
            let d: u16 = unsafe { ::std::mem::transmute(d) };
            d as u64
        });
        __bindgen_bitfield_unit.set(23usize, 1u8, {
            let g: u16 = unsafe { ::std::mem::transmute(g) };
            g as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let base2: u16 = unsafe { ::std::mem::transmute(base2) };
            base2 as u64
        });
        __bindgen_bitfield_unit
    }
}
pub const GATE_INTERRUPT: _bindgen_ty_6 = 14;
pub const GATE_TRAP: _bindgen_ty_6 = 15;
pub const GATE_CALL: _bindgen_ty_6 = 12;
pub const GATE_TASK: _bindgen_ty_6 = 5;
pub type _bindgen_ty_6 = ::std::os::raw::c_uint;
pub const DESC_TSS: _bindgen_ty_7 = 9;
pub const DESC_LDT: _bindgen_ty_7 = 2;
pub const DESCTYPE_S: _bindgen_ty_7 = 16;
pub type _bindgen_ty_7 = ::std::os::raw::c_uint;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ldttss_desc {
    pub limit0: u16_,
    pub base0: u16_,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub base3: u32_,
    pub zero1: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ldttss_desc"][::std::mem::size_of::<ldttss_desc>() - 16usize];
    ["Alignment of ldttss_desc"][::std::mem::align_of::<ldttss_desc>() - 1usize];
    ["Offset of field: ldttss_desc::limit0"][::std::mem::offset_of!(ldttss_desc, limit0) - 0usize];
    ["Offset of field: ldttss_desc::base0"][::std::mem::offset_of!(ldttss_desc, base0) - 2usize];
    ["Offset of field: ldttss_desc::base3"][::std::mem::offset_of!(ldttss_desc, base3) - 8usize];
    ["Offset of field: ldttss_desc::zero1"][::std::mem::offset_of!(ldttss_desc, zero1) - 12usize];
};
impl ldttss_desc {
    #[inline]
    pub fn base1(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u16) }
    }
    #[inline]
    pub fn set_base1(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn type_(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 5u8) as u16) }
    }
    #[inline]
    pub fn set_type(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn dpl(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_dpl(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn p(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_p(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn limit1(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 4u8) as u16) }
    }
    #[inline]
    pub fn set_limit1(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn zero0(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(20usize, 3u8) as u16) }
    }
    #[inline]
    pub fn set_zero0(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(20usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn g(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(23usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_g(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(23usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn base2(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u16) }
    }
    #[inline]
    pub fn set_base2(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        base1: u16_,
        type_: u16_,
        dpl: u16_,
        p: u16_,
        limit1: u16_,
        zero0: u16_,
        g: u16_,
        base2: u16_,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let base1: u16 = unsafe { ::std::mem::transmute(base1) };
            base1 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 5u8, {
            let type_: u16 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(13usize, 2u8, {
            let dpl: u16 = unsafe { ::std::mem::transmute(dpl) };
            dpl as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let p: u16 = unsafe { ::std::mem::transmute(p) };
            p as u64
        });
        __bindgen_bitfield_unit.set(16usize, 4u8, {
            let limit1: u16 = unsafe { ::std::mem::transmute(limit1) };
            limit1 as u64
        });
        __bindgen_bitfield_unit.set(20usize, 3u8, {
            let zero0: u16 = unsafe { ::std::mem::transmute(zero0) };
            zero0 as u64
        });
        __bindgen_bitfield_unit.set(23usize, 1u8, {
            let g: u16 = unsafe { ::std::mem::transmute(g) };
            g as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let base2: u16 = unsafe { ::std::mem::transmute(base2) };
            base2 as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type ldt_desc = ldttss_desc;
pub type tss_desc = ldttss_desc;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct idt_bits {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of idt_bits"][::std::mem::size_of::<idt_bits>() - 2usize];
    ["Alignment of idt_bits"][::std::mem::align_of::<idt_bits>() - 1usize];
};
impl idt_bits {
    #[inline]
    pub fn ist(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 3u8) as u16) }
    }
    #[inline]
    pub fn set_ist(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn zero(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 5u8) as u16) }
    }
    #[inline]
    pub fn set_zero(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn type_(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 5u8) as u16) }
    }
    #[inline]
    pub fn set_type(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn dpl(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_dpl(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn p(&self) -> u16_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_p(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        ist: u16_,
        zero: u16_,
        type_: u16_,
        dpl: u16_,
        p: u16_,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 3u8, {
            let ist: u16 = unsafe { ::std::mem::transmute(ist) };
            ist as u64
        });
        __bindgen_bitfield_unit.set(3usize, 5u8, {
            let zero: u16 = unsafe { ::std::mem::transmute(zero) };
            zero as u64
        });
        __bindgen_bitfield_unit.set(8usize, 5u8, {
            let type_: u16 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(13usize, 2u8, {
            let dpl: u16 = unsafe { ::std::mem::transmute(dpl) };
            dpl as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let p: u16 = unsafe { ::std::mem::transmute(p) };
            p as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct idt_data {
    pub vector: ::std::os::raw::c_uint,
    pub segment: ::std::os::raw::c_uint,
    pub bits: idt_bits,
    pub addr: *const ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of idt_data"][::std::mem::size_of::<idt_data>() - 24usize];
    ["Alignment of idt_data"][::std::mem::align_of::<idt_data>() - 8usize];
    ["Offset of field: idt_data::vector"][::std::mem::offset_of!(idt_data, vector) - 0usize];
    ["Offset of field: idt_data::segment"][::std::mem::offset_of!(idt_data, segment) - 4usize];
    ["Offset of field: idt_data::bits"][::std::mem::offset_of!(idt_data, bits) - 8usize];
    ["Offset of field: idt_data::addr"][::std::mem::offset_of!(idt_data, addr) - 16usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct gate_struct {
    pub offset_low: u16_,
    pub segment: u16_,
    pub bits: idt_bits,
    pub offset_middle: u16_,
    pub offset_high: u32_,
    pub reserved: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gate_struct"][::std::mem::size_of::<gate_struct>() - 16usize];
    ["Alignment of gate_struct"][::std::mem::align_of::<gate_struct>() - 1usize];
    ["Offset of field: gate_struct::offset_low"]
        [::std::mem::offset_of!(gate_struct, offset_low) - 0usize];
    ["Offset of field: gate_struct::segment"]
        [::std::mem::offset_of!(gate_struct, segment) - 2usize];
    ["Offset of field: gate_struct::bits"][::std::mem::offset_of!(gate_struct, bits) - 4usize];
    ["Offset of field: gate_struct::offset_middle"]
        [::std::mem::offset_of!(gate_struct, offset_middle) - 6usize];
    ["Offset of field: gate_struct::offset_high"]
        [::std::mem::offset_of!(gate_struct, offset_high) - 8usize];
    ["Offset of field: gate_struct::reserved"]
        [::std::mem::offset_of!(gate_struct, reserved) - 12usize];
};
pub type gate_desc = gate_struct;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct desc_ptr {
    pub size: ::std::os::raw::c_ushort,
    pub address: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of desc_ptr"][::std::mem::size_of::<desc_ptr>() - 10usize];
    ["Alignment of desc_ptr"][::std::mem::align_of::<desc_ptr>() - 1usize];
    ["Offset of field: desc_ptr::size"][::std::mem::offset_of!(desc_ptr, size) - 0usize];
    ["Offset of field: desc_ptr::address"][::std::mem::offset_of!(desc_ptr, address) - 2usize];
};
pub const page_cache_mode__PAGE_CACHE_MODE_WB: page_cache_mode = 0;
pub const page_cache_mode__PAGE_CACHE_MODE_WC: page_cache_mode = 1;
pub const page_cache_mode__PAGE_CACHE_MODE_UC_MINUS: page_cache_mode = 2;
pub const page_cache_mode__PAGE_CACHE_MODE_UC: page_cache_mode = 3;
pub const page_cache_mode__PAGE_CACHE_MODE_WT: page_cache_mode = 4;
pub const page_cache_mode__PAGE_CACHE_MODE_WP: page_cache_mode = 5;
pub const page_cache_mode__PAGE_CACHE_MODE_NUM: page_cache_mode = 8;
pub type page_cache_mode = ::std::os::raw::c_uint;
pub type pteval_t = ::std::os::raw::c_ulong;
pub type pmdval_t = ::std::os::raw::c_ulong;
pub type pudval_t = ::std::os::raw::c_ulong;
pub type p4dval_t = ::std::os::raw::c_ulong;
pub type pgdval_t = ::std::os::raw::c_ulong;
pub type pgprotval_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pte_t {
    pub pte: pteval_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pte_t"][::std::mem::size_of::<pte_t>() - 8usize];
    ["Alignment of pte_t"][::std::mem::align_of::<pte_t>() - 8usize];
    ["Offset of field: pte_t::pte"][::std::mem::offset_of!(pte_t, pte) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pmd_t {
    pub pmd: pmdval_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pmd_t"][::std::mem::size_of::<pmd_t>() - 8usize];
    ["Alignment of pmd_t"][::std::mem::align_of::<pmd_t>() - 8usize];
    ["Offset of field: pmd_t::pmd"][::std::mem::offset_of!(pmd_t, pmd) - 0usize];
};
extern "C" {
    pub static mut __pgtable_l5_enabled: ::std::os::raw::c_uint;
}
extern "C" {
    pub static mut pgdir_shift: ::std::os::raw::c_uint;
}
extern "C" {
    pub static mut ptrs_per_p4d: ::std::os::raw::c_uint;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pgprot {
    pub pgprot: pgprotval_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pgprot"][::std::mem::size_of::<pgprot>() - 8usize];
    ["Alignment of pgprot"][::std::mem::align_of::<pgprot>() - 8usize];
    ["Offset of field: pgprot::pgprot"][::std::mem::offset_of!(pgprot, pgprot) - 0usize];
};
pub type pgprot_t = pgprot;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pgd_t {
    pub pgd: pgdval_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pgd_t"][::std::mem::size_of::<pgd_t>() - 8usize];
    ["Alignment of pgd_t"][::std::mem::align_of::<pgd_t>() - 8usize];
    ["Offset of field: pgd_t::pgd"][::std::mem::offset_of!(pgd_t, pgd) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct p4d_t {
    pub p4d: p4dval_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of p4d_t"][::std::mem::size_of::<p4d_t>() - 8usize];
    ["Alignment of p4d_t"][::std::mem::align_of::<p4d_t>() - 8usize];
    ["Offset of field: p4d_t::p4d"][::std::mem::offset_of!(p4d_t, p4d) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pud_t {
    pub pud: pudval_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pud_t"][::std::mem::size_of::<pud_t>() - 8usize];
    ["Alignment of pud_t"][::std::mem::align_of::<pud_t>() - 8usize];
    ["Offset of field: pud_t::pud"][::std::mem::offset_of!(pud_t, pud) - 0usize];
};
extern "C" {
    pub fn cachemode2protval(pcm: page_cache_mode) -> ::std::os::raw::c_ulong;
}
pub type pgtable_t = *mut page;
extern "C" {
    pub static mut __supported_pte_mask: pteval_t;
}
extern "C" {
    pub static mut __default_kernel_pte_mask: pteval_t;
}
extern "C" {
    pub fn set_nx();
}
extern "C" {
    pub static mut nx_enabled: ::std::os::raw::c_int;
}
extern "C" {
    pub fn pgprot_writecombine(prot: pgprot_t) -> pgprot_t;
}
extern "C" {
    pub fn pgprot_writethrough(prot: pgprot_t) -> pgprot_t;
}
extern "C" {
    pub fn phys_mem_access_prot(
        file: *mut file,
        pfn: ::std::os::raw::c_ulong,
        size: ::std::os::raw::c_ulong,
        vma_prot: pgprot_t,
    ) -> pgprot_t;
}
extern "C" {
    pub fn set_pte_vaddr(vaddr: ::std::os::raw::c_ulong, pte: pte_t);
}
pub const pg_level_PG_LEVEL_NONE: pg_level = 0;
pub const pg_level_PG_LEVEL_4K: pg_level = 1;
pub const pg_level_PG_LEVEL_2M: pg_level = 2;
pub const pg_level_PG_LEVEL_1G: pg_level = 3;
pub const pg_level_PG_LEVEL_512G: pg_level = 4;
pub const pg_level_PG_LEVEL_256T: pg_level = 5;
pub const pg_level_PG_LEVEL_NUM: pg_level = 6;
pub type pg_level = ::std::os::raw::c_uint;
extern "C" {
    pub fn update_page_count(level: ::std::os::raw::c_int, pages: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn lookup_address(
        address: ::std::os::raw::c_ulong,
        level: *mut ::std::os::raw::c_uint,
    ) -> *mut pte_t;
}
extern "C" {
    pub fn lookup_address_in_pgd(
        pgd: *mut pgd_t,
        address: ::std::os::raw::c_ulong,
        level: *mut ::std::os::raw::c_uint,
    ) -> *mut pte_t;
}
extern "C" {
    pub fn lookup_address_in_pgd_attr(
        pgd: *mut pgd_t,
        address: ::std::os::raw::c_ulong,
        level: *mut ::std::os::raw::c_uint,
        nx: *mut bool_,
        rw: *mut bool_,
    ) -> *mut pte_t;
}
extern "C" {
    pub fn lookup_pmd_address(address: ::std::os::raw::c_ulong) -> *mut pmd_t;
}
extern "C" {
    pub fn slow_virt_to_phys(__address: *mut ::std::os::raw::c_void) -> phys_addr_t;
}
extern "C" {
    pub fn kernel_map_pages_in_pgd(
        pgd: *mut pgd_t,
        pfn: u64_,
        address: ::std::os::raw::c_ulong,
        numpages: ::std::os::raw::c_uint,
        page_flags: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kernel_unmap_pages_in_pgd(
        pgd: *mut pgd_t,
        address: ::std::os::raw::c_ulong,
        numpages: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct orc_entry {
    pub sp_offset: s16,
    pub bp_offset: s16,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of orc_entry"][::std::mem::size_of::<orc_entry>() - 6usize];
    ["Alignment of orc_entry"][::std::mem::align_of::<orc_entry>() - 1usize];
    ["Offset of field: orc_entry::sp_offset"]
        [::std::mem::offset_of!(orc_entry, sp_offset) - 0usize];
    ["Offset of field: orc_entry::bp_offset"]
        [::std::mem::offset_of!(orc_entry, bp_offset) - 2usize];
};
impl orc_entry {
    #[inline]
    pub fn sp_reg(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_sp_reg(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn bp_reg(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_bp_reg(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn type_(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn signal(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_signal(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        sp_reg: ::std::os::raw::c_uint,
        bp_reg: ::std::os::raw::c_uint,
        type_: ::std::os::raw::c_uint,
        signal: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let sp_reg: u32 = unsafe { ::std::mem::transmute(sp_reg) };
            sp_reg as u64
        });
        __bindgen_bitfield_unit.set(4usize, 4u8, {
            let bp_reg: u32 = unsafe { ::std::mem::transmute(bp_reg) };
            bp_reg as u64
        });
        __bindgen_bitfield_unit.set(8usize, 3u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let signal: u32 = unsafe { ::std::mem::transmute(signal) };
            signal as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type retpoline_thunk_t = [u8_; 32usize];
extern "C" {
    pub static mut __x86_indirect_thunk_array: [retpoline_thunk_t; 0usize];
}
extern "C" {
    pub static mut __x86_indirect_call_thunk_array: [retpoline_thunk_t; 0usize];
}
extern "C" {
    pub static mut __x86_indirect_jump_thunk_array: [retpoline_thunk_t; 0usize];
}
extern "C" {
    pub fn __x86_return_thunk();
}
extern "C" {
    pub fn retbleed_return_thunk();
}
extern "C" {
    pub fn srso_alias_untrain_ret();
}
extern "C" {
    pub fn srso_return_thunk();
}
extern "C" {
    pub fn srso_alias_return_thunk();
}
extern "C" {
    pub fn entry_untrain_ret();
}
extern "C" {
    pub fn entry_ibpb();
}
extern "C" {
    pub fn clear_bhb_loop();
}
extern "C" {
    pub static mut x86_return_thunk: ::std::option::Option<unsafe extern "C" fn()>;
}
extern "C" {
    pub fn __warn_thunk();
}
extern "C" {
    pub fn call_depth_return_thunk();
}
extern "C" {
    pub static mut __x86_indirect_thunk_rax: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_thunk_rcx: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_thunk_rdx: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_thunk_rbx: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_thunk_rsp: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_thunk_rbp: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_thunk_rsi: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_thunk_rdi: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_thunk_r8: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_thunk_r9: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_thunk_r10: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_thunk_r11: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_thunk_r12: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_thunk_r13: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_thunk_r14: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_thunk_r15: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_call_thunk_rax: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_call_thunk_rcx: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_call_thunk_rdx: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_call_thunk_rbx: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_call_thunk_rsp: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_call_thunk_rbp: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_call_thunk_rsi: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_call_thunk_rdi: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_call_thunk_r8: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_call_thunk_r9: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_call_thunk_r10: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_call_thunk_r11: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_call_thunk_r12: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_call_thunk_r13: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_call_thunk_r14: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_call_thunk_r15: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_jump_thunk_rax: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_jump_thunk_rcx: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_jump_thunk_rdx: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_jump_thunk_rbx: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_jump_thunk_rsp: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_jump_thunk_rbp: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_jump_thunk_rsi: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_jump_thunk_rdi: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_jump_thunk_r8: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_jump_thunk_r9: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_jump_thunk_r10: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_jump_thunk_r11: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_jump_thunk_r12: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_jump_thunk_r13: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_jump_thunk_r14: retpoline_thunk_t;
}
extern "C" {
    pub static mut __x86_indirect_jump_thunk_r15: retpoline_thunk_t;
}
pub const spectre_v2_mitigation_SPECTRE_V2_NONE: spectre_v2_mitigation = 0;
pub const spectre_v2_mitigation_SPECTRE_V2_RETPOLINE: spectre_v2_mitigation = 1;
pub const spectre_v2_mitigation_SPECTRE_V2_LFENCE: spectre_v2_mitigation = 2;
pub const spectre_v2_mitigation_SPECTRE_V2_EIBRS: spectre_v2_mitigation = 3;
pub const spectre_v2_mitigation_SPECTRE_V2_EIBRS_RETPOLINE: spectre_v2_mitigation = 4;
pub const spectre_v2_mitigation_SPECTRE_V2_EIBRS_LFENCE: spectre_v2_mitigation = 5;
pub const spectre_v2_mitigation_SPECTRE_V2_IBRS: spectre_v2_mitigation = 6;
pub type spectre_v2_mitigation = ::std::os::raw::c_uint;
pub const spectre_v2_user_mitigation_SPECTRE_V2_USER_NONE: spectre_v2_user_mitigation = 0;
pub const spectre_v2_user_mitigation_SPECTRE_V2_USER_STRICT: spectre_v2_user_mitigation = 1;
pub const spectre_v2_user_mitigation_SPECTRE_V2_USER_STRICT_PREFERRED: spectre_v2_user_mitigation =
    2;
pub const spectre_v2_user_mitigation_SPECTRE_V2_USER_PRCTL: spectre_v2_user_mitigation = 3;
pub const spectre_v2_user_mitigation_SPECTRE_V2_USER_SECCOMP: spectre_v2_user_mitigation = 4;
pub type spectre_v2_user_mitigation = ::std::os::raw::c_uint;
pub const ssb_mitigation_SPEC_STORE_BYPASS_NONE: ssb_mitigation = 0;
pub const ssb_mitigation_SPEC_STORE_BYPASS_DISABLE: ssb_mitigation = 1;
pub const ssb_mitigation_SPEC_STORE_BYPASS_PRCTL: ssb_mitigation = 2;
pub const ssb_mitigation_SPEC_STORE_BYPASS_SECCOMP: ssb_mitigation = 3;
pub type ssb_mitigation = ::std::os::raw::c_uint;
extern "C" {
    pub static mut x86_pred_cmd: u64_;
}
extern "C" {
    pub static mut x86_spec_ctrl_base: u64_;
}
extern "C" {
    pub static mut x86_spec_ctrl_current: ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn update_spec_ctrl_cond(val: u64_);
}
extern "C" {
    pub fn spec_ctrl_current() -> u64_;
}
extern "C" {
    pub static mut switch_to_cond_stibp: static_key_false;
}
extern "C" {
    pub static mut switch_mm_cond_ibpb: static_key_false;
}
extern "C" {
    pub static mut switch_mm_always_ibpb: static_key_false;
}
extern "C" {
    pub static mut mds_idle_clear: static_key_false;
}
extern "C" {
    pub static mut switch_mm_cond_l1d_flush: static_key_false;
}
extern "C" {
    pub static mut mmio_stale_data_clear: static_key_false;
}
extern "C" {
    pub static mut mds_verw_sel: u16_;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mmu_gather {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct paravirt_callee_save {
    pub func: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of paravirt_callee_save"][::std::mem::size_of::<paravirt_callee_save>() - 8usize];
    ["Alignment of paravirt_callee_save"][::std::mem::align_of::<paravirt_callee_save>() - 8usize];
    ["Offset of field: paravirt_callee_save::func"]
        [::std::mem::offset_of!(paravirt_callee_save, func) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pv_info {
    pub extra_user_64bit_cs: u16_,
    pub name: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pv_info"][::std::mem::size_of::<pv_info>() - 16usize];
    ["Alignment of pv_info"][::std::mem::align_of::<pv_info>() - 8usize];
    ["Offset of field: pv_info::extra_user_64bit_cs"]
        [::std::mem::offset_of!(pv_info, extra_user_64bit_cs) - 0usize];
    ["Offset of field: pv_info::name"][::std::mem::offset_of!(pv_info, name) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pv_lazy_ops {
    pub enter: ::std::option::Option<unsafe extern "C" fn()>,
    pub leave: ::std::option::Option<unsafe extern "C" fn()>,
    pub flush: ::std::option::Option<unsafe extern "C" fn()>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pv_lazy_ops"][::std::mem::size_of::<pv_lazy_ops>() - 24usize];
    ["Alignment of pv_lazy_ops"][::std::mem::align_of::<pv_lazy_ops>() - 8usize];
    ["Offset of field: pv_lazy_ops::enter"][::std::mem::offset_of!(pv_lazy_ops, enter) - 0usize];
    ["Offset of field: pv_lazy_ops::leave"][::std::mem::offset_of!(pv_lazy_ops, leave) - 8usize];
    ["Offset of field: pv_lazy_ops::flush"][::std::mem::offset_of!(pv_lazy_ops, flush) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pv_cpu_ops {
    pub io_delay: ::std::option::Option<unsafe extern "C" fn()>,
    pub get_debugreg: ::std::option::Option<
        unsafe extern "C" fn(regno: ::std::os::raw::c_int) -> ::std::os::raw::c_ulong,
    >,
    pub set_debugreg: ::std::option::Option<
        unsafe extern "C" fn(regno: ::std::os::raw::c_int, value: ::std::os::raw::c_ulong),
    >,
    pub read_cr0: ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_ulong>,
    pub write_cr0: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_ulong)>,
    pub write_cr4: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_ulong)>,
    pub load_tr_desc: ::std::option::Option<unsafe extern "C" fn()>,
    pub load_gdt: ::std::option::Option<unsafe extern "C" fn(arg1: *const desc_ptr)>,
    pub load_idt: ::std::option::Option<unsafe extern "C" fn(arg1: *const desc_ptr)>,
    pub set_ldt: ::std::option::Option<
        unsafe extern "C" fn(desc: *const ::std::os::raw::c_void, entries: ::std::os::raw::c_uint),
    >,
    pub store_tr: ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_ulong>,
    pub load_tls: ::std::option::Option<
        unsafe extern "C" fn(t: *mut thread_struct, cpu: ::std::os::raw::c_uint),
    >,
    pub load_gs_index: ::std::option::Option<unsafe extern "C" fn(idx: ::std::os::raw::c_uint)>,
    pub write_ldt_entry: ::std::option::Option<
        unsafe extern "C" fn(
            ldt: *mut desc_struct,
            entrynum: ::std::os::raw::c_int,
            desc: *const ::std::os::raw::c_void,
        ),
    >,
    pub write_gdt_entry: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut desc_struct,
            entrynum: ::std::os::raw::c_int,
            desc: *const ::std::os::raw::c_void,
            size: ::std::os::raw::c_int,
        ),
    >,
    pub write_idt_entry: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut gate_desc,
            entrynum: ::std::os::raw::c_int,
            gate: *const gate_desc,
        ),
    >,
    pub alloc_ldt: ::std::option::Option<
        unsafe extern "C" fn(ldt: *mut desc_struct, entries: ::std::os::raw::c_uint),
    >,
    pub free_ldt: ::std::option::Option<
        unsafe extern "C" fn(ldt: *mut desc_struct, entries: ::std::os::raw::c_uint),
    >,
    pub load_sp0: ::std::option::Option<unsafe extern "C" fn(sp0: ::std::os::raw::c_ulong)>,
    pub invalidate_io_bitmap: ::std::option::Option<unsafe extern "C" fn()>,
    pub update_io_bitmap: ::std::option::Option<unsafe extern "C" fn()>,
    pub wbinvd: ::std::option::Option<unsafe extern "C" fn()>,
    pub cpuid: ::std::option::Option<
        unsafe extern "C" fn(
            eax: *mut ::std::os::raw::c_uint,
            ebx: *mut ::std::os::raw::c_uint,
            ecx: *mut ::std::os::raw::c_uint,
            edx: *mut ::std::os::raw::c_uint,
        ),
    >,
    pub read_msr: ::std::option::Option<unsafe extern "C" fn(msr: ::std::os::raw::c_uint) -> u64_>,
    pub write_msr: ::std::option::Option<
        unsafe extern "C" fn(
            msr: ::std::os::raw::c_uint,
            low: ::std::os::raw::c_uint,
            high: ::std::os::raw::c_uint,
        ),
    >,
    pub read_msr_safe: ::std::option::Option<
        unsafe extern "C" fn(msr: ::std::os::raw::c_uint, err: *mut ::std::os::raw::c_int) -> u64_,
    >,
    pub write_msr_safe: ::std::option::Option<
        unsafe extern "C" fn(
            msr: ::std::os::raw::c_uint,
            low: ::std::os::raw::c_uint,
            high: ::std::os::raw::c_uint,
        ) -> ::std::os::raw::c_int,
    >,
    pub read_pmc:
        ::std::option::Option<unsafe extern "C" fn(counter: ::std::os::raw::c_int) -> u64_>,
    pub start_context_switch: ::std::option::Option<unsafe extern "C" fn(prev: *mut task_struct)>,
    pub end_context_switch: ::std::option::Option<unsafe extern "C" fn(next: *mut task_struct)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pv_cpu_ops"][::std::mem::size_of::<pv_cpu_ops>() - 240usize];
    ["Alignment of pv_cpu_ops"][::std::mem::align_of::<pv_cpu_ops>() - 8usize];
    ["Offset of field: pv_cpu_ops::io_delay"]
        [::std::mem::offset_of!(pv_cpu_ops, io_delay) - 0usize];
    ["Offset of field: pv_cpu_ops::get_debugreg"]
        [::std::mem::offset_of!(pv_cpu_ops, get_debugreg) - 8usize];
    ["Offset of field: pv_cpu_ops::set_debugreg"]
        [::std::mem::offset_of!(pv_cpu_ops, set_debugreg) - 16usize];
    ["Offset of field: pv_cpu_ops::read_cr0"]
        [::std::mem::offset_of!(pv_cpu_ops, read_cr0) - 24usize];
    ["Offset of field: pv_cpu_ops::write_cr0"]
        [::std::mem::offset_of!(pv_cpu_ops, write_cr0) - 32usize];
    ["Offset of field: pv_cpu_ops::write_cr4"]
        [::std::mem::offset_of!(pv_cpu_ops, write_cr4) - 40usize];
    ["Offset of field: pv_cpu_ops::load_tr_desc"]
        [::std::mem::offset_of!(pv_cpu_ops, load_tr_desc) - 48usize];
    ["Offset of field: pv_cpu_ops::load_gdt"]
        [::std::mem::offset_of!(pv_cpu_ops, load_gdt) - 56usize];
    ["Offset of field: pv_cpu_ops::load_idt"]
        [::std::mem::offset_of!(pv_cpu_ops, load_idt) - 64usize];
    ["Offset of field: pv_cpu_ops::set_ldt"][::std::mem::offset_of!(pv_cpu_ops, set_ldt) - 72usize];
    ["Offset of field: pv_cpu_ops::store_tr"]
        [::std::mem::offset_of!(pv_cpu_ops, store_tr) - 80usize];
    ["Offset of field: pv_cpu_ops::load_tls"]
        [::std::mem::offset_of!(pv_cpu_ops, load_tls) - 88usize];
    ["Offset of field: pv_cpu_ops::load_gs_index"]
        [::std::mem::offset_of!(pv_cpu_ops, load_gs_index) - 96usize];
    ["Offset of field: pv_cpu_ops::write_ldt_entry"]
        [::std::mem::offset_of!(pv_cpu_ops, write_ldt_entry) - 104usize];
    ["Offset of field: pv_cpu_ops::write_gdt_entry"]
        [::std::mem::offset_of!(pv_cpu_ops, write_gdt_entry) - 112usize];
    ["Offset of field: pv_cpu_ops::write_idt_entry"]
        [::std::mem::offset_of!(pv_cpu_ops, write_idt_entry) - 120usize];
    ["Offset of field: pv_cpu_ops::alloc_ldt"]
        [::std::mem::offset_of!(pv_cpu_ops, alloc_ldt) - 128usize];
    ["Offset of field: pv_cpu_ops::free_ldt"]
        [::std::mem::offset_of!(pv_cpu_ops, free_ldt) - 136usize];
    ["Offset of field: pv_cpu_ops::load_sp0"]
        [::std::mem::offset_of!(pv_cpu_ops, load_sp0) - 144usize];
    ["Offset of field: pv_cpu_ops::invalidate_io_bitmap"]
        [::std::mem::offset_of!(pv_cpu_ops, invalidate_io_bitmap) - 152usize];
    ["Offset of field: pv_cpu_ops::update_io_bitmap"]
        [::std::mem::offset_of!(pv_cpu_ops, update_io_bitmap) - 160usize];
    ["Offset of field: pv_cpu_ops::wbinvd"][::std::mem::offset_of!(pv_cpu_ops, wbinvd) - 168usize];
    ["Offset of field: pv_cpu_ops::cpuid"][::std::mem::offset_of!(pv_cpu_ops, cpuid) - 176usize];
    ["Offset of field: pv_cpu_ops::read_msr"]
        [::std::mem::offset_of!(pv_cpu_ops, read_msr) - 184usize];
    ["Offset of field: pv_cpu_ops::write_msr"]
        [::std::mem::offset_of!(pv_cpu_ops, write_msr) - 192usize];
    ["Offset of field: pv_cpu_ops::read_msr_safe"]
        [::std::mem::offset_of!(pv_cpu_ops, read_msr_safe) - 200usize];
    ["Offset of field: pv_cpu_ops::write_msr_safe"]
        [::std::mem::offset_of!(pv_cpu_ops, write_msr_safe) - 208usize];
    ["Offset of field: pv_cpu_ops::read_pmc"]
        [::std::mem::offset_of!(pv_cpu_ops, read_pmc) - 216usize];
    ["Offset of field: pv_cpu_ops::start_context_switch"]
        [::std::mem::offset_of!(pv_cpu_ops, start_context_switch) - 224usize];
    ["Offset of field: pv_cpu_ops::end_context_switch"]
        [::std::mem::offset_of!(pv_cpu_ops, end_context_switch) - 232usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pv_irq_ops {
    pub save_fl: paravirt_callee_save,
    pub irq_disable: paravirt_callee_save,
    pub irq_enable: paravirt_callee_save,
    pub safe_halt: ::std::option::Option<unsafe extern "C" fn()>,
    pub halt: ::std::option::Option<unsafe extern "C" fn()>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pv_irq_ops"][::std::mem::size_of::<pv_irq_ops>() - 40usize];
    ["Alignment of pv_irq_ops"][::std::mem::align_of::<pv_irq_ops>() - 8usize];
    ["Offset of field: pv_irq_ops::save_fl"][::std::mem::offset_of!(pv_irq_ops, save_fl) - 0usize];
    ["Offset of field: pv_irq_ops::irq_disable"]
        [::std::mem::offset_of!(pv_irq_ops, irq_disable) - 8usize];
    ["Offset of field: pv_irq_ops::irq_enable"]
        [::std::mem::offset_of!(pv_irq_ops, irq_enable) - 16usize];
    ["Offset of field: pv_irq_ops::safe_halt"]
        [::std::mem::offset_of!(pv_irq_ops, safe_halt) - 24usize];
    ["Offset of field: pv_irq_ops::halt"][::std::mem::offset_of!(pv_irq_ops, halt) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pv_mmu_ops {
    pub flush_tlb_user: ::std::option::Option<unsafe extern "C" fn()>,
    pub flush_tlb_kernel: ::std::option::Option<unsafe extern "C" fn()>,
    pub flush_tlb_one_user:
        ::std::option::Option<unsafe extern "C" fn(addr: ::std::os::raw::c_ulong)>,
    pub flush_tlb_multi: ::std::option::Option<
        unsafe extern "C" fn(cpus: *const cpumask, info: *const flush_tlb_info),
    >,
    pub tlb_remove_table: ::std::option::Option<
        unsafe extern "C" fn(tlb: *mut mmu_gather, table: *mut ::std::os::raw::c_void),
    >,
    pub exit_mmap: ::std::option::Option<unsafe extern "C" fn(mm: *mut mm_struct)>,
    pub notify_page_enc_status_changed: ::std::option::Option<
        unsafe extern "C" fn(
            pfn: ::std::os::raw::c_ulong,
            npages: ::std::os::raw::c_int,
            enc: bool_,
        ),
    >,
    pub read_cr2: paravirt_callee_save,
    pub write_cr2: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_ulong)>,
    pub read_cr3: ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_ulong>,
    pub write_cr3: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_ulong)>,
    pub enter_mmap: ::std::option::Option<unsafe extern "C" fn(mm: *mut mm_struct)>,
    pub pgd_alloc:
        ::std::option::Option<unsafe extern "C" fn(mm: *mut mm_struct) -> ::std::os::raw::c_int>,
    pub pgd_free: ::std::option::Option<unsafe extern "C" fn(mm: *mut mm_struct, pgd: *mut pgd_t)>,
    pub alloc_pte: ::std::option::Option<
        unsafe extern "C" fn(mm: *mut mm_struct, pfn: ::std::os::raw::c_ulong),
    >,
    pub alloc_pmd: ::std::option::Option<
        unsafe extern "C" fn(mm: *mut mm_struct, pfn: ::std::os::raw::c_ulong),
    >,
    pub alloc_pud: ::std::option::Option<
        unsafe extern "C" fn(mm: *mut mm_struct, pfn: ::std::os::raw::c_ulong),
    >,
    pub alloc_p4d: ::std::option::Option<
        unsafe extern "C" fn(mm: *mut mm_struct, pfn: ::std::os::raw::c_ulong),
    >,
    pub release_pte: ::std::option::Option<unsafe extern "C" fn(pfn: ::std::os::raw::c_ulong)>,
    pub release_pmd: ::std::option::Option<unsafe extern "C" fn(pfn: ::std::os::raw::c_ulong)>,
    pub release_pud: ::std::option::Option<unsafe extern "C" fn(pfn: ::std::os::raw::c_ulong)>,
    pub release_p4d: ::std::option::Option<unsafe extern "C" fn(pfn: ::std::os::raw::c_ulong)>,
    pub set_pte: ::std::option::Option<unsafe extern "C" fn(ptep: *mut pte_t, pteval: pte_t)>,
    pub set_pmd: ::std::option::Option<unsafe extern "C" fn(pmdp: *mut pmd_t, pmdval: pmd_t)>,
    pub ptep_modify_prot_start: ::std::option::Option<
        unsafe extern "C" fn(
            vma: *mut vm_area_struct,
            addr: ::std::os::raw::c_ulong,
            ptep: *mut pte_t,
        ) -> pte_t,
    >,
    pub ptep_modify_prot_commit: ::std::option::Option<
        unsafe extern "C" fn(
            vma: *mut vm_area_struct,
            addr: ::std::os::raw::c_ulong,
            ptep: *mut pte_t,
            pte: pte_t,
        ),
    >,
    pub pte_val: paravirt_callee_save,
    pub make_pte: paravirt_callee_save,
    pub pgd_val: paravirt_callee_save,
    pub make_pgd: paravirt_callee_save,
    pub set_pud: ::std::option::Option<unsafe extern "C" fn(pudp: *mut pud_t, pudval: pud_t)>,
    pub pmd_val: paravirt_callee_save,
    pub make_pmd: paravirt_callee_save,
    pub pud_val: paravirt_callee_save,
    pub make_pud: paravirt_callee_save,
    pub set_p4d: ::std::option::Option<unsafe extern "C" fn(p4dp: *mut p4d_t, p4dval: p4d_t)>,
    pub p4d_val: paravirt_callee_save,
    pub make_p4d: paravirt_callee_save,
    pub set_pgd: ::std::option::Option<unsafe extern "C" fn(pgdp: *mut pgd_t, pgdval: pgd_t)>,
    pub lazy_mode: pv_lazy_ops,
    pub set_fixmap: ::std::option::Option<
        unsafe extern "C" fn(idx: ::std::os::raw::c_uint, phys: phys_addr_t, flags: pgprot_t),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pv_mmu_ops"][::std::mem::size_of::<pv_mmu_ops>() - 344usize];
    ["Alignment of pv_mmu_ops"][::std::mem::align_of::<pv_mmu_ops>() - 8usize];
    ["Offset of field: pv_mmu_ops::flush_tlb_user"]
        [::std::mem::offset_of!(pv_mmu_ops, flush_tlb_user) - 0usize];
    ["Offset of field: pv_mmu_ops::flush_tlb_kernel"]
        [::std::mem::offset_of!(pv_mmu_ops, flush_tlb_kernel) - 8usize];
    ["Offset of field: pv_mmu_ops::flush_tlb_one_user"]
        [::std::mem::offset_of!(pv_mmu_ops, flush_tlb_one_user) - 16usize];
    ["Offset of field: pv_mmu_ops::flush_tlb_multi"]
        [::std::mem::offset_of!(pv_mmu_ops, flush_tlb_multi) - 24usize];
    ["Offset of field: pv_mmu_ops::tlb_remove_table"]
        [::std::mem::offset_of!(pv_mmu_ops, tlb_remove_table) - 32usize];
    ["Offset of field: pv_mmu_ops::exit_mmap"]
        [::std::mem::offset_of!(pv_mmu_ops, exit_mmap) - 40usize];
    ["Offset of field: pv_mmu_ops::notify_page_enc_status_changed"]
        [::std::mem::offset_of!(pv_mmu_ops, notify_page_enc_status_changed) - 48usize];
    ["Offset of field: pv_mmu_ops::read_cr2"]
        [::std::mem::offset_of!(pv_mmu_ops, read_cr2) - 56usize];
    ["Offset of field: pv_mmu_ops::write_cr2"]
        [::std::mem::offset_of!(pv_mmu_ops, write_cr2) - 64usize];
    ["Offset of field: pv_mmu_ops::read_cr3"]
        [::std::mem::offset_of!(pv_mmu_ops, read_cr3) - 72usize];
    ["Offset of field: pv_mmu_ops::write_cr3"]
        [::std::mem::offset_of!(pv_mmu_ops, write_cr3) - 80usize];
    ["Offset of field: pv_mmu_ops::enter_mmap"]
        [::std::mem::offset_of!(pv_mmu_ops, enter_mmap) - 88usize];
    ["Offset of field: pv_mmu_ops::pgd_alloc"]
        [::std::mem::offset_of!(pv_mmu_ops, pgd_alloc) - 96usize];
    ["Offset of field: pv_mmu_ops::pgd_free"]
        [::std::mem::offset_of!(pv_mmu_ops, pgd_free) - 104usize];
    ["Offset of field: pv_mmu_ops::alloc_pte"]
        [::std::mem::offset_of!(pv_mmu_ops, alloc_pte) - 112usize];
    ["Offset of field: pv_mmu_ops::alloc_pmd"]
        [::std::mem::offset_of!(pv_mmu_ops, alloc_pmd) - 120usize];
    ["Offset of field: pv_mmu_ops::alloc_pud"]
        [::std::mem::offset_of!(pv_mmu_ops, alloc_pud) - 128usize];
    ["Offset of field: pv_mmu_ops::alloc_p4d"]
        [::std::mem::offset_of!(pv_mmu_ops, alloc_p4d) - 136usize];
    ["Offset of field: pv_mmu_ops::release_pte"]
        [::std::mem::offset_of!(pv_mmu_ops, release_pte) - 144usize];
    ["Offset of field: pv_mmu_ops::release_pmd"]
        [::std::mem::offset_of!(pv_mmu_ops, release_pmd) - 152usize];
    ["Offset of field: pv_mmu_ops::release_pud"]
        [::std::mem::offset_of!(pv_mmu_ops, release_pud) - 160usize];
    ["Offset of field: pv_mmu_ops::release_p4d"]
        [::std::mem::offset_of!(pv_mmu_ops, release_p4d) - 168usize];
    ["Offset of field: pv_mmu_ops::set_pte"]
        [::std::mem::offset_of!(pv_mmu_ops, set_pte) - 176usize];
    ["Offset of field: pv_mmu_ops::set_pmd"]
        [::std::mem::offset_of!(pv_mmu_ops, set_pmd) - 184usize];
    ["Offset of field: pv_mmu_ops::ptep_modify_prot_start"]
        [::std::mem::offset_of!(pv_mmu_ops, ptep_modify_prot_start) - 192usize];
    ["Offset of field: pv_mmu_ops::ptep_modify_prot_commit"]
        [::std::mem::offset_of!(pv_mmu_ops, ptep_modify_prot_commit) - 200usize];
    ["Offset of field: pv_mmu_ops::pte_val"]
        [::std::mem::offset_of!(pv_mmu_ops, pte_val) - 208usize];
    ["Offset of field: pv_mmu_ops::make_pte"]
        [::std::mem::offset_of!(pv_mmu_ops, make_pte) - 216usize];
    ["Offset of field: pv_mmu_ops::pgd_val"]
        [::std::mem::offset_of!(pv_mmu_ops, pgd_val) - 224usize];
    ["Offset of field: pv_mmu_ops::make_pgd"]
        [::std::mem::offset_of!(pv_mmu_ops, make_pgd) - 232usize];
    ["Offset of field: pv_mmu_ops::set_pud"]
        [::std::mem::offset_of!(pv_mmu_ops, set_pud) - 240usize];
    ["Offset of field: pv_mmu_ops::pmd_val"]
        [::std::mem::offset_of!(pv_mmu_ops, pmd_val) - 248usize];
    ["Offset of field: pv_mmu_ops::make_pmd"]
        [::std::mem::offset_of!(pv_mmu_ops, make_pmd) - 256usize];
    ["Offset of field: pv_mmu_ops::pud_val"]
        [::std::mem::offset_of!(pv_mmu_ops, pud_val) - 264usize];
    ["Offset of field: pv_mmu_ops::make_pud"]
        [::std::mem::offset_of!(pv_mmu_ops, make_pud) - 272usize];
    ["Offset of field: pv_mmu_ops::set_p4d"]
        [::std::mem::offset_of!(pv_mmu_ops, set_p4d) - 280usize];
    ["Offset of field: pv_mmu_ops::p4d_val"]
        [::std::mem::offset_of!(pv_mmu_ops, p4d_val) - 288usize];
    ["Offset of field: pv_mmu_ops::make_p4d"]
        [::std::mem::offset_of!(pv_mmu_ops, make_p4d) - 296usize];
    ["Offset of field: pv_mmu_ops::set_pgd"]
        [::std::mem::offset_of!(pv_mmu_ops, set_pgd) - 304usize];
    ["Offset of field: pv_mmu_ops::lazy_mode"]
        [::std::mem::offset_of!(pv_mmu_ops, lazy_mode) - 312usize];
    ["Offset of field: pv_mmu_ops::set_fixmap"]
        [::std::mem::offset_of!(pv_mmu_ops, set_fixmap) - 336usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct arch_spinlock {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pv_lock_ops {
    pub queued_spin_lock_slowpath:
        ::std::option::Option<unsafe extern "C" fn(lock: *mut qspinlock, val: u32_)>,
    pub queued_spin_unlock: paravirt_callee_save,
    pub wait: ::std::option::Option<unsafe extern "C" fn(ptr: *mut u8_, val: u8_)>,
    pub kick: ::std::option::Option<unsafe extern "C" fn(cpu: ::std::os::raw::c_int)>,
    pub vcpu_is_preempted: paravirt_callee_save,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pv_lock_ops"][::std::mem::size_of::<pv_lock_ops>() - 40usize];
    ["Alignment of pv_lock_ops"][::std::mem::align_of::<pv_lock_ops>() - 8usize];
    ["Offset of field: pv_lock_ops::queued_spin_lock_slowpath"]
        [::std::mem::offset_of!(pv_lock_ops, queued_spin_lock_slowpath) - 0usize];
    ["Offset of field: pv_lock_ops::queued_spin_unlock"]
        [::std::mem::offset_of!(pv_lock_ops, queued_spin_unlock) - 8usize];
    ["Offset of field: pv_lock_ops::wait"][::std::mem::offset_of!(pv_lock_ops, wait) - 16usize];
    ["Offset of field: pv_lock_ops::kick"][::std::mem::offset_of!(pv_lock_ops, kick) - 24usize];
    ["Offset of field: pv_lock_ops::vcpu_is_preempted"]
        [::std::mem::offset_of!(pv_lock_ops, vcpu_is_preempted) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct paravirt_patch_template {
    pub cpu: pv_cpu_ops,
    pub irq: pv_irq_ops,
    pub mmu: pv_mmu_ops,
    pub lock: pv_lock_ops,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of paravirt_patch_template"]
        [::std::mem::size_of::<paravirt_patch_template>() - 664usize];
    ["Alignment of paravirt_patch_template"]
        [::std::mem::align_of::<paravirt_patch_template>() - 8usize];
    ["Offset of field: paravirt_patch_template::cpu"]
        [::std::mem::offset_of!(paravirt_patch_template, cpu) - 0usize];
    ["Offset of field: paravirt_patch_template::irq"]
        [::std::mem::offset_of!(paravirt_patch_template, irq) - 240usize];
    ["Offset of field: paravirt_patch_template::mmu"]
        [::std::mem::offset_of!(paravirt_patch_template, mmu) - 280usize];
    ["Offset of field: paravirt_patch_template::lock"]
        [::std::mem::offset_of!(paravirt_patch_template, lock) - 624usize];
};
extern "C" {
    pub static mut pv_info: pv_info;
}
extern "C" {
    pub static mut pv_ops: paravirt_patch_template;
}
extern "C" {
    pub fn paravirt_disable_iospace() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn paravirt_ret0() -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn _paravirt_ident_64(arg1: u64_) -> u64_;
}
extern "C" {
    pub fn pv_native_save_fl() -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn pv_native_irq_disable();
}
extern "C" {
    pub fn pv_native_irq_enable();
}
extern "C" {
    pub fn pv_native_read_cr2() -> ::std::os::raw::c_ulong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct user_desc {
    pub entry_number: ::std::os::raw::c_uint,
    pub base_addr: ::std::os::raw::c_uint,
    pub limit: ::std::os::raw::c_uint,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of user_desc"][::std::mem::size_of::<user_desc>() - 16usize];
    ["Alignment of user_desc"][::std::mem::align_of::<user_desc>() - 4usize];
    ["Offset of field: user_desc::entry_number"]
        [::std::mem::offset_of!(user_desc, entry_number) - 0usize];
    ["Offset of field: user_desc::base_addr"]
        [::std::mem::offset_of!(user_desc, base_addr) - 4usize];
    ["Offset of field: user_desc::limit"][::std::mem::offset_of!(user_desc, limit) - 8usize];
};
impl user_desc {
    #[inline]
    pub fn seg_32bit(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_seg_32bit(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn contents(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_contents(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn read_exec_only(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_read_exec_only(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn limit_in_pages(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_limit_in_pages(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn seg_not_present(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_seg_not_present(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn useable(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_useable(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn lm(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_lm(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        seg_32bit: ::std::os::raw::c_uint,
        contents: ::std::os::raw::c_uint,
        read_exec_only: ::std::os::raw::c_uint,
        limit_in_pages: ::std::os::raw::c_uint,
        seg_not_present: ::std::os::raw::c_uint,
        useable: ::std::os::raw::c_uint,
        lm: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let seg_32bit: u32 = unsafe { ::std::mem::transmute(seg_32bit) };
            seg_32bit as u64
        });
        __bindgen_bitfield_unit.set(1usize, 2u8, {
            let contents: u32 = unsafe { ::std::mem::transmute(contents) };
            contents as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let read_exec_only: u32 = unsafe { ::std::mem::transmute(read_exec_only) };
            read_exec_only as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let limit_in_pages: u32 = unsafe { ::std::mem::transmute(limit_in_pages) };
            limit_in_pages as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let seg_not_present: u32 = unsafe { ::std::mem::transmute(seg_not_present) };
            seg_not_present as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let useable: u32 = unsafe { ::std::mem::transmute(useable) };
            useable as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let lm: u32 = unsafe { ::std::mem::transmute(lm) };
            lm as u64
        });
        __bindgen_bitfield_unit
    }
}
extern "C" {
    pub fn syscall_init();
}
extern "C" {
    pub fn entry_SYSCALL_64();
}
extern "C" {
    pub fn entry_SYSCALL_64_safe_stack();
}
extern "C" {
    pub fn entry_SYSRETQ_unsafe_stack();
}
extern "C" {
    pub fn entry_SYSRETQ_end();
}
extern "C" {
    pub fn do_arch_prctl_64(
        task: *mut task_struct,
        option: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn entry_SYSENTER_compat();
}
extern "C" {
    pub fn __end_entry_SYSENTER_compat();
}
extern "C" {
    pub fn entry_SYSCALL_compat();
}
extern "C" {
    pub fn entry_SYSCALL_compat_safe_stack();
}
extern "C" {
    pub fn entry_SYSRETL_compat_unsafe_stack();
}
extern "C" {
    pub fn entry_SYSRETL_compat_end();
}
extern "C" {
    pub fn x86_configure_nx();
}
extern "C" {
    pub static mut reboot_force: ::std::os::raw::c_int;
}
extern "C" {
    pub fn do_arch_prctl_common(
        option: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn profile_pc(regs: *mut pt_regs) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn convert_ip_to_linear(
        child: *mut task_struct,
        regs: *mut pt_regs,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn send_sigtrap(
        regs: *mut pt_regs,
        error_code: ::std::os::raw::c_int,
        si_code: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn regs_query_register_offset(name: *const ::std::os::raw::c_char)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn regs_query_register_name(
        offset: ::std::os::raw::c_uint,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn copy_from_kernel_nofault(
        dst: *mut ::std::os::raw::c_void,
        src: *const ::std::os::raw::c_void,
        size: usize,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn do_get_thread_area(
        p: *mut task_struct,
        idx: ::std::os::raw::c_int,
        info: *mut user_desc,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn do_set_thread_area(
        p: *mut task_struct,
        idx: ::std::os::raw::c_int,
        info: *mut user_desc,
        can_allocate: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct math_emu_info {
    pub ___orig_eip: ::std::os::raw::c_long,
    pub regs: *mut pt_regs,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of math_emu_info"][::std::mem::size_of::<math_emu_info>() - 16usize];
    ["Alignment of math_emu_info"][::std::mem::align_of::<math_emu_info>() - 8usize];
    ["Offset of field: math_emu_info::___orig_eip"]
        [::std::mem::offset_of!(math_emu_info, ___orig_eip) - 0usize];
    ["Offset of field: math_emu_info::regs"][::std::mem::offset_of!(math_emu_info, regs) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _fpx_sw_bytes {
    pub magic1: __u32,
    pub extended_size: __u32,
    pub xfeatures: __u64,
    pub xstate_size: __u32,
    pub padding: [__u32; 7usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _fpx_sw_bytes"][::std::mem::size_of::<_fpx_sw_bytes>() - 48usize];
    ["Alignment of _fpx_sw_bytes"][::std::mem::align_of::<_fpx_sw_bytes>() - 8usize];
    ["Offset of field: _fpx_sw_bytes::magic1"]
        [::std::mem::offset_of!(_fpx_sw_bytes, magic1) - 0usize];
    ["Offset of field: _fpx_sw_bytes::extended_size"]
        [::std::mem::offset_of!(_fpx_sw_bytes, extended_size) - 4usize];
    ["Offset of field: _fpx_sw_bytes::xfeatures"]
        [::std::mem::offset_of!(_fpx_sw_bytes, xfeatures) - 8usize];
    ["Offset of field: _fpx_sw_bytes::xstate_size"]
        [::std::mem::offset_of!(_fpx_sw_bytes, xstate_size) - 16usize];
    ["Offset of field: _fpx_sw_bytes::padding"]
        [::std::mem::offset_of!(_fpx_sw_bytes, padding) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _fpreg {
    pub significand: [__u16; 4usize],
    pub exponent: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _fpreg"][::std::mem::size_of::<_fpreg>() - 10usize];
    ["Alignment of _fpreg"][::std::mem::align_of::<_fpreg>() - 2usize];
    ["Offset of field: _fpreg::significand"][::std::mem::offset_of!(_fpreg, significand) - 0usize];
    ["Offset of field: _fpreg::exponent"][::std::mem::offset_of!(_fpreg, exponent) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _fpxreg {
    pub significand: [__u16; 4usize],
    pub exponent: __u16,
    pub padding: [__u16; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _fpxreg"][::std::mem::size_of::<_fpxreg>() - 16usize];
    ["Alignment of _fpxreg"][::std::mem::align_of::<_fpxreg>() - 2usize];
    ["Offset of field: _fpxreg::significand"]
        [::std::mem::offset_of!(_fpxreg, significand) - 0usize];
    ["Offset of field: _fpxreg::exponent"][::std::mem::offset_of!(_fpxreg, exponent) - 8usize];
    ["Offset of field: _fpxreg::padding"][::std::mem::offset_of!(_fpxreg, padding) - 10usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _xmmreg {
    pub element: [__u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _xmmreg"][::std::mem::size_of::<_xmmreg>() - 16usize];
    ["Alignment of _xmmreg"][::std::mem::align_of::<_xmmreg>() - 4usize];
    ["Offset of field: _xmmreg::element"][::std::mem::offset_of!(_xmmreg, element) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _fpstate_32 {
    pub cw: __u32,
    pub sw: __u32,
    pub tag: __u32,
    pub ipoff: __u32,
    pub cssel: __u32,
    pub dataoff: __u32,
    pub datasel: __u32,
    pub _st: [_fpreg; 8usize],
    pub status: __u16,
    pub magic: __u16,
    pub _fxsr_env: [__u32; 6usize],
    pub mxcsr: __u32,
    pub reserved: __u32,
    pub _fxsr_st: [_fpxreg; 8usize],
    pub _xmm: [_xmmreg; 8usize],
    pub __bindgen_anon_1: _fpstate_32__bindgen_ty_1,
    pub __bindgen_anon_2: _fpstate_32__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _fpstate_32__bindgen_ty_1 {
    pub padding1: [__u32; 44usize],
    pub padding: [__u32; 44usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _fpstate_32__bindgen_ty_1"]
        [::std::mem::size_of::<_fpstate_32__bindgen_ty_1>() - 176usize];
    ["Alignment of _fpstate_32__bindgen_ty_1"]
        [::std::mem::align_of::<_fpstate_32__bindgen_ty_1>() - 4usize];
    ["Offset of field: _fpstate_32__bindgen_ty_1::padding1"]
        [::std::mem::offset_of!(_fpstate_32__bindgen_ty_1, padding1) - 0usize];
    ["Offset of field: _fpstate_32__bindgen_ty_1::padding"]
        [::std::mem::offset_of!(_fpstate_32__bindgen_ty_1, padding) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union _fpstate_32__bindgen_ty_2 {
    pub padding2: [__u32; 12usize],
    pub sw_reserved: _fpx_sw_bytes,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _fpstate_32__bindgen_ty_2"]
        [::std::mem::size_of::<_fpstate_32__bindgen_ty_2>() - 48usize];
    ["Alignment of _fpstate_32__bindgen_ty_2"]
        [::std::mem::align_of::<_fpstate_32__bindgen_ty_2>() - 8usize];
    ["Offset of field: _fpstate_32__bindgen_ty_2::padding2"]
        [::std::mem::offset_of!(_fpstate_32__bindgen_ty_2, padding2) - 0usize];
    ["Offset of field: _fpstate_32__bindgen_ty_2::sw_reserved"]
        [::std::mem::offset_of!(_fpstate_32__bindgen_ty_2, sw_reserved) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _fpstate_32"][::std::mem::size_of::<_fpstate_32>() - 624usize];
    ["Alignment of _fpstate_32"][::std::mem::align_of::<_fpstate_32>() - 8usize];
    ["Offset of field: _fpstate_32::cw"][::std::mem::offset_of!(_fpstate_32, cw) - 0usize];
    ["Offset of field: _fpstate_32::sw"][::std::mem::offset_of!(_fpstate_32, sw) - 4usize];
    ["Offset of field: _fpstate_32::tag"][::std::mem::offset_of!(_fpstate_32, tag) - 8usize];
    ["Offset of field: _fpstate_32::ipoff"][::std::mem::offset_of!(_fpstate_32, ipoff) - 12usize];
    ["Offset of field: _fpstate_32::cssel"][::std::mem::offset_of!(_fpstate_32, cssel) - 16usize];
    ["Offset of field: _fpstate_32::dataoff"]
        [::std::mem::offset_of!(_fpstate_32, dataoff) - 20usize];
    ["Offset of field: _fpstate_32::datasel"]
        [::std::mem::offset_of!(_fpstate_32, datasel) - 24usize];
    ["Offset of field: _fpstate_32::_st"][::std::mem::offset_of!(_fpstate_32, _st) - 28usize];
    ["Offset of field: _fpstate_32::status"]
        [::std::mem::offset_of!(_fpstate_32, status) - 108usize];
    ["Offset of field: _fpstate_32::magic"][::std::mem::offset_of!(_fpstate_32, magic) - 110usize];
    ["Offset of field: _fpstate_32::_fxsr_env"]
        [::std::mem::offset_of!(_fpstate_32, _fxsr_env) - 112usize];
    ["Offset of field: _fpstate_32::mxcsr"][::std::mem::offset_of!(_fpstate_32, mxcsr) - 136usize];
    ["Offset of field: _fpstate_32::reserved"]
        [::std::mem::offset_of!(_fpstate_32, reserved) - 140usize];
    ["Offset of field: _fpstate_32::_fxsr_st"]
        [::std::mem::offset_of!(_fpstate_32, _fxsr_st) - 144usize];
    ["Offset of field: _fpstate_32::_xmm"][::std::mem::offset_of!(_fpstate_32, _xmm) - 272usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _fpstate_64 {
    pub cwd: __u16,
    pub swd: __u16,
    pub twd: __u16,
    pub fop: __u16,
    pub rip: __u64,
    pub rdp: __u64,
    pub mxcsr: __u32,
    pub mxcsr_mask: __u32,
    pub st_space: [__u32; 32usize],
    pub xmm_space: [__u32; 64usize],
    pub reserved2: [__u32; 12usize],
    pub __bindgen_anon_1: _fpstate_64__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _fpstate_64__bindgen_ty_1 {
    pub reserved3: [__u32; 12usize],
    pub sw_reserved: _fpx_sw_bytes,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _fpstate_64__bindgen_ty_1"]
        [::std::mem::size_of::<_fpstate_64__bindgen_ty_1>() - 48usize];
    ["Alignment of _fpstate_64__bindgen_ty_1"]
        [::std::mem::align_of::<_fpstate_64__bindgen_ty_1>() - 8usize];
    ["Offset of field: _fpstate_64__bindgen_ty_1::reserved3"]
        [::std::mem::offset_of!(_fpstate_64__bindgen_ty_1, reserved3) - 0usize];
    ["Offset of field: _fpstate_64__bindgen_ty_1::sw_reserved"]
        [::std::mem::offset_of!(_fpstate_64__bindgen_ty_1, sw_reserved) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _fpstate_64"][::std::mem::size_of::<_fpstate_64>() - 512usize];
    ["Alignment of _fpstate_64"][::std::mem::align_of::<_fpstate_64>() - 8usize];
    ["Offset of field: _fpstate_64::cwd"][::std::mem::offset_of!(_fpstate_64, cwd) - 0usize];
    ["Offset of field: _fpstate_64::swd"][::std::mem::offset_of!(_fpstate_64, swd) - 2usize];
    ["Offset of field: _fpstate_64::twd"][::std::mem::offset_of!(_fpstate_64, twd) - 4usize];
    ["Offset of field: _fpstate_64::fop"][::std::mem::offset_of!(_fpstate_64, fop) - 6usize];
    ["Offset of field: _fpstate_64::rip"][::std::mem::offset_of!(_fpstate_64, rip) - 8usize];
    ["Offset of field: _fpstate_64::rdp"][::std::mem::offset_of!(_fpstate_64, rdp) - 16usize];
    ["Offset of field: _fpstate_64::mxcsr"][::std::mem::offset_of!(_fpstate_64, mxcsr) - 24usize];
    ["Offset of field: _fpstate_64::mxcsr_mask"]
        [::std::mem::offset_of!(_fpstate_64, mxcsr_mask) - 28usize];
    ["Offset of field: _fpstate_64::st_space"]
        [::std::mem::offset_of!(_fpstate_64, st_space) - 32usize];
    ["Offset of field: _fpstate_64::xmm_space"]
        [::std::mem::offset_of!(_fpstate_64, xmm_space) - 160usize];
    ["Offset of field: _fpstate_64::reserved2"]
        [::std::mem::offset_of!(_fpstate_64, reserved2) - 416usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _header {
    pub xfeatures: __u64,
    pub reserved1: [__u64; 2usize],
    pub reserved2: [__u64; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _header"][::std::mem::size_of::<_header>() - 64usize];
    ["Alignment of _header"][::std::mem::align_of::<_header>() - 8usize];
    ["Offset of field: _header::xfeatures"][::std::mem::offset_of!(_header, xfeatures) - 0usize];
    ["Offset of field: _header::reserved1"][::std::mem::offset_of!(_header, reserved1) - 8usize];
    ["Offset of field: _header::reserved2"][::std::mem::offset_of!(_header, reserved2) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ymmh_state {
    pub ymmh_space: [__u32; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ymmh_state"][::std::mem::size_of::<_ymmh_state>() - 256usize];
    ["Alignment of _ymmh_state"][::std::mem::align_of::<_ymmh_state>() - 4usize];
    ["Offset of field: _ymmh_state::ymmh_space"]
        [::std::mem::offset_of!(_ymmh_state, ymmh_space) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _xstate {
    pub fpstate: _fpstate_64,
    pub xstate_hdr: _header,
    pub ymmh: _ymmh_state,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _xstate"][::std::mem::size_of::<_xstate>() - 832usize];
    ["Alignment of _xstate"][::std::mem::align_of::<_xstate>() - 8usize];
    ["Offset of field: _xstate::fpstate"][::std::mem::offset_of!(_xstate, fpstate) - 0usize];
    ["Offset of field: _xstate::xstate_hdr"]
        [::std::mem::offset_of!(_xstate, xstate_hdr) - 512usize];
    ["Offset of field: _xstate::ymmh"][::std::mem::offset_of!(_xstate, ymmh) - 576usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigcontext_32 {
    pub gs: __u16,
    pub __gsh: __u16,
    pub fs: __u16,
    pub __fsh: __u16,
    pub es: __u16,
    pub __esh: __u16,
    pub ds: __u16,
    pub __dsh: __u16,
    pub di: __u32,
    pub si: __u32,
    pub bp: __u32,
    pub sp: __u32,
    pub bx: __u32,
    pub dx: __u32,
    pub cx: __u32,
    pub ax: __u32,
    pub trapno: __u32,
    pub err: __u32,
    pub ip: __u32,
    pub cs: __u16,
    pub __csh: __u16,
    pub flags: __u32,
    pub sp_at_signal: __u32,
    pub ss: __u16,
    pub __ssh: __u16,
    pub fpstate: __u32,
    pub oldmask: __u32,
    pub cr2: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigcontext_32"][::std::mem::size_of::<sigcontext_32>() - 88usize];
    ["Alignment of sigcontext_32"][::std::mem::align_of::<sigcontext_32>() - 4usize];
    ["Offset of field: sigcontext_32::gs"][::std::mem::offset_of!(sigcontext_32, gs) - 0usize];
    ["Offset of field: sigcontext_32::__gsh"]
        [::std::mem::offset_of!(sigcontext_32, __gsh) - 2usize];
    ["Offset of field: sigcontext_32::fs"][::std::mem::offset_of!(sigcontext_32, fs) - 4usize];
    ["Offset of field: sigcontext_32::__fsh"]
        [::std::mem::offset_of!(sigcontext_32, __fsh) - 6usize];
    ["Offset of field: sigcontext_32::es"][::std::mem::offset_of!(sigcontext_32, es) - 8usize];
    ["Offset of field: sigcontext_32::__esh"]
        [::std::mem::offset_of!(sigcontext_32, __esh) - 10usize];
    ["Offset of field: sigcontext_32::ds"][::std::mem::offset_of!(sigcontext_32, ds) - 12usize];
    ["Offset of field: sigcontext_32::__dsh"]
        [::std::mem::offset_of!(sigcontext_32, __dsh) - 14usize];
    ["Offset of field: sigcontext_32::di"][::std::mem::offset_of!(sigcontext_32, di) - 16usize];
    ["Offset of field: sigcontext_32::si"][::std::mem::offset_of!(sigcontext_32, si) - 20usize];
    ["Offset of field: sigcontext_32::bp"][::std::mem::offset_of!(sigcontext_32, bp) - 24usize];
    ["Offset of field: sigcontext_32::sp"][::std::mem::offset_of!(sigcontext_32, sp) - 28usize];
    ["Offset of field: sigcontext_32::bx"][::std::mem::offset_of!(sigcontext_32, bx) - 32usize];
    ["Offset of field: sigcontext_32::dx"][::std::mem::offset_of!(sigcontext_32, dx) - 36usize];
    ["Offset of field: sigcontext_32::cx"][::std::mem::offset_of!(sigcontext_32, cx) - 40usize];
    ["Offset of field: sigcontext_32::ax"][::std::mem::offset_of!(sigcontext_32, ax) - 44usize];
    ["Offset of field: sigcontext_32::trapno"]
        [::std::mem::offset_of!(sigcontext_32, trapno) - 48usize];
    ["Offset of field: sigcontext_32::err"][::std::mem::offset_of!(sigcontext_32, err) - 52usize];
    ["Offset of field: sigcontext_32::ip"][::std::mem::offset_of!(sigcontext_32, ip) - 56usize];
    ["Offset of field: sigcontext_32::cs"][::std::mem::offset_of!(sigcontext_32, cs) - 60usize];
    ["Offset of field: sigcontext_32::__csh"]
        [::std::mem::offset_of!(sigcontext_32, __csh) - 62usize];
    ["Offset of field: sigcontext_32::flags"]
        [::std::mem::offset_of!(sigcontext_32, flags) - 64usize];
    ["Offset of field: sigcontext_32::sp_at_signal"]
        [::std::mem::offset_of!(sigcontext_32, sp_at_signal) - 68usize];
    ["Offset of field: sigcontext_32::ss"][::std::mem::offset_of!(sigcontext_32, ss) - 72usize];
    ["Offset of field: sigcontext_32::__ssh"]
        [::std::mem::offset_of!(sigcontext_32, __ssh) - 74usize];
    ["Offset of field: sigcontext_32::fpstate"]
        [::std::mem::offset_of!(sigcontext_32, fpstate) - 76usize];
    ["Offset of field: sigcontext_32::oldmask"]
        [::std::mem::offset_of!(sigcontext_32, oldmask) - 80usize];
    ["Offset of field: sigcontext_32::cr2"][::std::mem::offset_of!(sigcontext_32, cr2) - 84usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigcontext_64 {
    pub r8: __u64,
    pub r9: __u64,
    pub r10: __u64,
    pub r11: __u64,
    pub r12: __u64,
    pub r13: __u64,
    pub r14: __u64,
    pub r15: __u64,
    pub di: __u64,
    pub si: __u64,
    pub bp: __u64,
    pub bx: __u64,
    pub dx: __u64,
    pub ax: __u64,
    pub cx: __u64,
    pub sp: __u64,
    pub ip: __u64,
    pub flags: __u64,
    pub cs: __u16,
    pub gs: __u16,
    pub fs: __u16,
    pub ss: __u16,
    pub err: __u64,
    pub trapno: __u64,
    pub oldmask: __u64,
    pub cr2: __u64,
    pub fpstate: __u64,
    pub reserved1: [__u64; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigcontext_64"][::std::mem::size_of::<sigcontext_64>() - 256usize];
    ["Alignment of sigcontext_64"][::std::mem::align_of::<sigcontext_64>() - 8usize];
    ["Offset of field: sigcontext_64::r8"][::std::mem::offset_of!(sigcontext_64, r8) - 0usize];
    ["Offset of field: sigcontext_64::r9"][::std::mem::offset_of!(sigcontext_64, r9) - 8usize];
    ["Offset of field: sigcontext_64::r10"][::std::mem::offset_of!(sigcontext_64, r10) - 16usize];
    ["Offset of field: sigcontext_64::r11"][::std::mem::offset_of!(sigcontext_64, r11) - 24usize];
    ["Offset of field: sigcontext_64::r12"][::std::mem::offset_of!(sigcontext_64, r12) - 32usize];
    ["Offset of field: sigcontext_64::r13"][::std::mem::offset_of!(sigcontext_64, r13) - 40usize];
    ["Offset of field: sigcontext_64::r14"][::std::mem::offset_of!(sigcontext_64, r14) - 48usize];
    ["Offset of field: sigcontext_64::r15"][::std::mem::offset_of!(sigcontext_64, r15) - 56usize];
    ["Offset of field: sigcontext_64::di"][::std::mem::offset_of!(sigcontext_64, di) - 64usize];
    ["Offset of field: sigcontext_64::si"][::std::mem::offset_of!(sigcontext_64, si) - 72usize];
    ["Offset of field: sigcontext_64::bp"][::std::mem::offset_of!(sigcontext_64, bp) - 80usize];
    ["Offset of field: sigcontext_64::bx"][::std::mem::offset_of!(sigcontext_64, bx) - 88usize];
    ["Offset of field: sigcontext_64::dx"][::std::mem::offset_of!(sigcontext_64, dx) - 96usize];
    ["Offset of field: sigcontext_64::ax"][::std::mem::offset_of!(sigcontext_64, ax) - 104usize];
    ["Offset of field: sigcontext_64::cx"][::std::mem::offset_of!(sigcontext_64, cx) - 112usize];
    ["Offset of field: sigcontext_64::sp"][::std::mem::offset_of!(sigcontext_64, sp) - 120usize];
    ["Offset of field: sigcontext_64::ip"][::std::mem::offset_of!(sigcontext_64, ip) - 128usize];
    ["Offset of field: sigcontext_64::flags"]
        [::std::mem::offset_of!(sigcontext_64, flags) - 136usize];
    ["Offset of field: sigcontext_64::cs"][::std::mem::offset_of!(sigcontext_64, cs) - 144usize];
    ["Offset of field: sigcontext_64::gs"][::std::mem::offset_of!(sigcontext_64, gs) - 146usize];
    ["Offset of field: sigcontext_64::fs"][::std::mem::offset_of!(sigcontext_64, fs) - 148usize];
    ["Offset of field: sigcontext_64::ss"][::std::mem::offset_of!(sigcontext_64, ss) - 150usize];
    ["Offset of field: sigcontext_64::err"][::std::mem::offset_of!(sigcontext_64, err) - 152usize];
    ["Offset of field: sigcontext_64::trapno"]
        [::std::mem::offset_of!(sigcontext_64, trapno) - 160usize];
    ["Offset of field: sigcontext_64::oldmask"]
        [::std::mem::offset_of!(sigcontext_64, oldmask) - 168usize];
    ["Offset of field: sigcontext_64::cr2"][::std::mem::offset_of!(sigcontext_64, cr2) - 176usize];
    ["Offset of field: sigcontext_64::fpstate"]
        [::std::mem::offset_of!(sigcontext_64, fpstate) - 184usize];
    ["Offset of field: sigcontext_64::reserved1"]
        [::std::mem::offset_of!(sigcontext_64, reserved1) - 192usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cpuid_regs {
    pub eax: u32_,
    pub ebx: u32_,
    pub ecx: u32_,
    pub edx: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpuid_regs"][::std::mem::size_of::<cpuid_regs>() - 16usize];
    ["Alignment of cpuid_regs"][::std::mem::align_of::<cpuid_regs>() - 4usize];
    ["Offset of field: cpuid_regs::eax"][::std::mem::offset_of!(cpuid_regs, eax) - 0usize];
    ["Offset of field: cpuid_regs::ebx"][::std::mem::offset_of!(cpuid_regs, ebx) - 4usize];
    ["Offset of field: cpuid_regs::ecx"][::std::mem::offset_of!(cpuid_regs, ecx) - 8usize];
    ["Offset of field: cpuid_regs::edx"][::std::mem::offset_of!(cpuid_regs, edx) - 12usize];
};
pub const cpuid_regs_idx_CPUID_EAX: cpuid_regs_idx = 0;
pub const cpuid_regs_idx_CPUID_EBX: cpuid_regs_idx = 1;
pub const cpuid_regs_idx_CPUID_ECX: cpuid_regs_idx = 2;
pub const cpuid_regs_idx_CPUID_EDX: cpuid_regs_idx = 3;
pub type cpuid_regs_idx = ::std::os::raw::c_uint;
extern "C" {
    pub fn dummy_steal_clock(cpu: ::std::os::raw::c_int) -> u64_;
}
extern "C" {
    pub fn dummy_sched_clock() -> u64_;
}
extern "C" {
    pub static mut __SCK__pv_steal_clock: static_call_key;
}
extern "C" {
    pub fn __SCT__pv_steal_clock(arg1: ::std::os::raw::c_int) -> u64_;
}
extern "C" {
    pub static mut __SCK__pv_sched_clock: static_call_key;
}
extern "C" {
    pub fn __SCT__pv_sched_clock() -> u64_;
}
extern "C" {
    pub fn paravirt_set_sched_clock(func: ::std::option::Option<unsafe extern "C" fn() -> u64_>);
}
extern "C" {
    pub static mut paravirt_steal_enabled: static_key;
}
extern "C" {
    pub static mut paravirt_steal_rq_enabled: static_key;
}
extern "C" {
    pub fn __native_queued_spin_unlock(lock: *mut qspinlock);
}
extern "C" {
    pub fn pv_is_native_spin_unlock() -> bool_;
}
extern "C" {
    pub fn __native_vcpu_is_preempted(cpu: ::std::os::raw::c_long) -> bool_;
}
extern "C" {
    pub fn pv_is_native_vcpu_is_preempted() -> bool_;
}
extern "C" {
    pub fn paravirt_set_cap();
}
extern "C" {
    pub fn native_flush_tlb_local();
}
extern "C" {
    pub fn native_flush_tlb_global();
}
extern "C" {
    pub fn native_flush_tlb_one_user(addr: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn native_flush_tlb_multi(cpumask: *const cpumask, info: *const flush_tlb_info);
}
extern "C" {
    pub fn pv_native_wbinvd();
}
extern "C" {
    pub fn __raw_callee_save___native_queued_spin_unlock(lock: *mut qspinlock);
}
extern "C" {
    pub fn __raw_callee_save___native_vcpu_is_preempted(cpu: ::std::os::raw::c_long) -> bool_;
}
extern "C" {
    pub fn default_banner();
}
extern "C" {
    pub fn native_pv_lock_init();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct class_irq_t {
    pub lock: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of class_irq_t"][::std::mem::size_of::<class_irq_t>() - 8usize];
    ["Alignment of class_irq_t"][::std::mem::align_of::<class_irq_t>() - 8usize];
    ["Offset of field: class_irq_t::lock"][::std::mem::offset_of!(class_irq_t, lock) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct class_irqsave_t {
    pub lock: *mut ::std::os::raw::c_void,
    pub flags: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of class_irqsave_t"][::std::mem::size_of::<class_irqsave_t>() - 16usize];
    ["Alignment of class_irqsave_t"][::std::mem::align_of::<class_irqsave_t>() - 8usize];
    ["Offset of field: class_irqsave_t::lock"]
        [::std::mem::offset_of!(class_irqsave_t, lock) - 0usize];
    ["Offset of field: class_irqsave_t::flags"]
        [::std::mem::offset_of!(class_irqsave_t, flags) - 8usize];
};
extern "C" {
    pub fn native_write_cr0(val: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn native_write_cr4(val: ::std::os::raw::c_ulong);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fregs_state {
    pub cwd: u32_,
    pub swd: u32_,
    pub twd: u32_,
    pub fip: u32_,
    pub fcs: u32_,
    pub foo: u32_,
    pub fos: u32_,
    pub st_space: [u32_; 20usize],
    pub status: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fregs_state"][::std::mem::size_of::<fregs_state>() - 112usize];
    ["Alignment of fregs_state"][::std::mem::align_of::<fregs_state>() - 4usize];
    ["Offset of field: fregs_state::cwd"][::std::mem::offset_of!(fregs_state, cwd) - 0usize];
    ["Offset of field: fregs_state::swd"][::std::mem::offset_of!(fregs_state, swd) - 4usize];
    ["Offset of field: fregs_state::twd"][::std::mem::offset_of!(fregs_state, twd) - 8usize];
    ["Offset of field: fregs_state::fip"][::std::mem::offset_of!(fregs_state, fip) - 12usize];
    ["Offset of field: fregs_state::fcs"][::std::mem::offset_of!(fregs_state, fcs) - 16usize];
    ["Offset of field: fregs_state::foo"][::std::mem::offset_of!(fregs_state, foo) - 20usize];
    ["Offset of field: fregs_state::fos"][::std::mem::offset_of!(fregs_state, fos) - 24usize];
    ["Offset of field: fregs_state::st_space"]
        [::std::mem::offset_of!(fregs_state, st_space) - 28usize];
    ["Offset of field: fregs_state::status"]
        [::std::mem::offset_of!(fregs_state, status) - 108usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub struct fxregs_state {
    pub cwd: u16_,
    pub swd: u16_,
    pub twd: u16_,
    pub fop: u16_,
    pub __bindgen_anon_1: fxregs_state__bindgen_ty_1,
    pub mxcsr: u32_,
    pub mxcsr_mask: u32_,
    pub st_space: [u32_; 32usize],
    pub xmm_space: [u32_; 64usize],
    pub padding: [u32_; 12usize],
    pub __bindgen_anon_2: fxregs_state__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union fxregs_state__bindgen_ty_1 {
    pub __bindgen_anon_1: fxregs_state__bindgen_ty_1__bindgen_ty_1,
    pub __bindgen_anon_2: fxregs_state__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fxregs_state__bindgen_ty_1__bindgen_ty_1 {
    pub rip: u64_,
    pub rdp: u64_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fxregs_state__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<fxregs_state__bindgen_ty_1__bindgen_ty_1>() - 16usize];
    ["Alignment of fxregs_state__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<fxregs_state__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: fxregs_state__bindgen_ty_1__bindgen_ty_1::rip"]
        [::std::mem::offset_of!(fxregs_state__bindgen_ty_1__bindgen_ty_1, rip) - 0usize];
    ["Offset of field: fxregs_state__bindgen_ty_1__bindgen_ty_1::rdp"]
        [::std::mem::offset_of!(fxregs_state__bindgen_ty_1__bindgen_ty_1, rdp) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fxregs_state__bindgen_ty_1__bindgen_ty_2 {
    pub fip: u32_,
    pub fcs: u32_,
    pub foo: u32_,
    pub fos: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fxregs_state__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<fxregs_state__bindgen_ty_1__bindgen_ty_2>() - 16usize];
    ["Alignment of fxregs_state__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<fxregs_state__bindgen_ty_1__bindgen_ty_2>() - 4usize];
    ["Offset of field: fxregs_state__bindgen_ty_1__bindgen_ty_2::fip"]
        [::std::mem::offset_of!(fxregs_state__bindgen_ty_1__bindgen_ty_2, fip) - 0usize];
    ["Offset of field: fxregs_state__bindgen_ty_1__bindgen_ty_2::fcs"]
        [::std::mem::offset_of!(fxregs_state__bindgen_ty_1__bindgen_ty_2, fcs) - 4usize];
    ["Offset of field: fxregs_state__bindgen_ty_1__bindgen_ty_2::foo"]
        [::std::mem::offset_of!(fxregs_state__bindgen_ty_1__bindgen_ty_2, foo) - 8usize];
    ["Offset of field: fxregs_state__bindgen_ty_1__bindgen_ty_2::fos"]
        [::std::mem::offset_of!(fxregs_state__bindgen_ty_1__bindgen_ty_2, fos) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fxregs_state__bindgen_ty_1"]
        [::std::mem::size_of::<fxregs_state__bindgen_ty_1>() - 16usize];
    ["Alignment of fxregs_state__bindgen_ty_1"]
        [::std::mem::align_of::<fxregs_state__bindgen_ty_1>() - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union fxregs_state__bindgen_ty_2 {
    pub padding1: [u32_; 12usize],
    pub sw_reserved: [u32_; 12usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fxregs_state__bindgen_ty_2"]
        [::std::mem::size_of::<fxregs_state__bindgen_ty_2>() - 48usize];
    ["Alignment of fxregs_state__bindgen_ty_2"]
        [::std::mem::align_of::<fxregs_state__bindgen_ty_2>() - 4usize];
    ["Offset of field: fxregs_state__bindgen_ty_2::padding1"]
        [::std::mem::offset_of!(fxregs_state__bindgen_ty_2, padding1) - 0usize];
    ["Offset of field: fxregs_state__bindgen_ty_2::sw_reserved"]
        [::std::mem::offset_of!(fxregs_state__bindgen_ty_2, sw_reserved) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fxregs_state"][::std::mem::size_of::<fxregs_state>() - 512usize];
    ["Alignment of fxregs_state"][::std::mem::align_of::<fxregs_state>() - 16usize];
    ["Offset of field: fxregs_state::cwd"][::std::mem::offset_of!(fxregs_state, cwd) - 0usize];
    ["Offset of field: fxregs_state::swd"][::std::mem::offset_of!(fxregs_state, swd) - 2usize];
    ["Offset of field: fxregs_state::twd"][::std::mem::offset_of!(fxregs_state, twd) - 4usize];
    ["Offset of field: fxregs_state::fop"][::std::mem::offset_of!(fxregs_state, fop) - 6usize];
    ["Offset of field: fxregs_state::mxcsr"][::std::mem::offset_of!(fxregs_state, mxcsr) - 24usize];
    ["Offset of field: fxregs_state::mxcsr_mask"]
        [::std::mem::offset_of!(fxregs_state, mxcsr_mask) - 28usize];
    ["Offset of field: fxregs_state::st_space"]
        [::std::mem::offset_of!(fxregs_state, st_space) - 32usize];
    ["Offset of field: fxregs_state::xmm_space"]
        [::std::mem::offset_of!(fxregs_state, xmm_space) - 160usize];
    ["Offset of field: fxregs_state::padding"]
        [::std::mem::offset_of!(fxregs_state, padding) - 416usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct swregs_state {
    pub cwd: u32_,
    pub swd: u32_,
    pub twd: u32_,
    pub fip: u32_,
    pub fcs: u32_,
    pub foo: u32_,
    pub fos: u32_,
    pub st_space: [u32_; 20usize],
    pub ftop: u8_,
    pub changed: u8_,
    pub lookahead: u8_,
    pub no_update: u8_,
    pub rm: u8_,
    pub alimit: u8_,
    pub info: *mut math_emu_info,
    pub entry_eip: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of swregs_state"][::std::mem::size_of::<swregs_state>() - 136usize];
    ["Alignment of swregs_state"][::std::mem::align_of::<swregs_state>() - 8usize];
    ["Offset of field: swregs_state::cwd"][::std::mem::offset_of!(swregs_state, cwd) - 0usize];
    ["Offset of field: swregs_state::swd"][::std::mem::offset_of!(swregs_state, swd) - 4usize];
    ["Offset of field: swregs_state::twd"][::std::mem::offset_of!(swregs_state, twd) - 8usize];
    ["Offset of field: swregs_state::fip"][::std::mem::offset_of!(swregs_state, fip) - 12usize];
    ["Offset of field: swregs_state::fcs"][::std::mem::offset_of!(swregs_state, fcs) - 16usize];
    ["Offset of field: swregs_state::foo"][::std::mem::offset_of!(swregs_state, foo) - 20usize];
    ["Offset of field: swregs_state::fos"][::std::mem::offset_of!(swregs_state, fos) - 24usize];
    ["Offset of field: swregs_state::st_space"]
        [::std::mem::offset_of!(swregs_state, st_space) - 28usize];
    ["Offset of field: swregs_state::ftop"][::std::mem::offset_of!(swregs_state, ftop) - 108usize];
    ["Offset of field: swregs_state::changed"]
        [::std::mem::offset_of!(swregs_state, changed) - 109usize];
    ["Offset of field: swregs_state::lookahead"]
        [::std::mem::offset_of!(swregs_state, lookahead) - 110usize];
    ["Offset of field: swregs_state::no_update"]
        [::std::mem::offset_of!(swregs_state, no_update) - 111usize];
    ["Offset of field: swregs_state::rm"][::std::mem::offset_of!(swregs_state, rm) - 112usize];
    ["Offset of field: swregs_state::alimit"]
        [::std::mem::offset_of!(swregs_state, alimit) - 113usize];
    ["Offset of field: swregs_state::info"][::std::mem::offset_of!(swregs_state, info) - 120usize];
    ["Offset of field: swregs_state::entry_eip"]
        [::std::mem::offset_of!(swregs_state, entry_eip) - 128usize];
};
pub const xfeature_XFEATURE_FP: xfeature = 0;
pub const xfeature_XFEATURE_SSE: xfeature = 1;
pub const xfeature_XFEATURE_YMM: xfeature = 2;
pub const xfeature_XFEATURE_BNDREGS: xfeature = 3;
pub const xfeature_XFEATURE_BNDCSR: xfeature = 4;
pub const xfeature_XFEATURE_OPMASK: xfeature = 5;
pub const xfeature_XFEATURE_ZMM_Hi256: xfeature = 6;
pub const xfeature_XFEATURE_Hi16_ZMM: xfeature = 7;
pub const xfeature_XFEATURE_PT_UNIMPLEMENTED_SO_FAR: xfeature = 8;
pub const xfeature_XFEATURE_PKRU: xfeature = 9;
pub const xfeature_XFEATURE_PASID: xfeature = 10;
pub const xfeature_XFEATURE_CET_USER: xfeature = 11;
pub const xfeature_XFEATURE_CET_KERNEL_UNUSED: xfeature = 12;
pub const xfeature_XFEATURE_RSRVD_COMP_13: xfeature = 13;
pub const xfeature_XFEATURE_RSRVD_COMP_14: xfeature = 14;
pub const xfeature_XFEATURE_LBR: xfeature = 15;
pub const xfeature_XFEATURE_RSRVD_COMP_16: xfeature = 16;
pub const xfeature_XFEATURE_XTILE_CFG: xfeature = 17;
pub const xfeature_XFEATURE_XTILE_DATA: xfeature = 18;
pub const xfeature_XFEATURE_MAX: xfeature = 19;
pub type xfeature = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct reg_128_bit {
    pub regbytes: [u8_; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of reg_128_bit"][::std::mem::size_of::<reg_128_bit>() - 16usize];
    ["Alignment of reg_128_bit"][::std::mem::align_of::<reg_128_bit>() - 1usize];
    ["Offset of field: reg_128_bit::regbytes"]
        [::std::mem::offset_of!(reg_128_bit, regbytes) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct reg_256_bit {
    pub regbytes: [u8_; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of reg_256_bit"][::std::mem::size_of::<reg_256_bit>() - 32usize];
    ["Alignment of reg_256_bit"][::std::mem::align_of::<reg_256_bit>() - 1usize];
    ["Offset of field: reg_256_bit::regbytes"]
        [::std::mem::offset_of!(reg_256_bit, regbytes) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct reg_512_bit {
    pub regbytes: [u8_; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of reg_512_bit"][::std::mem::size_of::<reg_512_bit>() - 64usize];
    ["Alignment of reg_512_bit"][::std::mem::align_of::<reg_512_bit>() - 1usize];
    ["Offset of field: reg_512_bit::regbytes"]
        [::std::mem::offset_of!(reg_512_bit, regbytes) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct reg_1024_byte {
    pub regbytes: [u8_; 1024usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of reg_1024_byte"][::std::mem::size_of::<reg_1024_byte>() - 1024usize];
    ["Alignment of reg_1024_byte"][::std::mem::align_of::<reg_1024_byte>() - 1usize];
    ["Offset of field: reg_1024_byte::regbytes"]
        [::std::mem::offset_of!(reg_1024_byte, regbytes) - 0usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ymmh_struct {
    pub hi_ymm: [reg_128_bit; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ymmh_struct"][::std::mem::size_of::<ymmh_struct>() - 256usize];
    ["Alignment of ymmh_struct"][::std::mem::align_of::<ymmh_struct>() - 1usize];
    ["Offset of field: ymmh_struct::hi_ymm"][::std::mem::offset_of!(ymmh_struct, hi_ymm) - 0usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct mpx_bndreg {
    pub lower_bound: u64_,
    pub upper_bound: u64_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpx_bndreg"][::std::mem::size_of::<mpx_bndreg>() - 16usize];
    ["Alignment of mpx_bndreg"][::std::mem::align_of::<mpx_bndreg>() - 1usize];
    ["Offset of field: mpx_bndreg::lower_bound"]
        [::std::mem::offset_of!(mpx_bndreg, lower_bound) - 0usize];
    ["Offset of field: mpx_bndreg::upper_bound"]
        [::std::mem::offset_of!(mpx_bndreg, upper_bound) - 8usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct mpx_bndreg_state {
    pub bndreg: [mpx_bndreg; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpx_bndreg_state"][::std::mem::size_of::<mpx_bndreg_state>() - 64usize];
    ["Alignment of mpx_bndreg_state"][::std::mem::align_of::<mpx_bndreg_state>() - 1usize];
    ["Offset of field: mpx_bndreg_state::bndreg"]
        [::std::mem::offset_of!(mpx_bndreg_state, bndreg) - 0usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct mpx_bndcsr {
    pub bndcfgu: u64_,
    pub bndstatus: u64_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpx_bndcsr"][::std::mem::size_of::<mpx_bndcsr>() - 16usize];
    ["Alignment of mpx_bndcsr"][::std::mem::align_of::<mpx_bndcsr>() - 1usize];
    ["Offset of field: mpx_bndcsr::bndcfgu"][::std::mem::offset_of!(mpx_bndcsr, bndcfgu) - 0usize];
    ["Offset of field: mpx_bndcsr::bndstatus"]
        [::std::mem::offset_of!(mpx_bndcsr, bndstatus) - 8usize];
};
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct mpx_bndcsr_state {
    pub __bindgen_anon_1: mpx_bndcsr_state__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union mpx_bndcsr_state__bindgen_ty_1 {
    pub bndcsr: mpx_bndcsr,
    pub pad_to_64_bytes: [u8_; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpx_bndcsr_state__bindgen_ty_1"]
        [::std::mem::size_of::<mpx_bndcsr_state__bindgen_ty_1>() - 64usize];
    ["Alignment of mpx_bndcsr_state__bindgen_ty_1"]
        [::std::mem::align_of::<mpx_bndcsr_state__bindgen_ty_1>() - 1usize];
    ["Offset of field: mpx_bndcsr_state__bindgen_ty_1::bndcsr"]
        [::std::mem::offset_of!(mpx_bndcsr_state__bindgen_ty_1, bndcsr) - 0usize];
    ["Offset of field: mpx_bndcsr_state__bindgen_ty_1::pad_to_64_bytes"]
        [::std::mem::offset_of!(mpx_bndcsr_state__bindgen_ty_1, pad_to_64_bytes) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mpx_bndcsr_state"][::std::mem::size_of::<mpx_bndcsr_state>() - 64usize];
    ["Alignment of mpx_bndcsr_state"][::std::mem::align_of::<mpx_bndcsr_state>() - 1usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct avx_512_opmask_state {
    pub opmask_reg: [u64_; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of avx_512_opmask_state"][::std::mem::size_of::<avx_512_opmask_state>() - 64usize];
    ["Alignment of avx_512_opmask_state"][::std::mem::align_of::<avx_512_opmask_state>() - 1usize];
    ["Offset of field: avx_512_opmask_state::opmask_reg"]
        [::std::mem::offset_of!(avx_512_opmask_state, opmask_reg) - 0usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct avx_512_zmm_uppers_state {
    pub zmm_upper: [reg_256_bit; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of avx_512_zmm_uppers_state"]
        [::std::mem::size_of::<avx_512_zmm_uppers_state>() - 512usize];
    ["Alignment of avx_512_zmm_uppers_state"]
        [::std::mem::align_of::<avx_512_zmm_uppers_state>() - 1usize];
    ["Offset of field: avx_512_zmm_uppers_state::zmm_upper"]
        [::std::mem::offset_of!(avx_512_zmm_uppers_state, zmm_upper) - 0usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct avx_512_hi16_state {
    pub hi16_zmm: [reg_512_bit; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of avx_512_hi16_state"][::std::mem::size_of::<avx_512_hi16_state>() - 1024usize];
    ["Alignment of avx_512_hi16_state"][::std::mem::align_of::<avx_512_hi16_state>() - 1usize];
    ["Offset of field: avx_512_hi16_state::hi16_zmm"]
        [::std::mem::offset_of!(avx_512_hi16_state, hi16_zmm) - 0usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct pkru_state {
    pub pkru: u32_,
    pub pad: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pkru_state"][::std::mem::size_of::<pkru_state>() - 8usize];
    ["Alignment of pkru_state"][::std::mem::align_of::<pkru_state>() - 1usize];
    ["Offset of field: pkru_state::pkru"][::std::mem::offset_of!(pkru_state, pkru) - 0usize];
    ["Offset of field: pkru_state::pad"][::std::mem::offset_of!(pkru_state, pad) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cet_user_state {
    pub user_cet: u64_,
    pub user_ssp: u64_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cet_user_state"][::std::mem::size_of::<cet_user_state>() - 16usize];
    ["Alignment of cet_user_state"][::std::mem::align_of::<cet_user_state>() - 8usize];
    ["Offset of field: cet_user_state::user_cet"]
        [::std::mem::offset_of!(cet_user_state, user_cet) - 0usize];
    ["Offset of field: cet_user_state::user_ssp"]
        [::std::mem::offset_of!(cet_user_state, user_ssp) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lbr_entry {
    pub from: u64_,
    pub to: u64_,
    pub info: u64_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lbr_entry"][::std::mem::size_of::<lbr_entry>() - 24usize];
    ["Alignment of lbr_entry"][::std::mem::align_of::<lbr_entry>() - 8usize];
    ["Offset of field: lbr_entry::from"][::std::mem::offset_of!(lbr_entry, from) - 0usize];
    ["Offset of field: lbr_entry::to"][::std::mem::offset_of!(lbr_entry, to) - 8usize];
    ["Offset of field: lbr_entry::info"][::std::mem::offset_of!(lbr_entry, info) - 16usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct arch_lbr_state {
    pub lbr_ctl: u64_,
    pub lbr_depth: u64_,
    pub ler_from: u64_,
    pub ler_to: u64_,
    pub ler_info: u64_,
    pub entries: __IncompleteArrayField<lbr_entry>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of arch_lbr_state"][::std::mem::size_of::<arch_lbr_state>() - 40usize];
    ["Alignment of arch_lbr_state"][::std::mem::align_of::<arch_lbr_state>() - 8usize];
    ["Offset of field: arch_lbr_state::lbr_ctl"]
        [::std::mem::offset_of!(arch_lbr_state, lbr_ctl) - 0usize];
    ["Offset of field: arch_lbr_state::lbr_depth"]
        [::std::mem::offset_of!(arch_lbr_state, lbr_depth) - 8usize];
    ["Offset of field: arch_lbr_state::ler_from"]
        [::std::mem::offset_of!(arch_lbr_state, ler_from) - 16usize];
    ["Offset of field: arch_lbr_state::ler_to"]
        [::std::mem::offset_of!(arch_lbr_state, ler_to) - 24usize];
    ["Offset of field: arch_lbr_state::ler_info"]
        [::std::mem::offset_of!(arch_lbr_state, ler_info) - 32usize];
    ["Offset of field: arch_lbr_state::entries"]
        [::std::mem::offset_of!(arch_lbr_state, entries) - 40usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct xtile_cfg {
    pub tcfg: [u64_; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xtile_cfg"][::std::mem::size_of::<xtile_cfg>() - 64usize];
    ["Alignment of xtile_cfg"][::std::mem::align_of::<xtile_cfg>() - 1usize];
    ["Offset of field: xtile_cfg::tcfg"][::std::mem::offset_of!(xtile_cfg, tcfg) - 0usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct xtile_data {
    pub tmm: reg_1024_byte,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xtile_data"][::std::mem::size_of::<xtile_data>() - 1024usize];
    ["Alignment of xtile_data"][::std::mem::align_of::<xtile_data>() - 1usize];
    ["Offset of field: xtile_data::tmm"][::std::mem::offset_of!(xtile_data, tmm) - 0usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ia32_pasid_state {
    pub pasid: u64_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ia32_pasid_state"][::std::mem::size_of::<ia32_pasid_state>() - 8usize];
    ["Alignment of ia32_pasid_state"][::std::mem::align_of::<ia32_pasid_state>() - 1usize];
    ["Offset of field: ia32_pasid_state::pasid"]
        [::std::mem::offset_of!(ia32_pasid_state, pasid) - 0usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct xstate_header {
    pub xfeatures: u64_,
    pub xcomp_bv: u64_,
    pub reserved: [u64_; 6usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xstate_header"][::std::mem::size_of::<xstate_header>() - 64usize];
    ["Alignment of xstate_header"][::std::mem::align_of::<xstate_header>() - 1usize];
    ["Offset of field: xstate_header::xfeatures"]
        [::std::mem::offset_of!(xstate_header, xfeatures) - 0usize];
    ["Offset of field: xstate_header::xcomp_bv"]
        [::std::mem::offset_of!(xstate_header, xcomp_bv) - 8usize];
    ["Offset of field: xstate_header::reserved"]
        [::std::mem::offset_of!(xstate_header, reserved) - 16usize];
};
#[repr(C)]
#[repr(align(64))]
pub struct xregs_state {
    pub i387: fxregs_state,
    pub header: xstate_header,
    pub extended_state_area: __IncompleteArrayField<u8_>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xregs_state"][::std::mem::size_of::<xregs_state>() - 576usize];
    ["Alignment of xregs_state"][::std::mem::align_of::<xregs_state>() - 64usize];
    ["Offset of field: xregs_state::i387"][::std::mem::offset_of!(xregs_state, i387) - 0usize];
    ["Offset of field: xregs_state::header"]
        [::std::mem::offset_of!(xregs_state, header) - 512usize];
    ["Offset of field: xregs_state::extended_state_area"]
        [::std::mem::offset_of!(xregs_state, extended_state_area) - 576usize];
};
#[repr(C)]
#[repr(align(64))]
pub struct fpregs_state {
    pub fsave: __BindgenUnionField<fregs_state>,
    pub fxsave: __BindgenUnionField<fxregs_state>,
    pub soft: __BindgenUnionField<swregs_state>,
    pub xsave: __BindgenUnionField<xregs_state>,
    pub __padding: __BindgenUnionField<[u8_; 4096usize]>,
    pub bindgen_union_field: [u8; 4096usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fpregs_state"][::std::mem::size_of::<fpregs_state>() - 4096usize];
    ["Alignment of fpregs_state"][::std::mem::align_of::<fpregs_state>() - 64usize];
    ["Offset of field: fpregs_state::fsave"][::std::mem::offset_of!(fpregs_state, fsave) - 0usize];
    ["Offset of field: fpregs_state::fxsave"]
        [::std::mem::offset_of!(fpregs_state, fxsave) - 0usize];
    ["Offset of field: fpregs_state::soft"][::std::mem::offset_of!(fpregs_state, soft) - 0usize];
    ["Offset of field: fpregs_state::xsave"][::std::mem::offset_of!(fpregs_state, xsave) - 0usize];
    ["Offset of field: fpregs_state::__padding"]
        [::std::mem::offset_of!(fpregs_state, __padding) - 0usize];
};
#[repr(C)]
#[repr(align(64))]
pub struct fpstate {
    pub size: ::std::os::raw::c_uint,
    pub user_size: ::std::os::raw::c_uint,
    pub xfeatures: u64_,
    pub user_xfeatures: u64_,
    pub xfd: u64_,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u64; 3usize],
    pub regs: fpregs_state,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fpstate"][::std::mem::size_of::<fpstate>() - 4160usize];
    ["Alignment of fpstate"][::std::mem::align_of::<fpstate>() - 64usize];
    ["Offset of field: fpstate::size"][::std::mem::offset_of!(fpstate, size) - 0usize];
    ["Offset of field: fpstate::user_size"][::std::mem::offset_of!(fpstate, user_size) - 4usize];
    ["Offset of field: fpstate::xfeatures"][::std::mem::offset_of!(fpstate, xfeatures) - 8usize];
    ["Offset of field: fpstate::user_xfeatures"]
        [::std::mem::offset_of!(fpstate, user_xfeatures) - 16usize];
    ["Offset of field: fpstate::xfd"][::std::mem::offset_of!(fpstate, xfd) - 24usize];
    ["Offset of field: fpstate::regs"][::std::mem::offset_of!(fpstate, regs) - 64usize];
};
impl fpstate {
    #[inline]
    pub fn is_valloc(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_is_valloc(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn is_guest(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_is_guest(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn is_confidential(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_is_confidential(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn in_use(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_in_use(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        is_valloc: ::std::os::raw::c_uint,
        is_guest: ::std::os::raw::c_uint,
        is_confidential: ::std::os::raw::c_uint,
        in_use: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let is_valloc: u32 = unsafe { ::std::mem::transmute(is_valloc) };
            is_valloc as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let is_guest: u32 = unsafe { ::std::mem::transmute(is_guest) };
            is_guest as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let is_confidential: u32 = unsafe { ::std::mem::transmute(is_confidential) };
            is_confidential as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let in_use: u32 = unsafe { ::std::mem::transmute(in_use) };
            in_use as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fpu_state_perm {
    pub __state_perm: u64_,
    pub __state_size: ::std::os::raw::c_uint,
    pub __user_state_size: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fpu_state_perm"][::std::mem::size_of::<fpu_state_perm>() - 16usize];
    ["Alignment of fpu_state_perm"][::std::mem::align_of::<fpu_state_perm>() - 8usize];
    ["Offset of field: fpu_state_perm::__state_perm"]
        [::std::mem::offset_of!(fpu_state_perm, __state_perm) - 0usize];
    ["Offset of field: fpu_state_perm::__state_size"]
        [::std::mem::offset_of!(fpu_state_perm, __state_size) - 8usize];
    ["Offset of field: fpu_state_perm::__user_state_size"]
        [::std::mem::offset_of!(fpu_state_perm, __user_state_size) - 12usize];
};
#[repr(C)]
#[repr(align(64))]
pub struct fpu {
    pub last_cpu: ::std::os::raw::c_uint,
    pub avx512_timestamp: ::std::os::raw::c_ulong,
    pub fpstate: *mut fpstate,
    pub __task_fpstate: *mut fpstate,
    pub perm: fpu_state_perm,
    pub guest_perm: fpu_state_perm,
    pub __fpstate: fpstate,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fpu"][::std::mem::size_of::<fpu>() - 4224usize];
    ["Alignment of fpu"][::std::mem::align_of::<fpu>() - 64usize];
    ["Offset of field: fpu::last_cpu"][::std::mem::offset_of!(fpu, last_cpu) - 0usize];
    ["Offset of field: fpu::avx512_timestamp"]
        [::std::mem::offset_of!(fpu, avx512_timestamp) - 8usize];
    ["Offset of field: fpu::fpstate"][::std::mem::offset_of!(fpu, fpstate) - 16usize];
    ["Offset of field: fpu::__task_fpstate"][::std::mem::offset_of!(fpu, __task_fpstate) - 24usize];
    ["Offset of field: fpu::perm"][::std::mem::offset_of!(fpu, perm) - 32usize];
    ["Offset of field: fpu::guest_perm"][::std::mem::offset_of!(fpu, guest_perm) - 48usize];
    ["Offset of field: fpu::__fpstate"][::std::mem::offset_of!(fpu, __fpstate) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fpu_guest {
    pub xfeatures: u64_,
    pub perm: u64_,
    pub xfd_err: u64_,
    pub uabi_size: ::std::os::raw::c_uint,
    pub fpstate: *mut fpstate,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fpu_guest"][::std::mem::size_of::<fpu_guest>() - 40usize];
    ["Alignment of fpu_guest"][::std::mem::align_of::<fpu_guest>() - 8usize];
    ["Offset of field: fpu_guest::xfeatures"]
        [::std::mem::offset_of!(fpu_guest, xfeatures) - 0usize];
    ["Offset of field: fpu_guest::perm"][::std::mem::offset_of!(fpu_guest, perm) - 8usize];
    ["Offset of field: fpu_guest::xfd_err"][::std::mem::offset_of!(fpu_guest, xfd_err) - 16usize];
    ["Offset of field: fpu_guest::uabi_size"]
        [::std::mem::offset_of!(fpu_guest, uabi_size) - 24usize];
    ["Offset of field: fpu_guest::fpstate"][::std::mem::offset_of!(fpu_guest, fpstate) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fpu_state_config {
    pub max_size: ::std::os::raw::c_uint,
    pub default_size: ::std::os::raw::c_uint,
    pub max_features: u64_,
    pub default_features: u64_,
    pub legacy_features: u64_,
    pub independent_features: u64_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fpu_state_config"][::std::mem::size_of::<fpu_state_config>() - 40usize];
    ["Alignment of fpu_state_config"][::std::mem::align_of::<fpu_state_config>() - 8usize];
    ["Offset of field: fpu_state_config::max_size"]
        [::std::mem::offset_of!(fpu_state_config, max_size) - 0usize];
    ["Offset of field: fpu_state_config::default_size"]
        [::std::mem::offset_of!(fpu_state_config, default_size) - 4usize];
    ["Offset of field: fpu_state_config::max_features"]
        [::std::mem::offset_of!(fpu_state_config, max_features) - 8usize];
    ["Offset of field: fpu_state_config::default_features"]
        [::std::mem::offset_of!(fpu_state_config, default_features) - 16usize];
    ["Offset of field: fpu_state_config::legacy_features"]
        [::std::mem::offset_of!(fpu_state_config, legacy_features) - 24usize];
    ["Offset of field: fpu_state_config::independent_features"]
        [::std::mem::offset_of!(fpu_state_config, independent_features) - 32usize];
};
extern "C" {
    pub static mut fpu_kernel_cfg: fpu_state_config;
}
extern "C" {
    pub static mut fpu_user_cfg: fpu_state_config;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct getcpu_cache {
    _unused: [u8; 0],
}
extern "C" {
    pub fn __vdso_getcpu(
        cpu: *mut ::std::os::raw::c_uint,
        node: *mut ::std::os::raw::c_uint,
        unused: *mut getcpu_cache,
    ) -> ::std::os::raw::c_long;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct thread_shstk {
    pub base: u64_,
    pub size: u64_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of thread_shstk"][::std::mem::size_of::<thread_shstk>() - 16usize];
    ["Alignment of thread_shstk"][::std::mem::align_of::<thread_shstk>() - 8usize];
    ["Offset of field: thread_shstk::base"][::std::mem::offset_of!(thread_shstk, base) - 0usize];
    ["Offset of field: thread_shstk::size"][::std::mem::offset_of!(thread_shstk, size) - 8usize];
};
extern "C" {
    pub fn shstk_prctl(
        task: *mut task_struct,
        option: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn reset_thread_features();
}
extern "C" {
    pub fn shstk_alloc_thread_stack(
        p: *mut task_struct,
        clone_flags: ::std::os::raw::c_ulong,
        stack_size: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn shstk_free(p: *mut task_struct);
}
extern "C" {
    pub fn setup_signal_shadow_stack(ksig: *mut ksignal) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn restore_signal_shadow_stack() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn shstk_update_last_frame(val: ::std::os::raw::c_ulong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn shstk_is_enabled() -> bool_;
}
pub const UNAME26: _bindgen_ty_8 = 131072;
pub const ADDR_NO_RANDOMIZE: _bindgen_ty_8 = 262144;
pub const FDPIC_FUNCPTRS: _bindgen_ty_8 = 524288;
pub const MMAP_PAGE_ZERO: _bindgen_ty_8 = 1048576;
pub const ADDR_COMPAT_LAYOUT: _bindgen_ty_8 = 2097152;
pub const READ_IMPLIES_EXEC: _bindgen_ty_8 = 4194304;
pub const ADDR_LIMIT_32BIT: _bindgen_ty_8 = 8388608;
pub const SHORT_INODE: _bindgen_ty_8 = 16777216;
pub const WHOLE_SECONDS: _bindgen_ty_8 = 33554432;
pub const STICKY_TIMEOUTS: _bindgen_ty_8 = 67108864;
pub const ADDR_LIMIT_3GB: _bindgen_ty_8 = 134217728;
pub type _bindgen_ty_8 = ::std::os::raw::c_uint;
pub const PER_LINUX: _bindgen_ty_9 = 0;
pub const PER_LINUX_32BIT: _bindgen_ty_9 = 8388608;
pub const PER_LINUX_FDPIC: _bindgen_ty_9 = 524288;
pub const PER_SVR4: _bindgen_ty_9 = 68157441;
pub const PER_SVR3: _bindgen_ty_9 = 83886082;
pub const PER_SCOSVR3: _bindgen_ty_9 = 117440515;
pub const PER_OSR5: _bindgen_ty_9 = 100663299;
pub const PER_WYSEV386: _bindgen_ty_9 = 83886084;
pub const PER_ISCR4: _bindgen_ty_9 = 67108869;
pub const PER_BSD: _bindgen_ty_9 = 6;
pub const PER_SUNOS: _bindgen_ty_9 = 67108870;
pub const PER_XENIX: _bindgen_ty_9 = 83886087;
pub const PER_LINUX32: _bindgen_ty_9 = 8;
pub const PER_LINUX32_3GB: _bindgen_ty_9 = 134217736;
pub const PER_IRIX32: _bindgen_ty_9 = 67108873;
pub const PER_IRIXN32: _bindgen_ty_9 = 67108874;
pub const PER_IRIX64: _bindgen_ty_9 = 67108875;
pub const PER_RISCOS: _bindgen_ty_9 = 12;
pub const PER_SOLARIS: _bindgen_ty_9 = 67108877;
pub const PER_UW7: _bindgen_ty_9 = 68157454;
pub const PER_OSF4: _bindgen_ty_9 = 15;
pub const PER_HPUX: _bindgen_ty_9 = 16;
pub const PER_MASK: _bindgen_ty_9 = 255;
pub type _bindgen_ty_9 = ::std::os::raw::c_uint;
extern "C" {
